{
  "hexagrams": [
    {
      "id": 1,
      "key": "qian",
      "hexCode": "111111",
      "trigrams": {
        "upper": "qian",
        "lower": "qian"
      },
      "name": {
        "zh": "乾",
        "en": "Initiating"
      },
      "judgement": {
        "zh": "乾：元亨，利贞。\n\n原文出自《周易》乾卦卦辞。\n简要解释：大通顺，大吉大利，利于守正、坚持正道。代表事物处于最强盛、最纯粹的阳刚状态，开始极好、发展顺利，但必须保持正直才能长久有利。",
        "en": "THE CREATIVE works sublime success, Furthering through perseverance."
      },
      "image": {
        "zh": "象曰：天行健，君子以自强不息。\n\n简要解释：天的运行刚健有力，从不停止。君子看到这个现象，就要效法天道，让自己永远努力向上、坚强不懈，永不松懈、永不退缩。",
        "en": "The movement of heaven is full of power. Thus the superior man makes himself strong and untiring."
      },
      "tuan": {
        "zh": "",
        "en": "According to the original meaning, the attributes [sublimity, potentiality of success, power to further, perseverance] are paired. When an individual draws this oracle, it means that success will come to him from the primal depths of the universe and that everything depends upon his seeking his happiness and that of others in one way only, that is, by perseverance in what is right. The specific meanings of the four attributes became the subject of speculation at an early date. The Chinese word here rendered by \"sublime\" means literally \"head,\" \"origin,\" \"great.\" This is why Confucius says in explaining it: \"Great indeed is the generating power of the Creative; all beings owe their beginning to it. This power permeates all heaven.\" For this attribute inheres in the other three as well. The beginning of all things lies still in the beyond in the form of ideas that have yet to become real. But the Creative furthermore has power to lend form to these archetypes of ideas. This is indicated in the word success, and the process is represented by an image from nature: \"The clouds pass and the rain does its work, and all individual beings flow into their forms.\" Applies to the human world, these attributes show the great man the way to notable success: \"Because he sees with great clarity and cause and effects, he completes the six steps at the right time and mounts toward heaven on them at the right time, as though on six dragons.\" The six steps are the six different positions given in the hexagram, which are represented later by the dragon symbol. Here it is shown that the way to success lies in apprehending and giving actuality to the way of the universe [Tao], which, as a law running through end and beginning, brings about all phenomena in time. Thus each step attained forthwith becomes a preparation for the next. Time is no longer a hindrance but the means of making actual what is potential. The act of creation having found expression in the two attributes sublimity and success, the work of conservation is shown to be a continuous actualization and differentiation of form. This is expressed in the two terms \"furthering\" (literally, \"creating that which accords with the nature of a given being\") and \"persevering\" (literally, \"correct and firm\"). \"The course of the Creative alters and shapes beings until each attains its true, specific nature, then it keeps them in conformity with the Great Harmony. Thus does it show itself to further through perseverance.\" In relation to the human sphere, this shows how the great man brings peace and security to the world through his activity in creating order: \"He towers high above the multitude of beings, and all lands are united in peace.\" Another line of speculation goes still further in separating the words \"sublime,\" \"success,\" \"furthering,\" \"perseverance,\" and parallels them with the four cardinal virtues in humanity. To sublimity, which, as the fundamental principle, embraces all the other attributes, it links love. To the attribute success are linked the morals, which regulate and organize expressions of love and thereby make them successful. The attribute furthering is correlated with justice, which creates the conditions in which each receives that which accords with his being, that which is due him and which constitutes his happiness. The attribute perseverance is correlated with wisdom, which discerns the immutable laws of all that happens and can therefore bring about enduring conditions. These speculations, already broached in the commentary called Wên Yen , later formed the bridge connecting the philosophy of the \"five stages (elements) of change,\" as laid down in the Book of History (Shu Ching) with the philosophy of the Book of Changes, which is based solely on the polarity of positive and negative principles. In the course of time this combination of the two systems of thought opened the way for an increasingly intricate number symbolism."
      },
      "lines": [
        {
          "zh": "初九：潜龙，勿用。\n（刚开始还藏在水底，别急着表现，先默默发育攒实力）",
          "en": "Hidden dragon. Do not act."
        },
        {
          "zh": "九二：见龙在田，利见大人。\n（龙已经露头在田野了，有真本事开始被看见了，这时候适合去接触有格局的大佬，容易得到赏识和帮助）",
          "en": "Dragon appearing in the field. It furthers one to see the great man."
        },
        {
          "zh": "九三：君子终日乾乾，夕惕若，厉无咎。\n（白天拼命干，晚上还提心吊胆地反省，已经很厉害但位置尴尬，战战兢兢反而没事，松懈反而有危险）",
          "en": "All day long the superior man is creatively active. At nightfall his mind is still beset with cares. Danger. No blame."
        },
        {
          "zh": "九四：或跃在渊，无咎。\n（到了关键决策点，要不要跳？可以试着起飞，也可以继续沉潜观察，随你选，只要别瞎搞就不会有大错）",
          "en": "Wavering flight over the depths. No blame."
        },
        {
          "zh": "九五：飞龙在天，利见大人。\n（龙已经飞到最高处，处于人生/事业巅峰，这时候最适合跟真正的大人物合作、做事，效果最好）",
          "en": "Flying dragon in the heavens. It furthers one to see the great man."
        },
        {
          "zh": "上九：亢龙有悔。\n（龙飞得太高太满，太过刚强过头了，物极必反，会后悔。提醒再牛也要懂得收敛、知进知退）",
          "en": "Arrogant dragon will have cause to repent."
        }
      ],
      "summary": {
        "zh": "嘿，抽到乾卦就是六个阳爻，全满状态，超级刚猛、超级有力量的一卦。\n一句话总结：现在是你最猛、最有冲劲、最能carry全场的时候，但别飘——要一直硬扛、一直往前冲、千万别停、也千万别歪，不然这股劲儿很容易把自己玩崩。简单讲就是：使劲儿干、使劲儿卷、但得正着卷！"
      }
    },
    {
      "id": 2,
      "key": "kun",
      "hexCode": "000000",
      "trigrams": {
        "upper": "kun",
        "lower": "kun"
      },
      "name": {
        "zh": "坤",
        "en": "Responding"
      },
      "judgement": {
        "zh": "坤：元亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞吉。\n简释：坤卦大通顺，利于像母马一样柔顺、守正。君子有所行动，如果抢先会迷失方向，跟随在后反而能找到正确的主人。西南方向有利可得朋友，东北方向会失去朋友。保持安静守正就会吉祥。",
        "en": "THE RECEPTIVE brings about sublime success, Furthering through the perseverance of a mare. If the superior man undertakes something and tries to lead, He goes astray; But if he follows, he finds guidance. It is favorable to find friends in the west and south, To forego friends in the east and north. Quiet perseverance brings good fortune."
      },
      "image": {
        "zh": "象曰：地势坤，君子以厚德载物。\n简释：大地广阔厚实、承载万物，君子看到这个卦象，就要效法大地，用宽厚的德行去包容、承载一切人事物。",
        "en": "The earth's condition is receptive devotion. Thus the superior man who has breadth of character Carries the outer world."
      },
      "tuan": {
        "zh": "",
        "en": "The four fundamental aspects of the Creative--\"sublime success, furthering through perseverance\"--are also attributed to the Receptive. Here, however, the perseverance is more closely defined: it is that of a mare. The Receptive connotes spatial reality in contrast to the spiritual potentiality of the Creative. The potential becomes real and the spiritual becomes spatial through a specifically qualifying definition. Thus the qualification, \"of a mare,\" is here added to the idea of perseverance. The horse belongs to earth just as the dragon belongs to heaven. Its tireless roaming over the plains is taken as a symbol of the vast expanse of the earth. This is the symbol chosen because the mare combines the strength and swiftness of the horse with the gentleness and devotion of the cow. Only because nature in its myriad forms corresponds with the myriad impulses of the Creative can it make these impulses real. Nature's richness lies in its power to nourish all living things; its greatness lies in its power to give then beauty and splendor. Thus it prospers all that lives. IT is the Creative that begets things, but they are brought to birth by the Receptive. Applied to human affairs, therefore, what the hexagram indicated is action in conformity with the situation. The person in questions not in an independent position, but is acting as an assistant. This means that he must achieve something. It is not his task to try to lead--that would only make him lose the way-but to let himself be led. If he knows how to meet fate with an attitude of acceptance, he is sure to find the right guidance. The superior man lets himself be guided; he does not go ahead blindly, but learns from the situation what is demanded of him and then follows this intimation from fate. Since there is something to be accomplished, we need friends and helpers in the hour of toil and effort, once the ideas to be realized are firmly set. The time of toil and effort is indicated by the west and south, for west and south symbolize the place where the Receptive works for the Creative, as nature does in summer and autumn. If in that situation one does not mobilize all one's powers, the work to be accomplished will not be done. Hence to find friends there means to find guidance. But in addition to the time of toil and effort, there is also a time of planning, and for this we need this solitude. The east symbolized the place where a man receives orders from his master, and the north the place where he reports on what he has done. At that time he must be alone and objective. In this sacred hour he must do without companions. So that the purity of the moment may not be spoiled by fictional hates and favoritism."
      },
      "lines": [
        {
          "zh": "初六：履霜，坚冰至。\n解释：踩到一点霜了，预示着大冻就要来了。提醒见微知著，小问题不处理后面会变严重。",
          "en": "When there is hoarfrost underfoot, Solid ice is not far off."
        },
        {
          "zh": "六二：直方大，不习无不利。\n解释：正直、方正、容量广大，就算没啥经验也不会不利。形容真正有德的人自然而然就做得好。",
          "en": "Straight, square, great. Without purpose, Yet nothing remains unfurthered."
        },
        {
          "zh": "六三：含章可贞。或从王事，无成有终。\n解释：内里藏着美好文采但保持低调守正。假如参与国家大事，不抢着居功、但能善始善终就行。",
          "en": "Hidden lines. One is able to remain persevering. If by chance you are in the service of a king, Seek not works, but bring to completion."
        },
        {
          "zh": "六四：括囊，无咎无誉。\n解释：把口袋扎紧（谨言慎行、低调不露锋芒），这样既不会出错，也不会得到特别赞誉。明哲保身的中庸之道。",
          "en": "A tied-up sack. No blame, no praise."
        },
        {
          "zh": "六五：黄裳，元吉。\n解释：穿黄色的下裳（中正、柔顺又有分寸），大吉大利。这是坤卦最尊贵、最好的位置，代表柔中带正、极致中庸的最高境界。",
          "en": "A yellow lower garment brings supreme good fortune."
        },
        {
          "zh": "上六：龙战于野，其血玄黄。\n解释：阴气发展到极点，阴阳开始激烈冲突，像两条龙在野外打架，流出的血是黑黄相间。物极必反，柔顺过头就变阴谋、争斗，结局惨烈。",
          "en": "Dragons fight in the meadow. Their blood is black and yellow."
        }
      ],
      "summary": {
        "zh": "哎，坤卦就是最纯的阴、最柔顺、最接地气的一卦。核心就俩字：顺和厚。像大地一样啥都装得下、不争先、但也不瞎争，懂得低调、包容、跟着对的方向走就行。别老想着出头当老大，踏实、忍耐、厚道反而最后啥都有。生活中遇到坤卦，多半提醒你：别硬刚，先服软、稳住、慢慢来，反而路会越走越宽。"
      }
    },
    {
      "id": 3,
      "key": "zhun",
      "hexCode": "100010",
      "trigrams": {
        "upper": "kan",
        "lower": "zhen"
      },
      "name": {
        "zh": "屯",
        "en": "Beginning"
      },
      "judgement": {
        "zh": "屯：元亨，利贞。勿用有攸往，利建侯。\n\n原文卦辞意思是：屯卦有大吉大利的潜质，坚持正道有利。但现在千万不要急着行动、有所前往，在这种艰难起步阶段，最有利的是建立同盟、培养根基、封侯建国（拉队伍、找伙伴、打基础）。",
        "en": "DIFFICULTY AT THE BEGINNING works supreme success, Furthering through perseverance. Nothing should be undertaken. It furthers one to appoint helpers."
      },
      "image": {
        "zh": "象曰：云，雷，屯；君子以经纶。\n\n象辞说：云在上，雷在下，这就是屯卦的景象。君子看到这个卦象，就要学习像云雷酝酿大雨一样，在混乱草创时期辛勤筹划、治理天下（经纶就是经天纬地、规划大业的意思）。",
        "en": "Clouds and thunder: The image of DIFFICULTY AT THE BEGINNING. Thus the superior man Brings order out of confusion."
      },
      "tuan": {
        "zh": "",
        "en": "Times of growth are beset with difficulties. They resemble a first birth. But these difficulties arise from the very profusion of all that is struggling to attain form . Everything is in motion: therefore if one perseveres there is a prospect of great success, in spite of the existing danger. When it is a man's fate to undertake such new beginnings, everything is still unformed, dark. Hence he must hold back, because any premature move might bring disaster. Likewise, it is very important not to remain alone; in order to overcome the chaos he needs helpers. This is not to say, however, that he himself should look on passively at what is happening. He must lend his hand and participate with inspiration and guidance."
      },
      "lines": [
        {
          "zh": "初九：盘桓，利居贞，利建侯。\n刚起步最迷茫，像石头一样转圈徘徊（盘桓）。这时候最聪明的是待在原地守正、别乱跑，同时赶紧拉队伍、建根据地（利建侯），才能聚人气、得民心。",
          "en": "Hesitation and hindrance. It furthers one to remain persevering. It furthers one to appoint helpers."
        },
        {
          "zh": "六二：屯如邅如，乘马班如。匪寇，婚媾。女子贞不字，十年乃字。\n难上加难，犹豫徘徊，马儿转圈圈。来的不是土匪，是来求亲的队伍。可惜时机不对，女子守贞不嫁，硬是等了十年才成婚。意思是：好机会看着近在眼前，但条件不成熟，硬上只会翻车，必须超级有耐心熬到时机真正成熟。",
          "en": "Difficulties pile up. Horse and wagon part. He is not a robber; He wants to woo when the time comes. The maiden is chaste, She does not pledge herself. Ten years--then she pledges herself."
        },
        {
          "zh": "六三：即鹿无虞，惟入于林中。君子几，不如舍，往吝。\n追鹿没带向导（虞），结果鹿跑进密林里了。君子一看苗头不对，果断放弃，继续追只会自讨苦吃、陷入困境。提醒：看不清路、没人带、没把握的时候，千万别逞英雄，及时止损才是真智慧。",
          "en": "Whoever hunts deer without the forester Only loses his way in the forest. The superior man understands the signs of the time And prefers to desist. To go on brings humiliation."
        },
        {
          "zh": "九四：乘马班如，求婚媾，往吉，无不利。\n还是骑着马转圈，但这次是主动去求婚。往前走反而吉祥，一切有利。意思是：前面几爻憋得慌，到这里终于可以动了，但前提是你得主动出击、诚心求助或联姻，方向对了就一路绿灯。",
          "en": "Horse and wagon part. Strive for union. To go brings good fortune. Everything acts to further."
        },
        {
          "zh": "九五：屯其膏，小贞吉，大贞凶。\n囤积了很多油脂（财富、资源），小事守正吉祥，大事守正反而凶。意思是：现在有点小富即安的感觉，小打小闹、维持现状还行，但想干大事、扩张版图的话，这时候的保守反而会坏事，得有更大魄力突破。",
          "en": "Difficulties in blessing. A little perseverance brings good fortune. Great perseverance brings misfortune."
        },
        {
          "zh": "上六：乘马班如，泣血涟如。\n骑马还在转圈，眼泪鼻血一起流，哭得撕心裂肺。最惨的结局：错过时机、犹豫太久、到最后机会彻底没了，只能悲伤欲绝。警告：屯的艰难期不能无限拖，该动的时候不动，最后会哭都来不及。",
          "en": "Horse and wagon part. Bloody tears flow."
        }
      ],
      "summary": {
        "zh": "哎，屯卦就是那句老话——万事开头难。刚开始创业、恋爱、生小孩、做任何新事，都像春天小草拱土、雷雨交加前那种憋屈劲儿，到处是险阻、迷雾、动弹不得。但好消息是：它虽然难，却有元亨利贞的潜质，只要你别瞎冲、沉住气，先别想着一步登天，赶紧找靠谱伙伴、搭好团队、把地基打牢，熬过这阵最难受的阵痛期，后头就是生机勃勃、欣欣向荣了。简单说：起步期别浪，抱团发育最稳。"
      }
    },
    {
      "id": 4,
      "key": "meng",
      "hexCode": "010001",
      "trigrams": {
        "upper": "gen",
        "lower": "kan"
      },
      "name": {
        "zh": "蒙",
        "en": "Childhood"
      },
      "judgement": {
        "zh": "蒙。亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。\n解释：蒙卦代表蒙昧、启蒙阶段，虽然处于愚昧不明，但却是亨通的。不是老师主动去求学生，而是学生（童蒙）主动来求老师。第一次真诚求教就解答，如果反复轻率亵渎，就不再回答。利于守持正道。",
        "en": "YOUTHFUL FOLLY has success. It is not I who seek the young fool; The young fool seeks me. At the first oracle I inform him. If he asks two or three times, it is importunity. If he importunes, I give him no information. Perseverance furthers."
      },
      "image": {
        "zh": "象曰：山下出泉，蒙。君子以果行育德。\n解释：山下涌出泉水，这就是蒙卦的象征。君子看到这个景象，就要果断行动、坚定前行，同时培养自己的道德品行，就像泉水从山下源源不断涌出一样，坚持不懈地自我提升。",
        "en": "A spring wells up at the foot of the mountain: The image of YOUTH. Thus the superior man fosters his character By thoroughness in all that he does."
      },
      "tuan": {
        "zh": "",
        "en": "In the time of youth, folly is not an evil. One may succeed in spite of it, provided one finds an experienced teacher and has the right attitude toward him. This means, first of all, that the youth himself must be conscious of his lack of experience and must seek out the teacher. Without this modesty and this interest there is no guarantee that he has the necessary receptivity, which should express itself in respectful acceptance of the teacher. This is the reason why the teacher must wait to be sought out instead of offering himself. Only thus can the instruction take place at the right time and in the right way. A teacher's answer to the question of a pupil ought to be clear and definite like that expected from an oracle; thereupon it ought to be accepted as a key for resolution of doubts and a basis for decision. If mistrustful or unintelligent questioning is kept up, it serves only to annoy the teacher. He does well to ignore it in silence, just as the oracle gives one answer only and refuses to be tempted by questions implying doubt. Given addition a perseverance that never slackens until the points are mastered one by one, real success is sure to follow. Thus the hexagram counsels the teacher as well as the pupil."
      },
      "lines": [
        {
          "zh": "初六：发蒙，利用刑人，用说桎梏。以往吝。\n刚开始最蒙的时候，得用规矩、刑罚来规范，就像给犯人解开手铐脚镣帮他改过。但如果急于求成往前冲，反而会有遗憾和困难。",
          "en": "To make a fool develop It furthers one to apply discipline. The fetters should be removed. To go on in this way bring humiliation."
        },
        {
          "zh": "九二：包蒙，吉。纳妇吉。子克家。\n最吉利的老师爻！能包容各种蒙昧学生，像有教无类一样广泛接纳。就像娶媳妇生孩子、儿子能撑起家一样，教育得好，后继有人，大吉。",
          "en": "To bear with fools in kindliness brings good fortune. To know how to take women Brings good fortune. The son is capable of taking charge of the household."
        },
        {
          "zh": "六三：勿用取女，见金夫，不有躬。无攸利。\n别娶那种见钱眼开、见帅哥/有钱人就失身的女人。比喻有些学生见好处就变节、见更好的老师就跑路，三心二意，这种人教了也没用，什么事都干不成。",
          "en": "Take not a maiden who. When she sees a man of bronze, Loses possession of herself. Nothing furthers."
        },
        {
          "zh": "六四：困蒙，吝。\n自己被困在蒙昧里，孤立无援，远离好老师和正能量，挺惨的，有小遗憾、小困难。得赶紧找人带带，不然一直迷糊下去。",
          "en": "Entangled folly bring humiliation."
        },
        {
          "zh": "六五：童蒙，吉。\n保持像小孩子一样纯真求知的蒙昧状态，反而吉祥。谦虚、柔顺、愿意听老师的话，这种态度最容易开窍、最有前途。",
          "en": "Childlike folly brings good fortune."
        },
        {
          "zh": "上九：击蒙，不利为寇，利御寇。\n用严厉手段敲打启蒙可以，但不能太过火变成攻击别人（为寇），而是要用来防御坏影响、防止学生学坏（御寇）。教育该硬的时候要硬，但目的是保护和纠正，不是报复。",
          "en": "In punishing folly It does not further one To commit transgressions. The only thing that furthers Is to prevent transgressions."
        }
      ],
      "summary": {
        "zh": "嘿，兄弟，这蒙卦简单说就是‘懵懂期要好好学’的意思。人生或事情刚起步时，谁都迷迷糊糊，像小孩啥都不懂，这时候最关键的就是启蒙教育。老师别硬塞，学生得自己主动求教才行；学东西要真心实意，别三心二意反复骚扰老师，不然老师也懒得搭理你。核心就俩字：求学要诚，教育要正。守住初心、保持纯正，慢慢就开窍了，未来一片光明。"
      }
    },
    {
      "id": 5,
      "key": "xu",
      "hexCode": "111010",
      "trigrams": {
        "upper": "kan",
        "lower": "qian"
      },
      "name": {
        "zh": "需",
        "en": "Needing"
      },
      "judgement": {
        "zh": "需：有孚，光亨，贞吉。利涉大川。\n\n原文意思：需卦象征等待。保持诚信（有孚），前景光明通达（光亨），守正就会吉祥（贞吉）。有利于渡过大河难关（利涉大川）。\n简单说：现在时机未到，要耐心等，但只要有诚意、正直，最终会很顺利，甚至能干大事。",
        "en": "WAITING. If you are sincere, You have light and success. Perseverance brings good fortune. It furthers one to cross the great water."
      },
      "image": {
        "zh": "象曰：云上于天，需；君子以饮食宴乐。\n\n象辞意思：云在天上，还没下雨，这就是需卦的景象。君子看到这个意象，就安心吃喝、宴会享乐（不强求、不焦虑）。\n换句话说：该等的时候就好好过日子，别把自己搞得太紧张。",
        "en": "Clouds rise up to heaven: The image of WAITING. Thus the superior man eats and drinks, Is joyous and of good cheer."
      },
      "tuan": {
        "zh": "",
        "en": "Waiting is not mere empty hoping. It has the inner certainty of reaching the goal. Such certainty alone gives that light which leads to success. This leads to the perseverance that brings good fortune and bestows power to cross the great water. One is faced with a danger that has to be overcome. Weakness and impatience can do nothing. Only a strong man can stand up to his fate, for his inner security enables him to endure to the end. This strength shows itself in uncompromising truthfulness [with himself]. It is only when we have the courage to face things exactly as they are, without any sort of self-deception or illusion, that a light will develop out of events, by which the path to success may be recognized. This recognition must be followed by resolute and persevering action. For only the man who goes to meet his fate resolutely is equipped to deal with it adequately. Then he will be able to cross the great water--that is to say, he will be capable of making the necessary decision and of surmounting the danger."
      },
      "lines": [
        {
          "zh": "初九：需于郊。利用恒，无咎。\n在郊外等待。保持恒心不变，就没灾祸。→刚开始等，别急着进城，先远远看着，稳住心态最重要。",
          "en": "Waiting in the meadow. IT furthers one to abide in what endures. No blame."
        },
        {
          "zh": "九二：需于沙。小有言，终吉。\n在沙地上等待。会受到一点言语是非，但最终吉祥。→位置比初九近了点，开始听到风言风语了，别跟人吵，忍一忍就过去了。",
          "en": "Waiting on the sand. There is some gossip. The end brings good fortune."
        },
        {
          "zh": "九三：需于泥，致寇至。\n在泥泞中等待，招来盗寇。\n→太靠近危险地带了，位置尴尬，容易惹祸上身。这爻提醒：别站错队、别太冒进，否则等还没等到好结果，先被坑了。",
          "en": "Waiting in the mud Brings about the arrival of the enemy."
        },
        {
          "zh": "六四：需于血，出自穴。\n在血泊中等待，最终能从险境的洞穴里出来。\n→处境已经很危险了（血=伤），但只要坚持等待、不乱动，还是能脱险。比较惨但有转机的一爻。",
          "en": "Waiting in blood. Get out of the pit."
        },
        {
          "zh": "九五：需于酒食，贞吉。\n在酒食宴乐中等待，守正就吉祥。\n→这是需卦最好的位置！一边等一边吃吃喝喝，该干的事没耽误，心态也稳，最后大吉。典型的高位躺赢爻。",
          "en": "Waiting at meat and drink. Perseverance brings good fortune."
        },
        {
          "zh": "上六：入于穴，有不速之客三人来，敬之终吉。\n进入洞穴，有三个不请自来的客人到来，恭敬对待他们最终吉祥。\n→等太久了，忍不住想自己动手，结果引来意外之人。但只要态度好、尊重对方，反而因祸得福。最后一爻常有反转。",
          "en": "One falls into the pit. Three uninvited guests arrive. Honor them, and in the end there will be good fortune."
        }
      ],
      "summary": {
        "zh": "需卦就是告诉你：现在别急，时机还没成熟，强行往前冲大概率翻车。像排队买限量款一样，前面人多你就得等。真正聪明的人不是在那干瞪眼急得跳脚，而是该吃饭吃饭、该睡觉睡觉，该干嘛干嘛，心里有数，等风来了自然起飞。核心就四个字：耐心+诚信=后来居上。"
      }
    },
    {
      "id": 6,
      "key": "song",
      "hexCode": "010111",
      "trigrams": {
        "upper": "qian",
        "lower": "kan"
      },
      "name": {
        "zh": "讼",
        "en": "Contention"
      },
      "judgement": {
        "zh": "讼：有孚窒，惕，中吉，终凶。利见大人，不利涉大川。\n\n原文意思是：争讼是因为诚信被阻塞，心中有所警惕戒惧。过程中可能有吉祥，但最终结果是凶险的。利于去求见有德有位的大人来裁决，不利于冒险涉险渡大河（象征不要逞强、冒险激化矛盾）。",
        "en": "CONFLICT. You are sincere And are being obstructed. A cautious halt halfway brings good fortune. Going through to the end brings misfortune. It furthers one to see the great man. It does not further one to cross the great water."
      },
      "image": {
        "zh": "天与水违行，讼。君子以作事谋始。\n\n原文意思是：天向西转，水向东流，方向相反违背而行，这就是讼的卦象。君子看到这个卦象，就要在做事情一开始就深思熟虑、慎重谋划，避免争端产生。",
        "en": "Heaven and water go their opposite ways: The image of CONFLICT. Thus in all his transactions the superior man Carefully considers the beginning."
      },
      "tuan": {
        "zh": "",
        "en": "Conflict develops when one feels himself to be in the right and runs into opposition. If one is not convinced of being in the right, opposition leads to craftiness or high-handed encroachment but not to open conflict. If a man is entangled in a conflict, his only salvation lies in being so clear-headed and inwardly strong that he is always ready to come to terms by meeting the opponent halfway. To carry one the conflict to the bitter end has evil effects even when one is the right, because the enmity is then perpetuated. It is important to see the great man, that is, an impartial man whose authority is great enough to terminate the conflict amicably or assure a just decision. In times of strife, crossing the great water is to be avoided, that is, dangerous enterprises are not to be begun, because in order to be successful they require concerted unity of focus. Conflict within weakens the power to conquer danger without."
      },
      "lines": [
        {
          "zh": "初六：不永所事，小有言，终吉。\n意思是：不要把争执没完没了地拖下去，虽然会有点小口舌、小是非，但最终是吉祥的。→ 建议小矛盾别纠缠，及时止损就好。",
          "en": "If one does not perpetuate the affair, There is a little gossip. In the end, good fortune comes."
        },
        {
          "zh": "九二：不克讼，归而逋，其邑人三百户无眚。\n意思是：打官司打不赢，赶紧回家躲起来（逃避），连带着自己封邑里的三百户人家都没灾祸。\n→ 实力不够就别硬碰，认怂撤退反而保平安。",
          "en": "One cannot engage in conflict; One returns home, gives way. The people of his town, Three hundred households, Remain free of guilt."
        },
        {
          "zh": "六三：食旧德，贞厉，终吉。或从王事，无成。\n意思是：安守着祖上或过去的德行福荫，坚守正道虽然有危险，但最终吉祥。如果去帮官府做事，反而难有成就。\n→ 低调守旧、别出头，别想着靠争讼立功。",
          "en": "To nourish oneself on ancient virtue induces perseverance. Danger. In the end, good fortune comes. If by chance you are in the service of a king, Seek not works."
        },
        {
          "zh": "九四：不克讼，复即命，渝，安贞吉。\n意思是：官司还是打不赢，那就回头听从天命、改变态度，安守正道就吉祥。\n→ 知难而退、及时调整心态、回归正轨，反而转危为安。",
          "en": "One cannot engage in conflict. One turns back and submits to fate, Changes one's attitude, And finds peace in perseverance. Good fortune."
        },
        {
          "zh": "九五：讼，元吉。\n意思是：官司打得非常成功，大吉大利。\n→ 这是全卦最爽的一爻，通常代表遇到公正的大人或自己处于中正有理的位置，官司能大获全胜。",
          "en": "To contend before him Brings supreme good fortune."
        },
        {
          "zh": "上九：或锡之鞶带，终朝三褫之。\n意思是：或许被赏赐了大官带（很高荣誉），但一天之内就被三次剥夺。\n→ 就算赢了官司、得了大好处，也守不住，很快就会被夺走、乐极生悲。提醒胜讼也不要得意忘形。",
          "en": "Even if by chance a leather belt is bestowed on one,' By the end of a morning It will have been snatched away three times."
        }
      ],
      "summary": {
        "zh": "嘿，这讼卦简单说就是一句话：别轻易打官司、吵架、闹矛盾！一开始可能觉得自己有理、能占点便宜，但越闹越大，最后基本没好下场。最好的办法是找个有权威、讲道理的大佬来调解，千万别自己硬刚、冒险扩大事态。核心就俩字——‘息讼’、‘慎始’，能忍就忍，能和就和，凡事从一开始就想清楚，别走到法庭见。"
      }
    },
    {
      "id": 7,
      "key": "shi",
      "hexCode": "010000",
      "trigrams": {
        "upper": "kun",
        "lower": "kan"
      },
      "name": {
        "zh": "师",
        "en": "Multitude"
      },
      "judgement": {
        "zh": "师。贞，丈人吉，无咎。\n\n意思是：用兵打仗要出师有名（贞正），任用德高望重、经验丰富的老成持重之人（丈人）来统帅军队，就能吉祥，没有灾祸。",
        "en": "THE ARMY. The army needs perseverance And a strong man. Good fortune without blame. An army is a mass that needs organization in order to become a fighting force."
      },
      "image": {
        "zh": "象曰：地中有水，师。君子以容民畜众。\n\n意思是：大地里面藏着水，这就是师卦的卦象。君子看到这个景象，就应该平时广泛接纳、包容百姓，蓄养众人（寓兵于农，藏兵于民），为有需要时聚集力量做准备。",
        "en": "In the middle of the earth is water: The image of THE ARMY. Thus the superior man increases his masses By generosity toward the people."
      },
      "tuan": {
        "zh": "",
        "en": "Without strict discipline nothing can be accomplished, but this discipline must not be achieved by force. It requires a strong man who captures the hearts of the people and awakens their enthusiasm. In order that he may develop his abilities he needs the complete confidence of his ruler, who must entrust him with full responsibility as long as the war lasts. But war is always a dangerous thing and brings with it destruction and devastation. Therefore it should not be resorted to rashly but, like a poisonous drug, should be used as a last recourse."
      },
      "lines": [
        {
          "zh": "初六：师出以律，否臧凶。\n出兵打仗一定要有严格的军纪法律约束，不然纪律败坏就非常凶险。",
          "en": "An army must set forth in proper order. If the order is not good, misfortune threatens."
        },
        {
          "zh": "九二：在师中吉，无咎，王三锡命。\n作为统帅身在军队中间持中守正，就能吉祥，没有灾祸，还会得到君王多次（三锡）褒奖嘉命。",
          "en": "In the midst of the army. Good fortune. No blame. The king bestows a triple decoration."
        },
        {
          "zh": "六三：师或舆尸，凶。\n带兵打仗如果搞成有人用车拉着尸体回来这种惨况，那就大凶，基本是打了大败仗。",
          "en": "Perchance the army carries corpses in the wagon. Misfortune."
        },
        {
          "zh": "六四：师左次，无咎。\n军队暂时退到左边（侧翼或安全地带）驻扎休整，没有灾祸（懂得适时退守、不硬拼也是智慧）。",
          "en": "The army retreats. No blame."
        },
        {
          "zh": "六五：田有禽，利执言，无咎；长子帅师，弟子舆尸，贞凶。\n田里有猎物，利于发布明确的命令出击抓捕，没有灾祸；但如果让嫡长子（靠谱的人）带兵就行，要是让小儿子（不靠谱的亲信、弟子）带兵那就只能抬尸体回来，坚持这么干就凶险。",
          "en": "There is game in the field. It furthers one to catch it. Without blame. Let the eldest lead the army. The younger transports corpses; Then perseverance brings misfortune."
        },
        {
          "zh": "上六：大君有命，开国承家，小人勿用。\n大战胜利后，大君（天子）颁布命令，封赏有功之人，开创诸侯国家、承续大夫家族，但千万不要重用小人。",
          "en": "The great prince issues commands, Founds states, vests families with fiefs. Inferior people should not be employed."
        }
      ],
      "summary": {
        "zh": "嘿，师卦讲的就是带队伍、打仗、管理一大帮人的那回事儿。核心就一句话：闹矛盾到没法调和了，得动真格了，但打仗这事儿风险超级大，所以必须师出有名、正大光明，而且得找个靠谱、有威望、老练的大佬来带队才行，不然很容易翻车。整个卦都在强调纪律、统帅能力和藏兵于民的平时准备。说白了就是：带人要正、选将要准、纪律要严、不能乱来。"
      }
    },
    {
      "id": 8,
      "key": "bi",
      "hexCode": "000010",
      "trigrams": {
        "upper": "kan",
        "lower": "kun"
      },
      "name": {
        "zh": "比",
        "en": "Union"
      },
      "judgement": {
        "zh": "比。吉。原筮，元永贞，无咎。不宁方来，后夫凶。\n\n解释：比卦整体大吉大利。强调从一开始就要用至诚、永久守正的态度去亲近联合，就不会有灾祸。那些不安定、犹豫不决的国家或人会渐渐来归附，但如果拖到最后才来投靠，就会有凶险（错过时机，被排斥在外）。核心是亲比要及时、真诚、正直。",
        "en": "HOLDING TOGETHER brings good fortune. Inquire of the oracle once again Whether you possess sublimity, constancy, and perseverance; Then there is no blame. Those who are uncertain gradually join. Whoever come too late Meets with misfortune."
      },
      "image": {
        "zh": "象曰：地上有水，比。先王以建万国，亲诸侯。\n\n解释：卦象是水在地上流淌，水滋润大地，大地承载江河，二者亲密无间、互相依存。先王看到这个景象，就分封建立众多诸侯国，亲近、安抚诸侯，让天下和谐团结。",
        "en": "On the earth is water: The image of HOLDING TOGETHER. Thus the kings of antiquity Bestowed the different states as fiefs And cultivated friendly relations With the feudal lords."
      },
      "tuan": {
        "zh": "",
        "en": "What is required is that we unite with others, in order that all may complement and aid one another through holding together. But such holding together calls for a central figure around whom other persons may unite. To become a center of influence holding people together is a grave matter and fraught with great responsibility. It requires greatness of spirit, consistency, and strength. Therefore let him who wishes to gather others about him ask himself whether he is equal to the undertaking, for anyone attempting the task without a real calling for it only makes confusion worse than if no union at all had taken place. But when there is a real rallying point, those who at first are hesitant or uncertain gradually come in of their own accord. Late-comers must suffer the consequences, for in holding together the question of the right time is also important. Relationships are formed and firmly established according to definite inner laws. Common experiences strengthen these ties, and he who comes too late to share in these basic experiences must suffer for it if, as a straggler, he finds the door locked. If a man has recognized the necessity for union and does not feel strong enough to function as the center, it is his duty to become a member of some other organic fellowship."
      },
      "lines": [
        {
          "zh": "初六。有孚比之，无咎。有孚盈缶，终来有它，吉。\n解释：用最诚恳的心去亲近别人，没毛病。你的诚意就像把酒缸装得满满的，虽然开始少，但最后会越聚越多，甚至有意外的好处，大吉。",
          "en": "Hold to him in truth and loyalty; This is without blame. Truth, like a full earthen bowl\" Thus in the end Good fortune comes from without."
        },
        {
          "zh": "六二。比之自内，贞吉。\n解释：从自己内部先搞好团结，向内求、靠中心走，坚持正道就吉祥。像内部先和谐，再对外扩展。",
          "en": "Hold to him inwardly. Perseverance brings good fortune."
        },
        {
          "zh": "六三。比之匪人。\n解释：亲近了不该亲近的人（错付、站错队）。没说吉凶，但象曰‘不亦伤乎’，意思是很受伤、很悲哀，后果可想而知。",
          "en": "You hold together with the wrong people."
        },
        {
          "zh": "六四。外比之，贞吉。\n解释：向外主动去亲近贤人、靠拢中心，坚持正道就吉祥。内外都要比，但方向不同，这里是向外求贤。",
          "en": "Hold to him outwardly also. Perseverance brings good fortune."
        },
        {
          "zh": "九五。显比，王用三驱，失前禽。邑人不诫，吉。\n解释：光明正大地亲比团结，像君王打猎只从三面包围，前面故意放跑不追。老百姓自然归心，不用严厉警告就吉祥。意思是宽厚包容、来者不拒、去者不追，才是最高明的团结之道。",
          "en": "Manifestation of holding together. In the hunt the king uses beaters on three sides only And forgoes game that runs off in front. The citizens need no warning. Good fortune."
        },
        {
          "zh": "上六。比之无首，凶。\n解释：亲比却没有找到头儿、没有开头、没赶上趟，彻底孤立，凶险。晚来一步就没位置了，孤家寡人。",
          "en": "He finds no head for holding together. Misfortune."
        }
      ],
      "summary": {
        "zh": "哎，哥们儿，这‘比’卦简单说就是讲怎么跟人搞好关系、抱团取暖的。核心就是一个字：亲！要真心实意地去靠近对的人、跟对的人站队，尤其是要找那个有实力、有德行、大家公认的中心（像九五那个位置），大家一起往那儿靠，早靠早好，靠得正就吉利。晚到或者站错队、跟错人就倒霉。生活中就是交朋友、找伙伴、职场站队、谈恋爱选对象，都得讲这个‘比’得对、比得早、比得真。团结就是力量，但得团结在正确的人和正确的道上，不然就是拉帮结派、朋党之争，那就惨了。"
      }
    },
    {
      "id": 9,
      "key": "xiao_chu",
      "hexCode": "111011",
      "trigrams": {
        "upper": "xun",
        "lower": "qian"
      },
      "name": {
        "zh": "小畜",
        "en": "Little Accumulation"
      },
      "judgement": {
        "zh": "小畜。亨。密云不雨，自我西郊。\n\n简要解释：小有蓄积，能够亨通。天上浓云密布，却不下雨，云气从我方西郊而来。象征力量尚小、蓄积有限，还没到大展宏图的时候，需要耐心等待时机，积蓄力量。",
        "en": "THE TAMING POWER OF THE SMALL Has success. Dense clouds, no rain from our western region."
      },
      "image": {
        "zh": "风行天上，小畜。君子以懿文德。\n\n简要解释：风在天上吹行，这就是小畜的卦象。君子看到这个景象，就去培养自己美好的文采和德行。意思是在力量还不足以大有作为时，要注重内在修养、提升品德和文化素养，以柔顺的方式慢慢影响和积聚。",
        "en": "The wind drives across heaven: The image of THE TAMING POWER OF THE SMALL.Thus the superior man Refines the outward aspect of his nature."
      },
      "tuan": {
        "zh": "",
        "en": "This image refers to the state of affairs in China at the time when King Wên, who came originally from the west, was in the east at the court of the reigning tyrant Chou Hsin. The moment for action on a large scale had not yet arrived. King Wên could only keep the tyrant somewhat in check by friendly persuasion. Hence the image of many clouds, promising moisture and blessing to the land, although as yet no rain falls. The situation is not unfavorable; there is a prospect of ultimate success, but there are still obstacles in the way, and we can merely take preparatory measures. Only through the small means of friendly persuasion can we exert any influence. The time has not yet come for sweeping measures. However, we may be able, to a limited extent, to act as a restraining and subduing influence. To carry out our purpose we need firm determination within and gentleness and adaptability in external relations."
      },
      "lines": [
        {
          "zh": "初九：复自道，何其咎？吉。\n返回自己的正道，有什么过错呢？吉祥。像刚起步就知道回头走正轨，很聪明，不会出大问题。",
          "en": "Return to the way. How could there be blame in this? Good fortune."
        },
        {
          "zh": "九二：牵复，吉。\n被别人牵引着返回正道，吉祥。说明有人拉你一把，或者你被形势带着走回正路，反而是好事。",
          "en": "He allows himself to be drawn into returning. Good fortune."
        },
        {
          "zh": "九三：舆说辐。夫妻反目。\n车轮的辐条脱落了。夫妻互相瞪眼反目。太急躁、太刚强，硬往前冲，结果内部失控、关系破裂，典型的用力过猛翻车。",
          "en": "The spokes burst out of the wagon wheels. Man and wife roll their eyes."
        },
        {
          "zh": "六四：有孚，血去惕出，无咎。\n心怀诚信，伤痛和恐惧都会离去，没有灾祸。用真诚和柔顺的态度去面对强硬的阻力，反而能化解危机，化险为夷。",
          "en": "If you are sincere, blood vanishes and fear gives way. No blame."
        },
        {
          "zh": "九五：有孚挛如，富以其邻。\n心怀诚信，紧密团结，让邻居也跟着富起来。处在高位的人有诚意、讲信用，就能带着大家一起受益，真正的大格局。",
          "en": "If you are sincere and loyally attached, You are rich in your neighbor."
        },
        {
          "zh": "上九：既雨既处，尚德载。妇贞厉，月几望。君子征凶。\n雨终于下了，也停了，德行已经满载。女人守正道还有危险，月亮快要满圆了。君子如果还出去征伐会有凶险。意思是积累到顶、成功已到，但物极必反，别再贪心冒进，得收手、守成，否则容易出事。",
          "en": "The rain comes, there is rest. This is due to the lasting effect of character. Perseverance brings the woman into danger. The moon is nearly full. If the superior man persists, Misfortune comes."
        }
      ],
      "summary": {
        "zh": "嘿，这小畜卦说白了就是：你现在实力还不够强，想法很大但暂时推不动，就像天上乌云很厚却下不了雨一样，得憋着。别硬刚、别急着往前冲，先稳住自己，回去走正道、拉着朋友一起回归正轨、别逞强逞到夫妻翻脸那种地步。用诚意去化解危机，慢慢积累，等到时机成熟、雨真正下来了，那才能真正发力。核心就俩字：蓄势 + 忍耐 + 修德，别小看这点“小积累”，它是大翻盘的前奏。"
      }
    },
    {
      "id": 10,
      "key": "lu",
      "hexCode": "110111",
      "trigrams": {
        "upper": "qian",
        "lower": "dui"
      },
      "name": {
        "zh": "履",
        "en": "Fulfillment"
      },
      "judgement": {
        "zh": "卦辞原文：履虎尾，不咥人，亨。解释：踩到老虎尾巴，老虎却不咬人，一切亨通顺利。意味着在危险环境中，只要谨慎守礼、柔顺行事，就能有惊无险，顺利通过。",
        "en": "TREADING. Treading upon the tail of the tiger. It does not bite the man. Success."
      },
      "image": {
        "zh": "象曰原文：上天下泽，履。君子以辨上下，定民志。解释：天在上，泽在下，尊卑有序，这就是履卦的意象。君子从中领悟，要明辨上下等级，制定礼仪规范，让民众安守本分，心志安定。",
        "en": "Heaven above, the lake below: The image of TREADING. Thus the superior man discriminates between high and low, And thereby fortifies the thinking of the people."
      },
      "tuan": {
        "zh": "",
        "en": "The situation is really difficult. That which is strongest and that which is weakest are close together. The weak follows behind the strong and worries it. The strong, however, acquiesces and does not hurt the weak, because the contact is in goof humor and harmless. In terms of a human situation, one is handling wild, intractable people. In such a case one's purpose will be achieved if one behaves with decorum. Pleasant manners succeed even with irritable people."
      },
      "lines": [
        {
          "zh": "初九：素履，往，无咎。解释：穿着朴素的鞋子往前走，没灾祸。意思是保持本真、质朴，不花里胡哨地前进，就不会出问题，安心按自己的步调走。",
          "en": "Simple conduct. Progress without blame."
        },
        {
          "zh": "九二：履道坦坦，幽人贞吉。解释：道路平坦宽广，隐居的人守正道吉祥。意思是走在大道上心胸开阔，像隐士一样内心平静、不受干扰，坚持正道就吉利。",
          "en": "Treading a smooth, level course. The perseverance of a dark man Brings good fortune."
        },
        {
          "zh": "六三：眇能视，跛能履，履虎尾，咥人，凶。武人为于大君。解释：眼睛瞎了还勉强看，脚跛了还勉强走，踩虎尾被咬，凶。武人要当大君也一样危险。意思是能力不足却硬要逞强，盲目冒进，必遭祸殃。",
          "en": "A one-eyed man is able to see, A lame man is able to tread. He treads on the tail of the tiger."
        },
        {
          "zh": "九四：履虎尾，愬愬，终吉。解释：踩虎尾，战战兢兢害怕的样子，最终吉祥。意思是面对危险保持警惕、谨慎小心，最后能化险为夷，达成目标。",
          "en": "He treads on the tail of the tiger. Caution and circumspection Lead ultimately to good fortune."
        },
        {
          "zh": "九五：夬履，贞厉。解释：果断急速地行事，守正但有危险。意思是身居高位决策果断，虽然位置正当，但太急躁莽撞会有风险，要警惕。",
          "en": "Resolute conduct. Perseverance with awareness of danger."
        },
        {
          "zh": "上九：视履考祥，其旋元吉。解释：回顾走过的路，审视吉凶，反省周旋，大吉。意思是事情结束时好好反思过去的举动，总结经验，就能大吉大利。",
          "en": "Look to your conduct and weigh the favorable signs. When everything is fulfilled, supreme good fortune comes."
        }
      ],
      "summary": {
        "zh": "哥们，这履卦就像走在老虎屁股后面，胆战心惊但又得往前走。核心就是：做事要守规矩、讲礼貌、别莽撞，尤其在面对比自己强大的人或事时，低调点、谨慎点、和气点，就能化险为夷，顺顺利利过关。别逞强，别越界，谦虚守礼才是王道。"
      }
    },
    {
      "id": 11,
      "key": "tai",
      "hexCode": "111000",
      "trigrams": {
        "upper": "kun",
        "lower": "qian"
      },
      "name": {
        "zh": "泰",
        "en": "Advance"
      },
      "judgement": {
        "zh": "泰：小往大来，吉，亨。\n简要解释：小人（阴）离去，大人（阳）到来，吉祥，亨通。这是天地交泰、阴阳和谐的极好局面，万物通达，事业顺利。",
        "en": "PEACE. The small departs, The great approaches. Good fortune. Success."
      },
      "image": {
        "zh": "象曰：天地交，泰；后以财成天地之道，辅相天地之宜，以左右民。\n简要解释：天地之气互相交感，形成通泰之象。君王/领导者应当效法天地，裁成调理自然规律，帮助万物各得其宜，从而治理百姓、安抚天下。",
        "en": "Heaven and earth unite: the image of PEACE. Thus the ruler Divides and completes the course of heaven and earth, And so aids the people."
      },
      "tuan": {
        "zh": "",
        "en": "This hexagram denotes a time in nature when heaven seems to be on earth. Heaven has placed itself beneath the earth, and so their powers unite in deep harmony. Then peace and blessing descend upon all living things. In the world of man it is a time of social harmony; those in high places show favor to the lowly, and the lowly and inferior is an end to all feuds. In side, at the center, in the key position, is the light principle; the dark principle is outside. Thus the light has a powerful influence, while the dark is submissive. In this way each receives its due. When the good elements of society occupy a central position and are in control, the evil elements come under their influence and change for the better. When the spirit of heaven rules in man, his animal nature also comes under its influence and takes its appropriate place. The individual lines enter the hexagram from below and leave it again at the top. Here the small, weak, and evil elements are about to take their departure, while the great, strong, and good elements are moving up. This brings good fortune and success."
      },
      "lines": [
        {
          "zh": "初九：拔茅茹，以其汇，征吉。\n意思是：连根拔起茅草，根茎相连带着同类一起前进，出行大吉。比喻志同道合的朋友互相牵引，一起向上发展，前途光明。",
          "en": "When ribbon grass is pulled up, the sod comes with it. Each according to his kind. Undertakings bring good fortune."
        },
        {
          "zh": "九二：包荒，用冯河，不遐遗，朋亡，得尚于中行。\n意思是：包容荒远之人，像徒步涉过大河一样果敢，不遗弃远方的人，舍弃私党私交，走中正之道就能得到崇尚。强调胸怀宽广、不结党营私、光明正大才能真正通达。",
          "en": "Bearing with the uncultured in gentleness, Fording the river with resolution, Not neglecting what is distant, Not regarding one's companions:"
        },
        {
          "zh": "九三：无平不陂，无往不复。艰贞无咎。勿恤其孚，于食有福。\n意思是：没有永远平坦不生坡的路，没有只去不回来的事。处艰难而守正道就没有灾咎，不要担心诚信问题，在祭祀饮食上自然有福。提醒盛极之时要警惕物极必反，保持艰苦奋斗的精神才能持盈保泰。",
          "en": "No plain not followed by a slope. No going not followed by a return. He who remains persevering in danger Is without blame. Do not complain about this truth; Enjoy the good fortune you still possess."
        },
        {
          "zh": "六四：翩翩，不富，以其邻，不戒以孚。\n意思是：翩翩然轻快飞舞，虽然不富有，却和邻人一起，不用告诫就自然诚信。比喻在通泰之时，柔顺谦虚、不贪图个人财富，与周围人自然和谐互信。",
          "en": "He flutters down, not boasting of his wealth, Together with his neighbor, Guileless and sincere."
        },
        {
          "zh": "六五：帝乙归妹，以祉，元吉。\n意思是：像商王帝乙嫁妹妹那样，以此得到福祉，大吉大利。比喻以至尊之位下嫁（谦虚下交），用柔顺中正的态度联姻/合作，能带来大吉大利。",
          "en": "The sovereign I Gives his daughter in marriage. And supreme good fortune."
        },
        {
          "zh": "上六：城复于隍，勿用师。自邑告命，贞吝。\n意思是：城墙崩塌回填到干涸的护城壕里，不宜用兵。从邑中自行发布命令，坚持下去有憾恨。提醒泰到极点就要转向否，形势已逆转，强行抵抗只会更糟，物极必反的警示。",
          "en": "The wall falls back into the moat. Use no army now. Make your commands known within your own town. Perseverance brings humiliation."
        }
      ],
      "summary": {
        "zh": "哥们儿，泰卦就是当下超级顺的那种状态！天地终于不闹别扭了，上面和下面通气了，阳气上升、阴气下降，大家想法一致，好事扎堆来。小付出大回报，简直是人生高光时刻。但老祖宗也提醒你：现在虽然爽翻天，可万物有周期，盛极必反，别太飘，保持谦虚谨慎、居安思危才能长久爽下去。"
      }
    },
    {
      "id": 12,
      "key": "pi",
      "hexCode": "000111",
      "trigrams": {
        "upper": "qian",
        "lower": "kun"
      },
      "name": {
        "zh": "否",
        "en": "Hindrance"
      },
      "judgement": {
        "zh": "否之匪人，不利君子贞，大往小来。\n\n意思是：闭塞、阻隔的状态下，不是有利于君子坚持正道的时候。大（阳气/君子）离去，小（阴气/小人）到来，天地不通，上下不交。",
        "en": "STANDSTILL. Evil people do not further The perseverance of the superior man. The great departs; the small approaches."
      },
      "image": {
        "zh": "象曰：天地不交，否；君子以俭德辟难，不可荣以禄。\n\n意思是：天和地不互相交通，形成闭塞之象。君子在这种时候应该用节俭、低调的德行来躲避灾难，不可以追求荣耀和俸禄来显扬自己。",
        "en": "Heaven and earth do not unite: The image of STANDSTILL. Thus the superior man falls back upon his inner worth In order to escape the difficulties. He does not permit himself to be honored with revenue."
      },
      "tuan": {
        "zh": "",
        "en": "Heaven and earth are out of communion and all things are benumbed. What is above has no relation to what is below, and on earth confusion and disorder prevail. The dark power is within, the light power is without. Weakness is within, harshness without. Within are the inferior, and without are the superior. The way of inferior people is in ascent; the way of superior people is one the decline. But the superior people do not allow themselves to be turned from their principles. If the possibility of exerting influence is closed to them, they nevertheless remain faithful to their principles and withdraw into seclusion."
      },
      "lines": [
        {
          "zh": "初六：拔茅茹，以其汇，贞吉亨。\n→ 虽然处在最下面的闭塞阶段，但能和同类（同是小人或同处困境的人）互相连结、抱团取暖，坚持正道还是有吉祥通达的可能。",
          "en": "When ribbon grass is pulled up, the sod comes with it. Each according to his kind. Perseverance brings good fortune and success."
        },
        {
          "zh": "六二：包荒，用冯河，不遐遗，朋亡，得尚于中行。\n→ 包容大度，像徒步涉过大河一样果敢，不遗弃远方的人，但也不结党营私，保持中正的道路，能得到中行（中正）的赞赏。",
          "en": "They bear and endure; This means good fortune for inferior people. The standstill serves to help the great man to attain success."
        },
        {
          "zh": "六三：包羞。\n→ 被小人包围、裹挟，做了丢脸的事，或者处于羞辱、尴尬的处境，很难堪。",
          "en": "They bear shame."
        },
        {
          "zh": "九四：有命无咎，畴离祉。\n→ 得到上天/上面的命令或时机，照着做就不会有灾祸，和同类（志同道合的人）一起离开困境，就能共同获得福祉。",
          "en": "He who acts at the command of the highest Remains without blame. Those of like mind partake of the blessing."
        },
        {
          "zh": "九五：休否，君子以利用，终小人否。\n→ 闭塞的局面开始休止/缓解，君子要抓住这个转机好好利用，最终小人的闭塞/嚣张气焰会被终结。",
          "en": "Standstill is giving way. Good fortune for the great man. \"What if it should fail, what if it should fail?\" In this way he ties it to a cluster of mulberry shoots."
        },
        {
          "zh": "上九：倾否，先否后喜。\n→ 把闭塞的局面彻底倾覆推倒，先是经历否塞的艰难，后来转为喜悦。否极泰来，彻底翻盘的爻。",
          "en": "The standstill comes to an end. First standstill, then good fortune."
        }
      ],
      "summary": {
        "zh": "哥们儿，这卦就是现在超级不顺、卡得死死的那个感觉。天地不交，小人当道，好人/正能量被挤到边上去了，啥事都推进不动，硬刚肯定吃亏。当前阶段别指望大展拳脚，最聪明的做法就是先苟住、低调做人、保护好自己，等风头过去再动。典型的‘先保命，再发育’卦。"
      }
    },
    {
      "id": 13,
      "key": "tong_ren",
      "hexCode": "101111",
      "trigrams": {
        "upper": "qian",
        "lower": "li"
      },
      "name": {
        "zh": "同人",
        "en": "Seeking Harmony"
      },
      "judgement": {
        "zh": "同人。同人于野，亨。利涉大川，利君子贞。\n\n意思是：在广阔的原野上与人志同道合，非常亨通。有利于渡过大河难关，也有利于君子保持正直坚贞的品德。强调要大公无私、胸怀广阔地团结人，而不是局限于小圈子，这样才能成就大事。",
        "en": "FELLOWSHIP WITH MEN in the open. Success. It furthers one to cross the great water. The perseverance of the superior man furthers."
      },
      "image": {
        "zh": "象曰：天与火，同人；君子以类族辨物。\n\n意思是：天在上，火在下，天火相合就是同人卦。君子从中得到启示，要按照事物的种类和族群去分辨辨别万物。也就是说，真正的同人不是盲目拉拢所有人，而是要明白物以类聚、人以群分，找到真正志同道合的人。",
        "en": "Heaven together with fire: The image of FELLOWSHIP WITH MEN. Thus the superior man organizes the clans And makes distinctions between things."
      },
      "tuan": {
        "zh": "",
        "en": "True fellowship among men must be based upon a concern that is universal. It is not the private interests of the individual that create lasting fellowship among men, but rather the goals of humanity. That is why it is said that fellowship with men in the open succeeds. If unity of this kind prevails, even difficult and dangerous tasks, such as crossing the great water, can be accomplished. But in order to bring about this sort of fellowship, a persevering and enlightened leader is needed--a man with clear, convincing, and inspiring aims and the strength to carry them out. (The inner trigram means clarity; the outer, strength.)"
      },
      "lines": [
        {
          "zh": "初九：同人于门，无咎。\n刚开始就光明正大地在门外与人交往，没有私心，没有毛病，自然没啥过错。",
          "en": "Fellowship with men at the gate. No blame."
        },
        {
          "zh": "六二：同人于宗，吝。\n只跟自己宗族、自己小圈子的人搞团结，虽然亲近，但格局太小，会带来遗憾和困难。",
          "en": "Fellowship with men in the clan. Humiliation."
        },
        {
          "zh": "九三：伏戎于莽，升其高陵，三岁不兴。\n藏军队在丛林里，爬上高坡观察，三年都起不来。想争、想抢同人对象，但手段不正、时机不对，结果憋屈很久都动弹不得。",
          "en": "He hides weapons in the thicket; He climbs the high hill in front of it. For three years he does not rise up."
        },
        {
          "zh": "九四：乘其墉，弗克攻，吉。\n已经爬上敌方城墙了，却攻不下来，停手反而吉祥。意思是遇到阻碍时要懂得适可而止，不硬刚到底反而能避祸得吉。",
          "en": "He climbs up on his wall; he cannot attack. Good fortune."
        },
        {
          "zh": "九五：同人，先号咷而后笑，大师克，相遇。\n一开始哭天抢地很焦虑，后来却大笑，因为动用大军最终战胜障碍，和志同道合的人胜利会师。代表经过艰难考验，真心相同的人最终能聚在一起，大获成功。",
          "en": "Men bound in fellowship first weep and lament, But afterward they laugh. After great struggles they succeed in meeting."
        },
        {
          "zh": "上九：同人于郊，无悔。\n在郊外（比较偏远的地方）与人同心，虽然没达到最理想的‘于野’大同境界，但也没什么可后悔的。算是退而求其次，但仍然保持了正直，没走歪路。",
          "en": "Fellowship with men in the meadow. No remorse."
        }
      ],
      "summary": {
        "zh": "嘿，同人卦简单说就是讲‘找对的人一起干大事’。核心就是别搞小圈子、小团体，要敞开心胸，在大范围内跟志同道合的人团结起来，这样才能干成难事、成大事。关键是要公心、无私、守正，不能因为私情、偏见把圈子搞窄了。找到对的伙伴，一起冲，基本就稳了。"
      }
    },
    {
      "id": 14,
      "key": "da_you",
      "hexCode": "111101",
      "trigrams": {
        "upper": "li",
        "lower": "qian"
      },
      "name": {
        "zh": "大有",
        "en": "Great Harvest"
      },
      "judgement": {
        "zh": "大有：元亨。\n原文出自《周易》：大有卦象征大有收获、拥有盛大财富与光明。元亨表示大吉大利、极为顺利亨通，是六十四卦中吉祥程度名列前茅的卦象之一。",
        "en": "POSSESSION IN GREAT MEASURE. Supreme success."
      },
      "image": {
        "zh": "象曰：火在天上，大有；君子以竭恶扬善，顺天休命。\n意思是：太阳高高挂在天上，普照大地，象征拥有盛大光明与资源。君子看到这个景象，就要努力去除邪恶、发扬善良，顺应上天赋予的美好命运。",
        "en": "Fire in heaven above: The image of POSSESSION IN GREAT MEASURE. Thus the superior man curbs evil and furthers good, And thereby obeys the benevolent will of heaven."
      },
      "tuan": {
        "zh": "",
        "en": "The two trigrams indicate that strength and clarity unite. Possessions great measure is determined by fate and accords with the time. How is it possible that the weak line has power to hold the strong lines fast and to possess them? It is done by virtue of unselfish modesty. The time is favorable--a time of strength within, clarity and culture without. Power is expressing itself in graceful and controlled way. This brings supreme success and wealth."
      },
      "lines": [
        {
          "zh": "初九：无交害，匪咎，艰则无咎。\n刚开始有资源但还没跟人产生复杂关系，没什么坏处。虽然处境有点艰难，但只要小心谨慎就不会有错。",
          "en": "No relationship with what is harmful; There is no blame in this. If one remains conscious of difficulty, One remains without blame."
        },
        {
          "zh": "九二：大车以载，有攸往，无咎。\n像一辆超大卡车装满了货物，可以放心大胆往前走，没问题。比喻能力强、资源足，适合大展身手。",
          "en": "A big wagon for loading. One may undertake something. No blame."
        },
        {
          "zh": "九三：公用亨于天子，小人弗克。\n大的资源和功绩要拿去给国家/天子（大公无私地奉献），普通小人承担不了这么大的福分。提醒有大成就的人要懂得上交、分享，别独吞。",
          "en": "A prince offers it to the Son of Heaven. A petty man cannot do this."
        },
        {
          "zh": "九四：匪其彭，无咎。\n不要表现得太盛大、太张扬（彭=盛大貌），收敛一点就没有灾祸。越有实力越要低调。",
          "en": "He makes a difference Between himself and his neighbor. No blame."
        },
        {
          "zh": "六五：厥孚交如，威如；吉。\n用真诚去交往，别人自然感受到你的威信和力量，这样非常吉祥。讲的是以诚待人反而更有领导力。",
          "en": "He whose truth is accessible, yet dignified, Has good fortune."
        },
        {
          "zh": "上九：自天祐之，吉无不利。\n得到上天的保佑，吉祥，没有任何不利。到了最上面一层，反而回归最纯粹的谦虚与顺天，结果一切都好。",
          "en": "He is blessed by heaven. Good fortune. Nothing that does not further."
        }
      ],
      "summary": {
        "zh": "大有这一卦超级顺，讲的就是‘有大收获、大成功、大资源在手’的感觉。就像你突然中了大奖、事业爆火、贵人超级多、什么都顺的那种状态。但越有钱有名越要低调、谦虚、别嚣张，不然容易招黑、招祸。核心就八个字：有大成就要会守大成，越有越要善良正直、帮人利他，这样才能长久大有。"
      }
    },
    {
      "id": 15,
      "key": "qian_2",
      "hexCode": "001000",
      "trigrams": {
        "upper": "kun",
        "lower": "gen"
      },
      "name": {
        "zh": "谦",
        "en": "Humbleness"
      },
      "judgement": {
        "zh": "谦。亨，君子有终。\n谦虚低调反而亨通顺利，真正有德行的君子能够把谦虚坚持到底，善始善终。",
        "en": "MODESTY creates success. . The superior man carries things through."
      },
      "image": {
        "zh": "地中有山，谦。君子以裒多益寡，称物平施。\n山高大地低，山却藏在地里，象征内里高大、外表谦卑。君子看到这个象，就懂得把多的拿来补少的，衡量东西多少公平分给别人。",
        "en": "Within the earth, a mountain: The image of MODESTY. Thus the superior man reduces that which is too much, And augments that which is too little. He weighs things and makes them equal."
      },
      "tuan": {
        "zh": "",
        "en": "It is the law of heaven to make fullness empty and to make full what is modest; when the sun is at its zenith, it must, according to the law of heaven, turn toward its setting, and at its nadir it rises toward a new dawn. In obedience to the same law, the moon when it is full begins to wane, and when empty of light it waxes again. This heavenly law works itself out in the fates of men also. It is the law of earth to alter the full and to contribute to the modest. High mountains are worn down by the waters, and the valleys are filled up. It is the law of fate to undermine what is full and to prosper the modest. And men also hate fullness and love the modest. The destinies of men are subject to immutable laws that must fulfill themselves. But man has it in his power to shape his fate, according as his behavior exposes him to the influence of benevolent or of destructive forces. When a man holds a high position and is nevertheless modest, he shines with the light of wisdom; if he is in a lowly position and is modest, he cannot be passed by. Thus the superior man can carry out his work to the end without boasting of what he has achieved."
      },
      "lines": [
        {
          "zh": "初六：谦谦君子，用涉大川，吉。\n最下面这爻最谦虚，再谦虚一点的君子，哪怕去干很冒险的事（渡大河），也会吉祥。解释：起步就超级低调，把自己放得很低，反而安全有保障。",
          "en": "A superior man modest about his modesty May cross the great water. Good fortune."
        },
        {
          "zh": "六二：鸣谦，贞吉。\n谦虚的美德传扬开来，坚持正道就吉祥。解释：你低调有内涵，别人慢慢都知道你人好又有本事，但你自己还不骄傲，坚持本心就好运继续。",
          "en": "Modesty that comes to expression. Perseverance brings good fortune."
        },
        {
          "zh": "九三：劳谦君子，有终吉。\n有功劳还谦虚的君子，会有好结局，大吉。解释：全卦最牛的一爻，干了很多事有大贡献，但从不翘尾巴、把功劳挂嘴边，这种人最终一定有好报。",
          "en": "A superior man of modesty and merit Carries things to conclusion. Good fortune."
        },
        {
          "zh": "六四：无不利，撝谦。\n没有什么不利的，只要发挥谦虚就行。解释：位置已经很高了，还能继续把谦虚表现出来，到处都顺，没有任何坏处。",
          "en": "Nothing that would not further modesty In movement."
        },
        {
          "zh": "六五：不富以其邻，利用侵伐，无不利。\n自己不富裕但带动邻居一起富，利用这个去讨伐不听话的，没任何不利。解释：虽然自己不算最强，但靠谦虚赢得了大家支持，这时候该硬气的时候也能硬，收拾那些不守规矩的很顺利。",
          "en": "No boasting of wealth before one's neighbor. It is favorable to attack with force. Nothing that would not further."
        },
        {
          "zh": "上六：鸣谦，利用行师，征邑国。\n谦虚的名声远扬，利于出兵，征讨附近的邑国。解释：谦虚到最后反而声望极高，大家都服你，这时候用武力解决小问题（内部或周边不服的），非常合适，没阻力。",
          "en": "Modesty that comes to expression. It is favorable to set armies marching To chastise one's own city and one's country."
        }
      ],
      "summary": {
        "zh": "哎，谦卦其实就一句话：越谦虚越牛，越低调越有回报。满招损谦受益这道理放这儿最准。卦里六爻几乎全是吉，告诉你只要你肯把姿态放低、不抢风头、不居功、不硬刚，该你的迟早是你的，坚持下去最后肯定有好结果。生活中就当个老好人？不是，是有实力还知道藏着掖着、该出力时出力、该让步时让步，这样的人走到最后往往笑得最开心。"
      }
    },
    {
      "id": 16,
      "key": "yu",
      "hexCode": "000100",
      "trigrams": {
        "upper": "zhen",
        "lower": "kun"
      },
      "name": {
        "zh": "豫",
        "en": "Delight"
      },
      "judgement": {
        "zh": "豫。利建侯行师。\n原文意思：豫卦象征喜悦、和乐、顺势而动。利于建立诸侯、巩固政权，也利于出兵作战。核心是顺应时机、预先准备，才能在欢乐中成就大事。",
        "en": "ENTHUSIASM. It furthers one to install helpers And to set armies marching."
      },
      "image": {
        "zh": "象曰：雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考。\n原文意思：雷声从地面震动而出，万物随之振奋，这就是豫的景象。古代先王看到这个卦象，于是制作音乐来彰显美德，用盛大的音乐祭祀上帝，并以祖先配享。强调在喜悦时要崇尚德行、感恩天地祖先，而不是单纯享乐。",
        "en": "Thunder comes resounding out of the earth: The image of ENTHUSIASM. Thus the ancient kings made music In order to honor merit, And offered it with splendor To the Supreme Deity, Inviting their ancestors to be present."
      },
      "tuan": {
        "zh": "",
        "en": "The time of ENTHUSIASM derives from the fact that there is at hand an eminent man who is in sympathy with the spirit of the people and acts in accord with it. Hence he finds universal and willing obedience. To arouse enthusiasm it is necessary for a man to adjust himself and his ordinances to the character of those whom he has to lead. The inviolability of natural laws rests on this principle of movement along the line of least resistance. Theses laws are not forces external to things but represent the harmony of movement immanent in them. That is why the celestial bodies do not deviate from their orbits and why all events in nature occur with fixed regularity. It is the same with human society: only such laws are rooted in popular sentiment can be enforced, while laws violating this sentiment merely arouse resentment. Again, it is enthusiasm that enables us to install helpers for the completion of an undertaking without fear of secret opposition. It is enthusiasm too that can unify mass movements, as in war, so that they achieve victory."
      },
      "lines": [
        {
          "zh": "初六：鸣豫，凶。\n刚有点开心就到处嚷嚷、显摆，自鸣得意过头了，早晚乐极生悲，凶险。",
          "en": "Enthusiasm that expresses itself Brings misfortune."
        },
        {
          "zh": "六二：介于石，不终日，贞吉。\n像石头一样坚定有原则，快乐不沉迷其中，不到一天就收敛，守正道就吉祥。",
          "en": "Firm as a rock. Not a whole day. Perseverance brings good fortune."
        },
        {
          "zh": "六三：盱豫，悔。迟有悔。\n仰着头巴结讨好有权有势的人求快乐，肯定后悔；拖拖拉拉不及时醒悟，也会后悔。两头都悔。",
          "en": "Enthusiasm that looks upward creates remorse. Hesitation brings remorse."
        },
        {
          "zh": "九四：由豫，大有得。勿疑，朋盍簪。\n因为真正懂得豫的道理（顺动有备），收获超级大。别怀疑，大家像簪子聚头发一样团结归附你。",
          "en": "The source of enthusiasm. He achieves great things. Doubt not. You gather friends around you As a hair clasp gathers the hair."
        },
        {
          "zh": "六五：贞疾，恒不死。\n虽然坚守正道但还是会生点小病（或小危机），但因为中正持久，不会真正完蛋。",
          "en": "Persistently ill, and still does not die."
        },
        {
          "zh": "上六：冥豫，成，有渝无咎。\n沉迷享乐到昏天黑地、都成习惯了，但只要能及时改变、醒悟过来，就没啥大祸。",
          "en": "Deluded enthusiasm. But if after completion one changes, There is no blame."
        }
      ],
      "summary": {
        "zh": "哎，豫卦说白了就是‘开心的时候别太嗨过头’。表面看是雷动地顺、万物欢腾的好时候，事业、感情、机会都顺风顺水，特别适合干大事、拉队伍、打仗啥的。但关键就在于：快乐来得快去得也快，乐极容易生悲。所以得提前准备、居安思危，像春雷惊醒大地一样，顺势而为但别飘了。核心一句话：顺着势头动没错，但动之前心里要有数，别把自己玩脱了。"
      }
    },
    {
      "id": 17,
      "key": "sui",
      "hexCode": "100110",
      "trigrams": {
        "upper": "dui",
        "lower": "zhen"
      },
      "name": {
        "zh": "随",
        "en": "Following"
      },
      "judgement": {
        "zh": "隨。元亨，利貞，無咎。\n原文卦辭：大吉大利，利於守正，沒有災禍。意思是只要順應時勢、隨和適應、堅持正道，就能亨通無礙，沒什麼壞事。",
        "en": "FOLLOWING has supreme success. Perseverance furthers. No blame."
      },
      "image": {
        "zh": "象曰：澤中有雷，隨。君子以向晦入宴息。\n澤上有雷（雷藏澤中），象徵隨順天時。君子看到這個卦象，就懂得要順應自然規律：天黑了就該回家休息、放鬆、入睡，不硬幹不合時宜的事。",
        "en": "Thunder in the middle of the lake: The image of FOLLOWING. Thus the superior man at nightfall Goes indoors for rest and recuperation."
      },
      "tuan": {
        "zh": "",
        "en": "In order to obtain a following one must first know how to adapt oneself. If a man would rule he must first learn to serve, for only in this way does he secure from those below him the joyous assent that is necessary if they are to follow him. If he has to obtain a following by force or cunning, by conspiracy or by creating faction, he invariably arouses resistance, which obstructs willing adherence. But even joyous movement can lead to evil consequences, hence the added stipulation, \"Perseverance furthers\" --that is, consistency in doing right-- together with \"No blame.\" Just as we should not ask others to follow us unless this condition is fulfilled, so it is only under this condition that we can in turn follow others without coming to harm. The thought of obtaining a following through adaptation to the demands of the time is a great and significant idea; this is why the appended judgment is so favorable."
      },
      "lines": [
        {
          "zh": "初九：官有渝，貞吉。出門交有功。\n職位或立場有變化，堅持正道就吉。走出門去廣交朋友、積極社交，反而能建功立業。→ 變動別怕，動起來反而有機會。",
          "en": "The standard is changing. Perseverance brings good fortune. To go out of the door in company Produces deeds."
        },
        {
          "zh": "六二：繫小子，失丈夫。\n抓住了小男孩，卻丟了成熟的丈夫。→ 太貪小便宜、跟錯人、黏著不靠譜的小咖，就會錯過真正有價值的大人物。眼光要放長遠。",
          "en": "If one clings to the little boy, One loses the strong man."
        },
        {
          "zh": "六三：繫丈夫，失小子。隨有求得，利居貞。\n抓住了大男人，丟了小男孩。追隨有追求就能得到，利於安居守正。→ 懂得捨棄小的、跟對人、選有前途的對象或道路，雖然短期有失，但長遠有得，踏實守正最好。",
          "en": "If one clings to the strong man, One loses the little boy."
        },
        {
          "zh": "九四：隨有獲，貞凶。有孚在道，以明，何咎？\n追隨別人而有所獲，固守下去反倒凶險。只要真誠守道、光明正大，就沒什麼過錯。→ 跟對了老大賺到錢，但別太貪、別死抱不放，保持清醒和原則才安全。",
          "en": "Following creates success. Perseverance brings misfortune. To go one's way with sincerity brings clarity. How could there be blame in this?"
        },
        {
          "zh": "九五：孚於嘉，吉。\n真誠信守美好的、正大的東西，吉祥。→ 位居中正，誠信待人、追求高尚的價值觀，這是最棒的隨，結果大吉。",
          "en": "Sincere in the good. Good fortune."
        },
        {
          "zh": "上六：拘繫之，乃從維之，王用亨於西山。\n被人拘禁綁縛，卻因此而跟隨維繫，王因此在西山亨通。→ 到極點了，強行被綁住反而成就大事（像文王被拘羑里卻因此得天下）。有時候被動的「隨」也會帶來大轉機，關鍵看時機。",
          "en": "He meets with firm allegiance And is still further bound. The king introduces him To the Western Mountain."
        }
      ],
      "summary": {
        "zh": "哎，隨卦說白了就是『順勢而為，隨大流但要有原則』。這卦超chill，告訴你別總硬剛、別死磕，世界變化快，跟著走、適時調整、別違背本心和正道，反而最順、最省力、最能成事。像談戀愛、職場、人生，強求不如水到渠成，該跟誰就跟誰，該放手就放手，關鍵要真誠、守正，自然大家都願意跟你混。"
      }
    },
    {
      "id": 18,
      "key": "gu",
      "hexCode": "011001",
      "trigrams": {
        "upper": "gen",
        "lower": "xun"
      },
      "name": {
        "zh": "蛊",
        "en": "Remedying"
      },
      "judgement": {
        "zh": "蛊。元亨，利涉大川。先甲三日，后甲三日。\n蛊卦象征积弊已久、腐败混乱的状态，但只要及时整治、拨乱反正，就能大为亨通。利于跨越重大困难（涉大川），但行动前要提前三天仔细考察分析现状（先甲三日），行动后也要后续三天观察后果、完善措施（后甲三日），才能真正终而有始、开启新局面。",
        "en": "WORK ON WHAT HAS BEEN SPOILED Has supreme success. It furthers one to cross the great water. Before the starting point, three days. After the starting point, three days."
      },
      "image": {
        "zh": "山下有风，蛊。君子以振民育德。\n山下有风吹拂，万物散乱、败坏之象。君子看到这个卦象，就要效法风的振奋作用，去振作民众、培育道德，治理腐败、教化人心，重振秩序。",
        "en": "The wind blows low on the mountain: The image of DECAY. Thus the superior man stirs up the people And strengthens their spirit."
      },
      "tuan": {
        "zh": "",
        "en": "What has been spoiled through man's fault can be made good again through man's work. IT is not immutable fate, as in the time of STANDSTILL, that has caused the state of corruption, but rather the abuse of human freedom. Work toward improving conditions promises well, because it accords the possibilities of the time. We must not recoil from work and danger-symbolized by crossing of the great water-but must take hold energetically. Success depends, however, on proper deliberation. This is expressed by the lines, \"Before the starting point, three days. After the starting point, three days.\" We must first know the cause of corruption before we can do away with them; hence it is necessary to be cautious during the time before the start. Then we must see to it that the new way is safely entered upon, so that a relapse may be avoided; therefore we must pay attention to the time after the start. Decisiveness and energy must take the place of inertia and indifference that have led to decay, in order that the ending may be followed by a new beginning."
      },
      "lines": [
        {
          "zh": "初六：干父之蛊，有子，考无咎。厉，终吉。\n（解释：有儿子能整治父亲败坏的事业，父亲就没有过错了。虽然有危险，但最终吉祥。像孝顺儿子接手收拾父亲留下的烂摊子，虽然过程有点惊险，但结果是好的。）",
          "en": "Setting right what has been spoiled by the father. If there is a son, No blame rests upon the departed father. Danger. In the end good fortune."
        },
        {
          "zh": "九二：干母之蛊，不可贞。\n（解释：整治母亲造成的弊端，不可过于固执死板。得中道、柔和处理才行。像处理妈妈那边的问题，不能太刚硬，得讲究方式方法。）",
          "en": "Setting right what has been spoiled by the mother. One must not be too persevering."
        },
        {
          "zh": "九三：干父之蛊，小有悔，无大咎。\n（解释：整治父亲的弊端，稍有懊悔，但没有大错。干得有点猛，会有小遗憾，但大局没问题，属于正常代价。）",
          "en": "Setting right what has been spoiled by the father. There will be a little remorse. No great blame."
        },
        {
          "zh": "六四：裕父之蛊，往见吝。\n（解释：宽裕、放任父亲的弊端，继续下去会有困难和羞吝。光想慢慢来、包容过去的问题，结果越拖越糟。）",
          "en": "Tolerating what has been spoiled by the father. In continuing one sees humiliation."
        },
        {
          "zh": "六五：干父之蛊，用誉。\n（解释：整治父亲的弊端，受到人们的赞誉。用德行来承接、治理，赢得好名声。位置好、方法对，自然大家都夸你。）",
          "en": "Setting right what has been spoiled by the father. One meets with praise."
        },
        {
          "zh": "上九：不事王侯，高尚其事。\n（解释：不侍奉王侯，把自己的志向看得高尚。彻底超脱世俗事务，专注于更高的精神追求或自我修养，大家都觉得这种志向值得效法。）",
          "en": "He does not serve kings and princes, Sets himself higher goals."
        }
      ],
      "summary": {
        "zh": "哎呀，蛊卦其实就是告诉你：事情已经乱套了、坏习惯积太久了、上一代留下的烂摊子摆在那儿，但别慌！这时候正是大干一场、彻底革新的好时机。关键是你得有决心去收拾残局，像接手爸妈败坏的家业一样，该改的改，该治的治。别拖着别放任，认真规划好前因后果，就能翻盘成功，迎来新气象。说白了就是‘旧的不去新的不来’，但得你亲自上手干活才行，不然就继续烂下去咯。"
      }
    },
    {
      "id": 19,
      "key": "lin",
      "hexCode": "110000",
      "trigrams": {
        "upper": "kun",
        "lower": "dui"
      },
      "name": {
        "zh": "临",
        "en": "Approaching"
      },
      "judgement": {
        "zh": "临。元，亨，利，贞。至于八月有凶。\n\n原文大意：大吉大利，亨通顺利，有利于坚持正道。但要警惕，到了八月（盛极而衰之时）会有凶险。提醒人在顺境巅峰时要居安思危，别得意忘形。",
        "en": "APPROACH has supreme success. Perseverance furthers. When the eighth month comes, . There will be misfortune."
      },
      "image": {
        "zh": "象曰：泽上有地，临。君子以教思无穷，容保民无疆。\n\n大意：泽上有大地，高临其上。君子从中得到启发：要用无穷的教化去感化民众，用宽广的胸怀去保护百姓，没有止境。",
        "en": "The earth above the lake: The image of APPROACH. Thus the superior man is inexhaustible In his will to teach, And without limits In his tolerance and protection of the people."
      },
      "tuan": {
        "zh": "",
        "en": "The hexagram as a whole points to a time of joyous, hopeful progress. Spring is approaching. Joy and forbearance bring high and low nearer together. Success is certain. But we must work with determination and perseverance to make full use of the propitiousness of the time. And on thing more: spring does not last forever. In the eighth month the aspects are reversed. Then only two strong, light lines are left; these do not advance but are in retreat (see next hexagram). We must take heed of this change in good time. If we meet evil before it becomes reality-before it has even begun to stir-we can master it."
      },
      "lines": [
        {
          "zh": "初九：咸临，贞吉。\n以真诚感化的态度去临近、领导下面的人，坚持正道就吉祥。刚开始就得用真心，别玩虚的。",
          "en": "Joint approach. Perseverance brings good fortune."
        },
        {
          "zh": "九二：咸临，吉，无不利。\n继续用真诚感化去临下，吉祥，没啥不利的。这爻最强，阳刚得中，又有应，简直是最佳领导状态。",
          "en": "Joint approach. Good fortune. Everything furthers."
        },
        {
          "zh": "六三：甘临，无攸利；既忧之，无咎。\n靠甜言蜜语、讨好式管理去临下，没啥好处。但只要你能意识到问题、开始反省忧虑，就不会有什么大过错。提醒别当老好人、别只会哄。",
          "en": "Comfortable approach. Nothing that would further. If one is induced to grieve over it, One becomes free of blame."
        },
        {
          "zh": "六四：至临，无咎。\n亲自靠前、亲力亲为地去临近下属/民众，没有灾祸。领导不能光发号施令，得下来走走、看看、摸摸实情。",
          "en": "Complete approach. No blame."
        },
        {
          "zh": "六五：知临，大君之宜，吉。\n用智慧、明智的方式去临下，这是伟大君主最合适、最应该做的态度，吉祥。最高领导就得靠脑子、靠格局，而不是靠吼靠骗。",
          "en": "Wise approach. This is right for a great prince. Good fortune."
        },
        {
          "zh": "上六：敦临，吉，无咎。\n用敦厚、诚恳、宽厚的态度去临下，吉祥，没毛病。到顶层了，反而要更厚道、更实在，才能收好尾、不翻车。",
          "en": "Great hearted approach. Good-hearted approach. Good fortune. No blame."
        }
      ],
      "summary": {
        "zh": "哎，这卦简单说就是‘春天来了，好日子到啦’。你现在地位高、势力强，或者机会特别好，下边的人都挺你、顺着你，感觉一切顺利、大家开心。但别太嗨过头了！这时候最容易飘，飘着飘着秋天就来了，阳气一退就变味儿。所以现在要抓紧用真心、用智慧去带人、教人、帮人，别光享受，别用假甜话哄人，也别偷懒，得亲自上阵、厚道做人，这样才能把好局面尽可能延长。核心就俩字：以德临人 + 居安思危。"
      }
    },
    {
      "id": 20,
      "key": "guan",
      "hexCode": "000011",
      "trigrams": {
        "upper": "xun",
        "lower": "kun"
      },
      "name": {
        "zh": "观",
        "en": "Watching"
      },
      "judgement": {
        "zh": "觀。盥而不薦，有孚顒若。\n\n原文意思是：祭祀开始时洗手灌酒请神降临，但还没到献上祭品的环节，就已经表现出极其庄重恭敬、诚信仰慕的样子。整体象征一种“被觀察、被仰望”的狀態，強調以德服人、風行地上、教化天下，不需強力推行，自然讓人觀瞻效法。",
        "en": "CONTEMPLATION. The ablution has been made, But not yet the offering. Full of trust they look up to him."
      },
      "image": {
        "zh": "象曰：風行地上，觀。先王以省方，觀民設教。\n\n風在大地上吹拂，象徵德教像風一樣普遍傳播。先王效法這個卦象，巡視四方，觀察民情，設立教化，讓天下人自然歸順、受到感化。",
        "en": "The wind blows over the earth: The image of CONTEMPLATION. Thus the kings of old visited the regions of the world, Contemplated the people, And gave them instruction."
      },
      "tuan": {
        "zh": "",
        "en": "The sacrificial ritual in China began with an ablution and a libation by which the Deity was invoked, after which the sacrifice was offered. The moment of time between these two ceremonies is the most sacred of all, the moment of deepest inner concentration. If piety is sincere and expressive of real faith, the contemplation of it has a transforming awe-spiring effect on those who witness it. Thus also in nature a holy seriousness is to be seen in the fact that natural occurrences are uniformly subject to law. Contemplation of the divine meaning underlying the workings of the universe gives to the man who is called upon to influence others the means of producing like effects. This requires that power of inner concentration which religious contemplation develops in great men strong in faith. It enables them to apprehend the mysterious and divine laws of life, and by means of profoundest inner concentration they give expression to these laws in their own persons. Thus a hidden spiritual power emanates from them, influencing and dominating others without their being aware of how it happens."
      },
      "lines": [
        {
          "zh": "初六：童觀，小人無咎，君子吝。\n像小孩子一樣淺薄、幼稚地觀看。對普通老百姓沒啥大問題（無咎），但如果你是想成大事的君子，這樣膚淺的眼光就會讓你陷入困境、被人看輕。",
          "en": "Boy like contemplation. For an inferior man, no blame. For a superior man, humiliation."
        },
        {
          "zh": "六二：窺觀，利女貞。\n像女人從門縫偷偷觀看一樣，視野狹窄、偷偷摸摸。這種觀察方式適合女人守貞（在家相夫教子），但對男人或想幹大事的人來說，就顯得有點可羞、可笑，不夠光明正大。",
          "en": "Contemplation through the crack of the door. Furthering for the perseverance of a woman."
        },
        {
          "zh": "六三：觀我生，進退。\n轉而反觀自己的人生、自己的行為和處境。通過自我反省來決定是進還是退。關鍵在於要時時檢視自己，才不會走偏。",
          "en": "Contemplation of my life Decides the choice Between advance and retreat."
        },
        {
          "zh": "六四：觀國之光，利用賓于王。\n觀看國家（或君王）的光輝政績和德行。這時最適合做賓客、輔佐君王、參與政事，憑借這種洞察可以得到重用。",
          "en": "Contemplation of the light of the kingdom. It furthers one to exert influence as the guest of a king."
        },
        {
          "zh": "九五：觀我生，君子無咎。\n居於君王之位，時時反省自己的言行是否合乎大道、是否能為萬民表率。只要能不斷自我檢視、完善自己，君子就不會有過失。",
          "en": "Contemplation of my life. The superior man is without blame."
        },
        {
          "zh": "上九：觀其生，君子無咎。\n處於最高位卻沒有實權，像退休的賢人或在野高士，只能觀察君王的作為和百姓的生活。雖然不在其位，但能持續關注、保持清醒的判斷，君子也沒有過錯。",
          "en": "Contemplation of his life. The superior man is without blame."
        }
      ],
      "summary": {
        "zh": "嘿，這『觀』卦啊，簡單說就是『被看』、『被觀摩』的意思。上面風吹下面地，風到哪兒地就跟著動，代表領導者或有德之人只要把自己站好、德行擺正，不用吆喝，大家自然抬頭看你、學你。就像現在很多人說的『以身作則』、『人格魅力』、『躺平輸出影響力』。這卦提醒你：別急著去推銷自己，先把內在修好，讓別人主動來『觀』你、來認同你。適合觀察、學習、展示、教化、等待時機的階段，不適合強行出頭或亂動。"
      }
    },
    {
      "id": 21,
      "key": "shi_he",
      "hexCode": "100101",
      "trigrams": {
        "upper": "li",
        "lower": "zhen"
      },
      "name": {
        "zh": "噬嗑",
        "en": "Eradicating"
      },
      "judgement": {
        "zh": "噬嗑。亨。利用狱。\n\n意思是：噬嗑卦，通达顺利。利于审理刑狱、断案执法。",
        "en": "BITING THROUGH has success. It is favorable to let justice be administered."
      },
      "image": {
        "zh": "象曰：雷电噬嗑；先王以明罚敕法。\n\n意思是：上震为雷、下离为电，雷电交加咬合之象。先王看到这个卦象，就制定明确的刑罚、整饬法令，让法律清晰、惩罚分明。",
        "en": "Thunder and lighting: The image of BITING THROUGH. Thus the kings of former times made firm the laws Through clearly defined penalties."
      },
      "tuan": {
        "zh": "",
        "en": "When an obstacle to union arises, energetic biting through brings success. This is true in all situations. Whenever unity cannot be established, the obstruction is due to a talebearer and traitor who is interfering and blocking the way. To prevent permanent injury, vigorous measures must be taken at once. Deliberate obstruction of this sort does not vanish of its own accord. Judgment and punishment are required to deter or obviate it. However, it is important to proceed in the right way. The hexagram combines Li, clarity, and Chên, excitement. Li is yielding, Chên is hard. Unqualified hardness and excitement would be too violent in meting out punishment; unqualified clarity and gentleness would be too weak. The two together create the just measure. It is of moment that the man who makes the decisions (represented by the fifth line) is gentle by nature, while he commands respect by his conduct in his position."
      },
      "lines": [
        {
          "zh": "初九：屦校灭趾，无咎。\n刚开始犯小错就被惩戒（脚镣把脚趾都磨破了），虽然疼，但能制止更大的错误，所以没大问题。",
          "en": "His feet are fastened in the stocks, So that his toes disappear. No blame."
        },
        {
          "zh": "六二：噬肤灭鼻，无咎。\n咬到柔软的肉（比喻容易处理的小问题），虽然用力过猛把鼻子都碰伤了，但事情本身不难解决，没啥大错。",
          "en": "Bites through tender meat, So that his nose disappears. No blame."
        },
        {
          "zh": "九三：噬腊肉，遇毒。小吝，无咎。\n咬到干硬的腊肉，还吃出中毒的感觉，过程很费劲也有点小倒霉，但只要坚持处理完，没根本性的大错。",
          "en": "Bites on old dried meat And strikes on something poisonous. Slight humiliation. No blame."
        },
        {
          "zh": "九四：噬乾胏，得金矢。利艰贞，吉。\n啃很硬的带骨头的干肉，终于咬到了金属箭头（象征刚硬的刑具/法律）。处境艰难，但保持正直坚持原则，结果吉祥。",
          "en": "Bites on dried gristly meat. Receives metal arrows. It furthers one to be mindful of difficulties And to be persevering. Good fortune."
        },
        {
          "zh": "九五：噬乾肉，得黄金。贞厉，无咎。\n咬很干的肉，终于得到纯金（象征最核心、最刚硬的东西）。虽然处在这个位置要保持警惕、如履薄冰，但守正道就不会有大过错。",
          "en": "Bites on dried lean meat. Receives yellow gold. Perseveringly aware of danger."
        },
        {
          "zh": "上九：何校灭耳，凶。\n戴着沉重的大枷锁，把耳朵都磨烂了，大凶。到了这一步，已经是罪大恶极、惩戒过重或顽固不化到极点，下场很惨。",
          "en": "His neck is fastened in the wooden cangue, So that his ears disappear. Misfortune."
        }
      ],
      "summary": {
        "zh": "简单说，这卦就是“咬东西”那感觉——中间有硬骨头、梗着的东西，得用力咬合、嚼碎才能往下咽。现实里遇到堵着、卡着、不通顺的事（矛盾、纠纷、障碍、坏人、陋习），不能绕、不能忍，必须正面刚、用力“嗑”掉它。过程虽然费劲、有时还带点疼，但只要方法对、力度够，最后是通的、顺的。特别适合讲规矩、讲法律、处理冲突、除障碍、整纪律的场景。"
      }
    },
    {
      "id": 22,
      "key": "bi_2",
      "hexCode": "101001",
      "trigrams": {
        "upper": "gen",
        "lower": "li"
      },
      "name": {
        "zh": "贲",
        "en": "Adorning"
      },
      "judgement": {
        "zh": "贲。亨。小利有攸往。\n\n原文卦辞：贲卦亨通，小事利于有所行动。\n简要解释：贲代表文饰、装饰、文明的外在表现。卦象山下有火，照亮山体使万物焕彩，象征内在本质加上适当文饰能通达，但文饰不是根本，只适合小范围施展，不宜过分或用于大事。",
        "en": "GRACE has success. In small matters It is favorable to undertake something."
      },
      "image": {
        "zh": "象曰：山下有火，贲。君子以明庶政，无敢折狱。\n\n原文象辞：山下有火，这就是贲卦的卦象。君子因此修明各项政事，不敢轻易判决狱讼。\n简要解释：火在山下照耀，使万物文采焕发，君子观此取法：注重文明教化、明察政务细节，但面对重大刑狱判决要慎之又慎，避免凭表面文饰而草率断案，强调质重于文。",
        "en": "Fire at the foot of the mountain: The image of GRACE. Thus does the superior man proceed When clearing up current affairs. But he dare not decide controversial issues in this way."
      },
      "tuan": {
        "zh": "",
        "en": "Grace brings success. However, it is not the essential or fundamental thing; it is only the ornament and therefore be used sparingly and only in little things. In the lower trigram of fire a yielding line comes between two strong lines and makes them beautiful, but the strong lines are the essential content and the weak line is the beautifying form. In the upper trigram of the mountain, the strong line takes the lead, so that here again the strong element must be regarded as the decisive factor. In nature we see in the sky the strong light of the sun; the life of the world depends on it. But this strong, essential thing is changed and given pleasing variety by the moon and the stars. In human affairs, aesthetic form comes into being when traditions exist that, strong and abiding like mountains, are made pleasing by a lucid beauty. By contemplating the forms existing in the heavens we come to understand time and its changing demands. Through contemplation of the forms existing in human society it becomes possible to shape the world."
      },
      "lines": [
        {
          "zh": "初九：贲其趾，舍车而徒。\n解释：装饰自己的脚，舍弃马车而步行。起步阶段要低调朴实，别急着摆排场，宁可脚踏实地走路，也不要贪图表面舒服而失了本分。",
          "en": "He lends grace to his toes, leaves the carriage, and walks."
        },
        {
          "zh": "六二：贲其须。\n解释：装饰长者的胡须。像柔顺地辅助在上位的刚爻，扮好配角、锦上添花的角色，跟着有实力的人一起出彩，自己不抢风头。",
          "en": "Lends grace to the beard on his chin."
        },
        {
          "zh": "九三：贲如，濡如，永贞吉。\n解释：装饰得光泽润湿的样子，永远保持正道就吉祥。外表打扮得很亮眼漂亮，但要警惕沉迷于浮华，要长久守正才能保住这份光彩。",
          "en": "Graceful and moist. Constant perseverance brings good fortune."
        },
        {
          "zh": "六四：贲如皤如，白马翰如，匪寇，婚媾。\n解释：装饰得素白的样子，白马飞奔而来，不是强盗，而是来求婚的。追求朴素纯白的美，排除干扰后，真正合适的对象就出现了，像婚嫁一样自然结合。",
          "en": "Grace or simplicity? A white horse comes as if on wings. He is not a robber, He will woo at the right time."
        },
        {
          "zh": "六五：贲于丘园，束帛戋戋，吝，终吉。\n解释：在山丘园圃中装饰，用微薄的束帛礼品，虽然显得吝啬小气，但最终吉祥。宁可朴实节俭、注重内在，也不搞奢华浪费，礼轻情意重，反而能得善终。",
          "en": "Grace in the hills and gardens. The roll of silk is meager and small. Humiliation, but in the end good fortune."
        },
        {
          "zh": "上九：白贲，无咎。\n解释：纯白无华的装饰，没有灾咎。到了极点，抛开一切花里胡哨，返回最朴素的本真状态，反而最高级的美，无过无咎。",
          "en": "Simple grace. No blame."
        }
      ],
      "summary": {
        "zh": "嘿，这贲卦说白了就是『包装很重要，但别本末倒置』。东西本身得有料，外表打扮打扮能加分，让人眼前一亮，所以小事情、表面功夫、形象管理、礼仪这些地方用用挺顺的，能亨通。但要是想干大事、长久的事儿，光靠刷外表、搞形式主义那是不行的，容易华而不实。核心就是：适当美化可以，但内在的质朴和本质才是根本，别让装饰盖过了本质。像谈恋爱初期靠颜值加分能顺利推进，但真要过日子还得看人品和相处；工作上穿得体面点有助于面试，但真本事才是长久之计。"
      }
    },
    {
      "id": 23,
      "key": "bo",
      "hexCode": "000001",
      "trigrams": {
        "upper": "gen",
        "lower": "kun"
      },
      "name": {
        "zh": "剥",
        "en": "Falling Away"
      },
      "judgement": {
        "zh": "剥。不利有攸往。\n原文意思：剥落之时，什么行动都不利。阳气被阴气不断侵蚀剥落，只剩最后一丝阳气，君子势力衰弱，小人得势，这时候硬碰硬往前冲只会加速崩盘，所以最聪明的做法就是先别动，静观其变，等时机。",
        "en": "SPLITTING APART. IT does not further one To go anywhere."
      },
      "image": {
        "zh": "象曰：山附于地，剥。上以厚下，安宅。\n原文意思：山附着在大地上，这就是剥的景象。在上位的人看到这个卦象，应该用厚道来对待下面的人，这样自己的位置才能稳固安稳。基础越牢，上层才不会轻易崩塌。",
        "en": "The mountain rests on the earth: The image of SPLITTING APART. Thus those above can ensure their position Only by giving generously to those below."
      },
      "tuan": {
        "zh": "",
        "en": "This pictures a time when inferior people are pushing forward and are about to crowd out the few remaining strong and superior men. Under these circumstances, which are due to the time, it is not favorable for the superior man to undertake anything. The right behavior in such adverse times is to be deduced from the images and their attributes. The lower trigram stands for the earth, whose attributes. The lower trigram stands for the earth, whose attributes are docility and devotion. The upper trigram stands for the mountain, whose attribute is stillness. This suggests that one should submit to the bad time and remain quiet. For it is a question not of man's doing but of time conditions, which, according to the laws of heaven, show an alternation of increase and decrease, fullness and emptiness. It is impossible to counteract these conditions of the time. Hence it is not cowardice but wisdom to submit and avoid action."
      },
      "lines": [
        {
          "zh": "初六：剥床以足，蔑贞凶。\n床脚先烂掉了。问题从最底层、最不显眼的地方开始腐蚀，根基动摇还不自知，坚持下去肯定凶险。赶紧修基础，别等全塌了。",
          "en": "The leg of the bed is split. Those who persevere are destroyed. Misfortune."
        },
        {
          "zh": "六二：剥床以辨，蔑贞凶。\n床腿上面的分隔部分（床板和床脚连接处）也开始剥落了。问题继续往上蔓延，已经伤到重要支撑点了，还不警惕就真要翻车了，凶。",
          "en": "The bed is split at the edge. Those who persevere are destroyed. Misfortune."
        },
        {
          "zh": "六三：剥之，无咎。\n被剥了，但居然没事。为什么？因为它跟下面那帮阴爻不是一路货，暗中跟上面的阳爻有联系，立场没完全站错队，所以虽然身处剥的环境，但能免于大祸。",
          "en": "He splits with them. No blame."
        },
        {
          "zh": "六四：剥床以肤，凶。\n现在连床面（贴身的那层）都剥掉了。灾难已经近在眼前、切肤之痛了，凶险到极点，再不醒悟就彻底玩完了。",
          "en": "The bed is split up to the skin. Misfortune."
        },
        {
          "zh": "六五：贯鱼，以宫人宠，无不利。\n像一串鱼一样连贯地排列，带着宫女去接受宠爱，无不利。阴爻到顶点了，领着众阴柔顺地依附唯一的阳爻，就像后宫佳丽排队侍奉君王。只要肯低头、顺势而为，反而能转危为安，什么都顺利。",
          "en": "A shoal of fishes. Favor comes through the court ladies. Everything acts to further."
        },
        {
          "zh": "上九：硕果不食，君子得舆，小人剥庐。\n大果子挂在那没人吃。君子如果处在上面，就能得到大家的拥戴，像坐在大车上一样稳；但小人如果占了这个位置，就会把自己的房子都拆了（自毁）。意思是最后一丝阳气很珍贵，君子守得住就能翻盘，小人继续作妖只会彻底完蛋。",
          "en": "There is a large fruit still uneaten. The superior man receives a carriage. The house of the inferior man is split apart."
        }
      ],
      "summary": {
        "zh": "哥们儿，这剥卦简单说就是现在是低谷期，小人当道、好人受气、东西一点点被蚕食掉的感觉。就像大冬天树叶全掉光，只剩光秃秃的枝干。啥都别急着干，冲动只会让自己更惨。最好的策略就是：低调、忍耐、守住最后那点底线，别再丢东西了。熬过去就是复卦，一阳来复，春天就来了。耐心点，别作死往前冲。"
      }
    },
    {
      "id": 24,
      "key": "fu",
      "hexCode": "100000",
      "trigrams": {
        "upper": "kun",
        "lower": "zhen"
      },
      "name": {
        "zh": "复",
        "en": "Turning Back"
      },
      "judgement": {
        "zh": "復：亨。出入無疾，朋來無咎。反覆其道，七日來復，利有攸往。\n\n意思是：復卦整體亨通順利。進出沒有疾病（障礙），朋友來訪也沒有過錯。事物反覆循環它的規律，七天就會回來一次，利於有所前往行動。",
        "en": "RETURN. Success. Going out and coming in without error. Friends come without blame. To and fro goes the way. On the seventh day comes return. It furthers one to have somewhere to go."
      },
      "image": {
        "zh": "象曰：雷在地中，復。先王以至日閉關，商旅不行，后不省方。\n\n意思是：雷聲藏在地底下，這就是復的象徵。先王因此在冬至這一天關閉城門，不讓商人旅客通行，君王也不巡視四方。象徵陽氣剛開始復生，要像冬至一樣靜養、閉關，等待時機。",
        "en": "Thunder within the earth: The image of THE TURNING POINT. Thus the kings of antiquity closed the passes At the time of solstice. Merchants and strangers did not go about, And the ruler Did not travel through the provinces."
      },
      "tuan": {
        "zh": "",
        "en": "After a time of decay comes the turning point. The powerful light that has been banished returns. There is movement, but it is not brought about by force. The upper trigram K'un is characterized by devotion; thus the movement is natural, arising spontaneously. For this reason the transformation of the old becomes easy. The old is discarded and the new is introduced. Both measures accord with the time; therefore no harm results. Societies of people sharing the same views are formed. But since these groups come together in full public knowledge and are in harmony with the time, all selfish separatist tendencies are excluded, and no mistake is made. The idea of RETURN is based on the course of nature. The movement is cyclic, and the course completes itself. Therefore it is not necessary to hasten anything artificially. Everything comes of itself at the appointed time. This is the meaning of heaven and earth. All movements are accomplished in six stages, and the seventh brings return. Thus the winter solstice, with which the decline of the year begins, comes in the seventh month after the summer solstice; so too sunrise comes in the seventh double hour after sunset. Therefore seven is the number of the young light, and it arises when six, the number of the great darkness, is increased by one. In this way the state of rest gives place to movement."
      },
      "lines": [
        {
          "zh": "初九：不遠復，無祗悔，元吉。\n剛開始犯錯沒走遠就回來了，不會有大的悔恨，大吉大利。最早、最及時的回頭，當然最棒。",
          "en": "Return from a short distance. No need for remorse. Great good fortune."
        },
        {
          "zh": "六二：休復，吉。\n停下來好好休息、安心回歸正道，吉祥。跟著對的人、聽仁德的建議回來，特別順。",
          "en": "Quiet return. Good fortune."
        },
        {
          "zh": "六三：頻復，厲，無咎。\n反反覆覆地犯錯又回來，雖然有危險，但最終沒大過錯。屢敗屢戰、屢錯屢改，也算有救。",
          "en": "Repeated return. Danger. No blame."
        },
        {
          "zh": "六四：中行獨復。\n走在半路獨自回頭（周圍人都不回，只有自己回）。雖然孤單，但這是走正道的表現，沒有吉凶斷語，重點是堅持原則。",
          "en": "Walking in the midst of others, One returns alone."
        },
        {
          "zh": "六五：敦復，無悔。\n敦厚、誠懇地回歸正道，不會有悔恨。最真誠、最厚道的回頭方式，穩穩的沒後顧之憂。",
          "en": "Noblehearted return. No remorse."
        },
        {
          "zh": "上六：迷復，凶，有災眚。用行師，終有大敗；以其國君，凶；至於十年，不克征。\n徹底迷路了還不回頭，大凶，有災禍。如果帶兵打仗，會徹底大敗，連國君都遭殃，十年之內都翻不了身。最慘的結局：死不悔改。",
          "en": "Missing the return. Misfortune. Misfortune from within and without. If armies are set marching in this way, One will in the end suffer a great defeat, Disastrous for the ruler of the country. For ten years It will not be possible to attack again."
        }
      ],
      "summary": {
        "zh": "哥們兒，這卦就是講『冬天過去了，春天要來了』的那種感覺。一陽初生，萬物開始慢慢復甦。之前可能倒霉透頂、被剝得光溜溜（剝卦），現在終於熬到頭了，陽氣回來了！關鍵是：犯錯別走太遠，趕緊回頭；回頭越早越好，越誠懇越好。別死扛、別嘴硬，及時止損、迷途知返才是王道。現在適合低調蓄力、修身養性，別急著大幹快上，等陽氣再壯一點再動。總之：壞日子到頭了，好日子在路上，但你得配合它回來啊！"
      }
    },
    {
      "id": 25,
      "key": "wu_wang",
      "hexCode": "100111",
      "trigrams": {
        "upper": "qian",
        "lower": "zhen"
      },
      "name": {
        "zh": "无妄",
        "en": "Without Falsehood"
      },
      "judgement": {
        "zh": "无妄。元亨，利贞。其匪正有眚，不利有攸往。\n意思是：无妄卦大吉大利，亨通顺利，利于坚守正道。但如果行为不正，就会招来灾祸，不利于有所行动。核心是强调要真实、自然、守正，不搞虚的、不妄求、不乱来，顺天应人才能通达。",
        "en": "INNOCENCE. Supreme success. Perseverance furthers. If someone is not as he should be, He has misfortune, And it does not further him To undertake anything."
      },
      "image": {
        "zh": "象曰：天下雷行，物与无妄。先王以茂对时，育万物。\n意思是：天上雷声滚动，万物都因此而不敢虚妄、各自安守本分。先王看到这个景象，就勤勉努力，顺应四时节令，来养育万物。像春天打雷，万物惊醒生长，一切都真实自然。",
        "en": "Under heaven thunder rolls: All things attain the natural state of innocence. Thus the kings of old, Rich in virtue, and in harmony with the time, Fostered and nourished all beings."
      },
      "tuan": {
        "zh": "",
        "en": "Man has received from heaven a nature innately good, to guide him in all his movements. By devotion to this divine spirit within himself, he attains an unsullied innocence that leads him to do right with instinctive sureness and without any ulterior thought of reward and personal advantage. This instinctive certainty brings about supreme success and 'furthers through perseverance\". However, not everything instinctive is nature in this higher sense of the word, but only that which is right and in accord with the will of heaven. Without this quality of rightness, an unreflecting, instinctive way of acting brings only misfortune. Confucius says about this: \"He who departs from innocence, what does he come to? Heaven's will and blessing do not go with his deeds.\""
      },
      "lines": [
        {
          "zh": "初九：无妄，往吉。\n最下面这根阳爻，代表刚开始就很真实、不妄为，这种状态往前走是大吉的。起步正，就容易成功。",
          "en": "Innocent behavior brings good fortune."
        },
        {
          "zh": "六二：不耕获，不菑畲，则利有攸往。\n不种地就想收粮食，不开荒就想有熟田，这种妄想当然不行。但这里是说如果你能真正脚踏实地、不抱不切实际的幻想，反而做事会顺利有回报。",
          "en": "If one does not count on the harvest while plowing,"
        },
        {
          "zh": "六三：无妄之灾。或系之牛，行人之得，邑人之灾。\n最经典的“无妄之灾”：自己没做坏事，却摊上事儿。就像有人把牛拴路边，被过路人顺走，村里人却被怀疑、挨骂、受牵连。告诉你：有时候天灾人祸就是这么莫名其妙，防不胜防，只能认了，继续守正。",
          "en": "Undeserved misfortune."
        },
        {
          "zh": "九四：可贞，无咎。\n可以坚守正道，就不会有灾祸。位置虽然有点尴尬，但只要老老实实、不乱动、不妄为，就能平安无事。",
          "en": "He who can be persevering Remains without blame."
        },
        {
          "zh": "九五：无妄之疾，勿药有喜。\n得了病却是“无妄之疾”——不是自己作的，而是意外或自然来的小毛病。不用吃药，自己就会好，会有喜事。说明守正的人，连病都来得清清白白，去得也轻松。",
          "en": "Use no medicine in an illness Incurred through no fault of your own. It will pass of itself."
        },
        {
          "zh": "上九：无妄，行有眚，无攸利。\n到了顶上，还想动、还想往前冲，哪怕出发点是“无妄”的，也会出问题，没啥好处。告诉你：该停就停，别画蛇添足，过犹不及。",
          "en": "Innocent action brings misfortune."
        }
      ],
      "summary": {
        "zh": "哥们儿，这无妄卦讲的就是一句话：别瞎想、别乱来、别搞虚的，老老实实按规律办事，按本心做事。守住正道就大吉大利，稍微歪一点就容易倒霉。生活中最怕的就是自己骗自己，或者总想着不劳而获、天上掉馅饼，结果往往事与愿违。最好的状态就是真实点、踏实点，顺其自然，该干啥干啥，反而啥都顺。"
      }
    },
    {
      "id": 26,
      "key": "da_chu",
      "hexCode": "111001",
      "trigrams": {
        "upper": "gen",
        "lower": "qian"
      },
      "name": {
        "zh": "大畜",
        "en": "Great Accumulation"
      },
      "judgement": {
        "zh": "大畜。利贞，不家食，吉。利涉大川。\n\n**简要解释**：大蓄积、大积聚的意思。利于守正，坚持正道有吉祥。不在家自己吃饭（意思是出去做官、得俸禄、被国家养贤），吉利。利于渡过大河（做大事、冒风险、克服大困难也行得通）。整体是大有积蓄、厚积薄发的吉卦，但要正派、守规矩才能真正发挥作用。",
        "en": "THE TAMING POWER OF THE GREAT. Perseverance furthers. Not eating at home brings good fortune. It furthers one to cross the great water."
      },
      "image": {
        "zh": "象曰：天在山中，大畜。君子以多识前言往行，以畜其德。\n\n**简要解释**：天广大却被包容在山里面，这就是大蓄积的意象。君子看到这个，就应该多去学习、记住古人的好话、好行为，用来积累、滋养自己的道德修养。强调内在的学问和德行的大积累。",
        "en": "Heaven within the mountain: The image of THE TAMING POWER OF THE GREAT. Thus the superior man acquaints himself with many sayings of antiquity And many deeds of the past, In order to strengthen his character thereby."
      },
      "tuan": {
        "zh": "",
        "en": "To hold firmly to great creative powers and store them up, as set forth in this hexagram, there is need of a strong, clear-headed man who is honored by the ruler. The trigram Ch'ein points to strong creative power; Kên indicates firmness and truth. Both point to light and clarity and to the daily renewal of character. Only through such daily self-renewal can a man continue at the height of his powers. Force of habit helps to keep order in quiet times; but in periods when there is a great storing up of energy, everything depends on the power of the personality. However, since the worthy are honored, as in the case of the strong personality entrusted with leadership by the ruler, it is an advantage not to eat at home but rather to earn one's bread by entering upon public office. Such a man is in harmony with heaven; therefore even great and difficult undertakings, such as crossing the great water, succeed."
      },
      "lines": [
        {
          "zh": "初九：有厉，利已。\n有危险，利于停止（别动）。\n刚开始有点冲劲，但上面有阻力，硬上会出事，先刹车保平安。",
          "en": "Danger is at hand. It furthers one to desist."
        },
        {
          "zh": "九二：舆说輹。\n车子脱了轴（车轮子掉下来了）。\n想前进但被卡住，自动停下来了。意思是遇到阻力时别硬来，顺其自然停一停，反而没啥大问题。",
          "en": "The axletrees are taken from the wagon."
        },
        {
          "zh": "九三：良马逐，利艰贞。曰闲舆卫，利有攸往。\n好马在追逐奔跑，利于在艰难中守正。经常训练车马防卫，利于有所往。\n实力已经很强了，可以出发，但要小心、守规矩、做好准备，才能真正走得远。",
          "en": "A good horse that follows others. Awareness of danger, With perseverance, furthers. Practice chariot driving and armed defense daily. It furthers one to have somewhere to go."
        },
        {
          "zh": "六四：童牛之牿，元吉。\n小牛犊子给它戴上木牿（防止它乱顶），大吉。\n在问题还没变严重时就提前管住、约束它（防患于未然），结果超级好。",
          "en": "The headboard of a young bull. Great good fortune."
        },
        {
          "zh": "六五：豮豕之牙，吉。\n把公猪的牙势给阉割了（去势），吉祥。\n碰到很厉害、有攻击性的东西，用柔软、高明的办法把它最危险的部分去掉，就能化险为夷，吉利。",
          "en": "The tusk of a gelded boar. Good fortune."
        },
        {
          "zh": "上九：何天之衢，亨。\n何等宽阔的天街大道啊，亨通。\n积累到顶点了，阻碍全没了，像走在最宽广的天空大道上，一切畅通无阻，大成功、大通达。",
          "en": "One attains the way of heaven."
        }
      ],
      "summary": {
        "zh": "嘿，这卦简单说就是：你现在是在攒大招、攒实力、攒内功的阶段。别急着乱冲，时机还没完全到，但你底子已经很厚了。像天那么刚健有力的东西都被大山给稳稳止住了——说明你有大能量，但得学会控制、积累、别乱喷。好好读书、修德、攒经验、养实力，等到真该爆发的时候，就能干大事、过大坎、吃朝廷的饭（被重用、有大成就）。一句话：现在别浪，先憋大招，憋好了以后爽翻天。"
      }
    },
    {
      "id": 27,
      "key": "yi",
      "hexCode": "100001",
      "trigrams": {
        "upper": "gen",
        "lower": "zhen"
      },
      "name": {
        "zh": "颐",
        "en": "Nourishing"
      },
      "judgement": {
        "zh": "颐。贞吉。观颐，自求口实。\n意思是：颐卦，守正就吉祥。观察别人是怎么养生的，更要看自己怎么谋生、怎么自给自足。核心就是强调自力更生、靠自己吃饭才是正道。",
        "en": "THE CORNERS OF THE MOUTH. Perseverance brings good fortune. Pay heed to the providing of nourishment And to what a man seeks To fill his own mouth with. In bestowing care and nourishment, it is important that the right people should be taken care of and that we should attend to our own nourishment in the right way. If we wish to know what anyone is like, we have only to observe on whom he bestows his care and what sides of his own nature he cultivates and nourishes. Nature nourishes all creatures. The great man fosters and takes care of superior men, in order to take care of all men through them. Mencius says about this:"
      },
      "image": {
        "zh": "山下有雷，颐。君子以慎言语，节饮食。\n山下面有雷在动，就像嘴巴在咀嚼的样子。君子看到这个卦象，就要提醒自己：说话要特别小心谨慎，吃东西要懂得节制。嘴巴是祸福之门，管好嘴就管好了很多麻烦。",
        "en": "At the foot of the mountain, thunder: The image of PROVIDING NOURISHMENT. Thus the superior man is careful of his words And temperate in eating and drinking."
      },
      "tuan": {
        "zh": "",
        "en": "If we wish to know whether anyone is superior or not, we need only observe what part of his being he regards as especially important. The body has superior and inferior, important and unimportant parts. We must not injure important parts for the sake of the unimportant, nor must we injure the superior parts for the sake of the inferior. He who cultivates the inferior parts of his nature is an inferior man. He who cultivates the superior parts of his nature is a superior man."
      },
      "lines": [
        {
          "zh": "初九：舍尔灵龟，观我朵颐，凶。\n你本来有自己的宝贝（像灵龟一样能自给自足），却眼巴巴盯着我这边大口吃东西的样子——这就凶了。意思是：有本事自己养活自己，别羡慕别人吃香喝辣。",
          "en": "You let your magic tortoise go, And look at me with the corners of your mouth drooping. Misfortune."
        },
        {
          "zh": "六二：颠颐，拂经，于丘颐，征凶。\n颠倒着养（靠倒过来求人），违背常理，在山坡上求养（辛苦又不正道），往前走就凶。简单说：为了吃饭不择手段、颠倒黑白、违背原则去求人，结局很惨。",
          "en": "Turning to the summit for nourishment, Deviating from the path"
        },
        {
          "zh": "六三：拂颐，贞凶，十年勿用，无攸利。\n完全违背养生的正道，坚持错误不改，凶。十年都别想翻身，没一点好处。就是那种死不悔改、走歪路还一条道走到黑的人，下场最惨。",
          "en": "Turning away from nourishment. Perseverance brings misfortune. Do not act thus for ten years."
        },
        {
          "zh": "六四：颠颐，吉。虎视眈眈，其欲逐逐，无咎。\n虽然也是颠倒着求养，但吉。像老虎盯着猎物一样专注，欲望追得很紧，却没灾祸。意思是：向上求养的时候态度端正、认真谨慎、有底线，就能没问题。",
          "en": "Turning to the summit For provision of nourishment Brings good fortune."
        },
        {
          "zh": "六五：拂经，居贞吉，不可涉大川。\n虽然有点违背常理，但安居守正就吉祥，不能去冒险涉大河。就是说：在关键位置上，偶尔非常规一点没关系，但一定要守住底线，别去干冒险的事。",
          "en": "Turning away from the path."
        },
        {
          "zh": "上九：由颐，厉吉，利涉大川。\n大家都靠他来养活，虽然有危险但最终吉祥，利于跨越大河。意思是：当你成了大家依靠的“大饭票”，责任重大、有风险，但只要小心就能大吉，还能干大事、闯大关。",
          "en": "The source of nourishment. Awareness of danger brings good fortune. It furthers one to cross the great water."
        }
      ],
      "summary": {
        "zh": "嘿，这卦说白了就是告诉你：想活得好、养得好，别老盯着别人碗里的肉，自己动手才是硬道理。颐就是养，养身体、养精神、养前途，都得靠正道、自力更生。嘴巴这个东西最容易惹祸，所以说话悠着点，吃东西别太贪。总之一句话——求人不如求己，管住嘴、管住欲望，自己养活自己最踏实。最忌讳的就是好吃懒做、投机取巧、靠啃别人过日子，那基本没好下场。"
      }
    },
    {
      "id": 28,
      "key": "da_guo",
      "hexCode": "011110",
      "trigrams": {
        "upper": "dui",
        "lower": "xun"
      },
      "name": {
        "zh": "大过",
        "en": "Great Exceeding"
      },
      "judgement": {
        "zh": "大過。棟橈。利有攸往，亨。\n\n意思是：大過卦，栋梁被压得弯曲了（房子快要塌了，极端过度的危机状态）。但利于有所行动，前行反而亨通。表面看是大危机，但只要敢于非常规作为、挺身而出，反而能转危为安。",
        "en": "PREPONDERANCE OF THE GREAT. The ridgepole sags to the breaking point. It furthers one to have somewhere to go. Success."
      },
      "image": {
        "zh": "象曰：澤滅木，大過。君子以獨立不懼，遁世無悶。\n\n意思是：大泽淹没了树木，这就是大过的卦象。君子看到这种极端状况，应该学会在乱世中独立支撑而不害怕，实在不行就隐退避世，也能内心不烦闷、不郁结。",
        "en": "The lake rises above the trees: The image of PREPONDERANCE OF THE GREAT. Thus the superior man, when he stands alone, Is unconcerned, And if he has to renounce the world, He is undaunted."
      },
      "tuan": {
        "zh": "",
        "en": "The weight of the great is excessive. The load is too heavy for the strength of the supports. The ridgepole on which the whole roof rests, sags to the breaking point, because its supporting ends are too weak for the load they bear. It is an exceptional time and situation; therefore extraordinary measures are demanded. It is necessary to find a way of transition as quickly as possible, and to take action. This promises success. For although the strong element is in excess, it is in the middle, that is, at the center of gravity, so that a revolution is not to be feared. Nothing is to be achieved by forcible measures. The problem must be solved by gently penetration to the meaning of the situation (as is suggested by the attribute of the inner trigram, Sun); then the change-over to other conditions will be successful. It demands real superiority; therefore the time when the great preponderates is a momentous time."
      },
      "lines": [
        {
          "zh": "初六：藉用白茅，无咎。\n用白茅草垫着放祭器，小心谨慎到极点，就不会出大错。像在极端危险时先做好最基础的防护，别莽撞。",
          "en": "To spread white rushes underneath."
        },
        {
          "zh": "九二：枯楊生稊，老夫得其女妻，无不利。\n枯树又发新芽，老头娶了年轻媳妇，没啥不利的。意思是虽然整体很衰败，但局部还能找到生机、意外收获，阴阳互补反而有转机。",
          "en": "A dry poplar sprouts at the root. An older man takes a young wife. Everything furthers."
        },
        {
          "zh": "九三：棟橈，凶。\n栋梁直接弯曲了，大凶。太刚太直、不知变通，死扛到底，结果就是彻底崩盘。最危险的一爻。",
          "en": "The ridgepole sags to the breaking point. Misfortune."
        },
        {
          "zh": "九四：棟隆，吉；有它，吝。\n栋梁反而隆起（向上拱起），吉祥；但如果有其他变故、旁骛，就会有遗憾。说明在危机中主动调整、把压力转化成支撑力是可行的，但不能分心。",
          "en": "The ridgepole is braced. Good fortune. If there are ulterior motives, it is humiliating."
        },
        {
          "zh": "九五：枯楊生華，老婦得其士夫，无咎无譽。\n枯树开花，老太太嫁给年轻小伙，没罪过也没啥好名声。比喻虽然不正常、不匹配，但勉强能维持，没大错但也没荣耀，属于过渡性的无奈组合。",
          "en": "A withered poplar puts forth flowers. An older woman takes a husband."
        },
        {
          "zh": "上六：過涉滅頂，凶，无咎。\n过度涉水，水淹到头顶，大凶，但最终无咎。明知危险还硬要冲过去，差点淹死，但因为是尽忠职守或义无反顾，反而没留下骂名（虽凶而无咎）。",
          "en": "One must go through the water. It goes over one's head. Misfortune. No blame."
        }
      ],
      "summary": {
        "zh": "哥们儿，这卦就是告诉你现在局面已经『过』得离谱了，像房梁被压弯、泽水淹树，随时可能崩盘。正常路子走不通了，常规方法救不了场。但别慌，这时候反而要敢出大招、非常手段，一个人顶住压力往前冲，或者干脆退隐自保。核心就俩字：非常时期，非常之人，非常之举。扛得住就能翻盘，扛不住就体面撤退，别硬扛到灭顶。"
      }
    },
    {
      "id": 29,
      "key": "kan",
      "hexCode": "010010",
      "trigrams": {
        "upper": "kan",
        "lower": "kan"
      },
      "name": {
        "zh": "坎",
        "en": "Darkness"
      },
      "judgement": {
        "zh": "坎。习坎，有孚，维心亨，行有尚。\n原文卦辞：重重的险陷（习坎），但只要有诚信，内心就能亨通，前行会有回报。简释：处险不怕，最关键是保持真诚和信念，这样才能穿越重重困难。",
        "en": "The Abysmal repeated. If you are sincere, you have success in your heart, And whatever you do succeeds."
      },
      "image": {
        "zh": "象曰：水洊至，习坎。君子以常德行，习教事。\n原文象辞：水接连不断地流来，就是习坎的卦象。君子从中得到启发：要保持恒久的德行，反复练习教化民众的事务。简释：像水一样不停流动但不溢出，教人要在险难中坚持修德、学习，不断提升自己和教化他人。",
        "en": "Water flows on uninterruptedly and reaches its foal: The image of the Abysmal repeated. Thus the superior man walks in lasting virtue And carries on the business of teaching."
      },
      "tuan": {
        "zh": "",
        "en": "Through repetition of danger we grow accustomed to it. Water sets the example for the right conduct under such circumstances. It flows on and on, and merely fills up all the places through which it flows; it does not shrink from any dangerous spot nor from any plunge, and nothing can make it lose its own essential nature. It remains true to itself under all conditions. Thus likewise, if one is sincere when confronted with difficulties, the heart can penetrate the meaning of the situation. And once we have gained inner mastery of a problem, it will come about naturally that the action we take will succeed. In danger all that counts is really carrying out all that has to be done--thoroughness--and going forward, in order not to perish through tarrying in the danger. Properly used, danger can have an important meaning as a protective measure. Thus heaven has its perilous height protecting it against every attempt at invasion, and earth has its mountains and bodies of water, separating countries by their dangers. Thus also rulers make use of danger to protect themselves against attacks from without and against turmoil within."
      },
      "lines": [
        {
          "zh": "初六：习坎，入于坎窞，凶。\n掉进最底层的深坑里，凶险到极点。→ 刚开始就陷得太深，又软弱无力，基本凉凉了。",
          "en": "Repetition of the Abysmal. In the abyss one falls into a pit. Misfortune."
        },
        {
          "zh": "九二：坎有险，求小得。\n身处险中还有险阻，但求取小事能有所得。→ 别贪大，风险期先求保命、小胜就好，慢慢积累，别硬刚。",
          "en": "The abyss is dangerous. One should strive to attain small things only."
        },
        {
          "zh": "六三：来之坎坎，险且枕，入于坎窞，勿用。\n来来去去都是险，前后左右都危险，掉进深坑里，什么都别干。\n→ 前后夹击、进退两难的绝境，千万别乱动，老实待着等机会。",
          "en": "Forward and backward, abyss on abyss. In danger like this, pause at first and wait, Otherwise you will fall into a pit in the abyss. Do not act this way."
        },
        {
          "zh": "六四：樽酒簋贰，用缶，纳约自牖，终无咎。\n一樽酒、两碗饭，用瓦器盛，从窗户递进去，最后没有灾咎。→ 处险中要低调、简朴、真诚待人，哪怕身陷囹圄，也能靠真心打动别人，最终脱险。",
          "en": "A jug of wine, a bowl of rice with it; Earthen vessels"
        },
        {
          "zh": "九五：坎不盈，祗既平，无咎。\n坎坑还没满，水位已经接近平，沒有灾咎。→ 处在最高位但还在险中，只要保持中正、不自满，水快平了，危险即将过去，没大事。",
          "en": "The abyss is not filled to overflowing, It is filled only to the rim."
        },
        {
          "zh": "上六：系用徽纆，置于丛棘，三岁不得，凶。\n用绳子捆绑，放在荆棘丛中，三年都出不来，凶。→ 到了最上层还执迷不悟、违背正道，会被长期囚禁惩罚，后果很严重。",
          "en": "Bound with cords and ropes,"
        }
      ],
      "summary": {
        "zh": "哥们儿，这坎卦就是人生低谷、重度困难模式，前面一个坑后面还一个坑，掉进去容易爬出来难。但别慌！核心就一句话：越是倒霉越要死死守住内心的真诚和信念，别耍小聪明、别自暴自弃。只要心不歪、正能量还在，坚持走下去，哪怕步步惊心，最后都能闯过去，而且走得越稳、越有价值。简单讲：陷阱无限，但诚信是你的救生绳，抓紧了就能翻盘。"
      }
    },
    {
      "id": 30,
      "key": "li",
      "hexCode": "101101",
      "trigrams": {
        "upper": "li",
        "lower": "li"
      },
      "name": {
        "zh": "离",
        "en": "Brightness"
      },
      "judgement": {
        "zh": "離：利貞。亨。畜牝牛吉。\n原文意思：离卦，利于守正，亨通。养母牛吉利。简单解释：这一卦象征火、光、丽（附着），强调要依附正确的事物，坚持中正柔顺，像养柔顺的母牛一样，才能亨通吉祥。",
        "en": "THE CLINGING. Perseverance furthers. It brings success. Care of the cow brings good fortune."
      },
      "image": {
        "zh": "象曰：明两作，离。大人以继明照于四方。\n原文意思：光明接连兴起，这就是离卦。大人因此持续光明普照四方。简单解释：上下两个离卦都是光明，像太阳接连升起，大人物要效法这种连续的光明，去照亮天下、治理世界。",
        "en": "That which is bright rises twice: The image of FIRE. Thus the great man, by perpetuating this brightness, Illumines the four quarters of the world."
      },
      "tuan": {
        "zh": "",
        "en": "What is dark clings to what is light and so enhances the brightness of the latter. A luminous thing giving out light must have within itself something that perseveres; otherwise it will in time burn itself out. Everything that gives light is dependent on something to which it clings, in order that it may continue to shine. Thus the sun and moon cling to heaven, and grain, grass, and trees cling to the earth. So too the twofold clarity of the dedicated man clings to what is right and thereby can shape the world. Human life on earth is conditioned and unfree, and when man recognizes this limitation and makes himself dependent upon the harmonious and beneficent forces of the cosmos, he achieves success. The cow is the symbol of extreme docility. By cultivating in himself an attitude of compliance and voluntary dependence, man acquires clarity without sharpness and finds his place in the world."
      },
      "lines": [
        {
          "zh": "初九：履错然，敬之无咎。\n步履有些慌乱错杂，但保持恭敬谨慎，就没有灾祸。→ 刚起步时容易手忙脚乱，别慌，只要态度端正、小心行事，就没事。",
          "en": "The footprints run crisscross. If one is seriously intent, no blame."
        },
        {
          "zh": "六二：黄离，元吉。\n黄色附丽（中正之色），大吉大利。→ 最舒服的位置！中正柔顺，像穿了件黄衣服一样正派又漂亮，大吉，无敌顺。",
          "en": "Yellow light. Supreme good fortune."
        },
        {
          "zh": "九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。\n太阳偏西的离（光明将尽），不敲盆唱歌自乐，就会像老头子一样叹息，凶。→ 好日子快到头了，这时候你要是不能及时行乐、调整心态，老想着失去，就会很惨很丧，凶险。",
          "en": "In the light of the setting sun, Men either beat the pot and sing Or loudly bewail the approach of old age. Misfortune."
        },
        {
          "zh": "九四：突如其来如，焚如，死如，弃如。\n突然来势汹汹，像燃烧、死亡、抛弃一样。→ 火烧得太猛太突然，来的快去的也快，最后烧成灰被扔掉。超级危险，基本是自取灭亡的节奏。",
          "en": "Its coming is sudden; It flames up, dies down, is thrown away."
        },
        {
          "zh": "六五：出涕沱若，戚嗟若，吉。\n眼泪哗哗地流，忧愁叹息的样子，但吉祥。→ 遇到大难关，哭得稀里哗啦、很惨，但因为居中正、能自省，反而能转危为安，最终吉。",
          "en": "Tears in floods, sighing and lamenting. Good fortune."
        },
        {
          "zh": "上九：王用出征，有嘉折首，获匪其丑，无咎。\n君王出兵征伐，斩了有嘉国的首领，抓到的都不是同类，无咎。→ 站在最高位，用光明之火去惩罚邪恶，杀鸡儆猴，把坏头头干掉，剩下的人就服了，没灾祸。像正义的战争或大扫除，果断出手才行。",
          "en": "The king used him to march forth and chastise."
        }
      ],
      "summary": {
        "zh": "嘿，离卦其实就是告诉你：人生得像火一样，既要亮堂堂地发光发热，又不能乱烧一气。最核心就是两个字——『依附』加『中正柔顺』。你得聪明、耀眼，但别太刚烈炫耀，得找对人、找对地方靠着（比如依附明主、正道），像母牛那样温顺低调，反而能长久发光、事事亨通。太刚太烈容易烧过头把自己烧没了，太暗又没存在感。总之：聪明要用在正道上，低调附丽才能持久牛逼。"
      }
    },
    {
      "id": 31,
      "key": "xian",
      "hexCode": "001110",
      "trigrams": {
        "upper": "dui",
        "lower": "gen"
      },
      "name": {
        "zh": "咸",
        "en": "Mutual Influence"
      },
      "judgement": {
        "zh": "咸。亨，利贞，取女吉。\n原文卦辞：感应亨通，利于守正，娶妻吉祥。意思是真诚的相互感应能够通达顺利，坚持正道有利，特别是婚姻感情方面非常吉利，象征阴阳和谐、男女相悦的美好状态。",
        "en": "Influence. Success. Perseverance furthers. To take a maiden to wife brings good fortune."
      },
      "image": {
        "zh": "象曰：山上有泽，咸。君子以虚受人。\n山上有泽的景象就是咸卦，象征泽水向下渗透滋润山体，山体承载泽水，二者互相感应。君子从中领悟到要虚怀若谷，以谦虚包容的态度接纳他人、感应他人。",
        "en": "A lake on the mountain: The image of influence. Thus the superior man encourages people to approach him By his readiness to receive them."
      },
      "tuan": {
        "zh": "",
        "en": "The weak element is above, the strong below; hence their powers attract each other, so that they unite. This brings about success, for all success depends on the effect of mutual attraction. By keeping still within while experiencing joy without, one can prevent the joy from going to excess and hold it within proper bounds. This is the meaning of the added admonition, \"Perseverance furthers,\" for it is perseverance that makes the difference between seduction and courtship; in the latter the strong man takes a position inferior to that of the weak girl and shows consideration for her. This attraction between affinities is a general law of nature. Heaven and earth attract each other and thus all creatures come into being. Through such attraction the sage influences men's hearts, and thus the world attains peace. From the attractions they exert we can learn the nature of all beings in heaven and on earth."
      },
      "lines": [
        {
          "zh": "初六：咸其拇。\n感应刚开始，只在脚大拇指动一动。像刚认识、刚有点好感，还没深入，志向在外但还没真动，不言吉凶，提醒别急着进一步行动。",
          "en": "The influence shows itself in the big toe."
        },
        {
          "zh": "六二：咸其腓，凶，居吉。\n感应到小腿肚了，想动但动则凶，安安静静待着反而吉。意思是感应加深了但时机不对，躁动往前冲会出问题，老实待着、别乱来才安全。",
          "en": "The influence shows itself in the calves of the legs. Misfortune."
        },
        {
          "zh": "九三：咸其股，执其随，往吝。\n感应到大腿了，还执意跟着别人走，往前走会有遗憾和困难。像没主见、被人牵着鼻子走，随大流瞎掺和，最后自己吃亏。",
          "en": "The influence shows itself in the thighs. Holds to that which follows it."
        },
        {
          "zh": "九四：贞吉悔亡，憧憧往来，朋从尔思。\n守正就吉祥，悔恨消失。心神不定地来来往往，但朋友们会顺从你的想法。感应到心了，真诚感应就能得到回应，虽然有点患得患失，但最终能心想事成。",
          "en": "Perseverance brings good fortune. Remorse disappears. If a man is agitated in mind, And his thoughts go hither and thither, Only those friends On whom he fixes his conscious thoughts Will follow."
        },
        {
          "zh": "九五：咸其脢，无悔。\n感应到后背的肉（脊背深处），没有悔恨。最深沉、最无私的感应，不带任何杂念，像自然而然的默契，后背肉动代表最本真、最不动心的感通，无悔最稳。",
          "en": "The influence shows itself in the back of the neck."
        },
        {
          "zh": "上六：咸其辅、颊、舌。\n感应到面颊、牙床、舌头了。用嘴巴说个不停，花言巧语。靠甜言蜜语、口头表达去感动别人，感的最浅、最表面，容易流于虚浮，说得多做得少，吉凶看自己把握。",
          "en": "The influence shows itself in the jaws, cheeks, and tongue."
        }
      ],
      "summary": {
        "zh": "嘿，咸卦简单说就是讲‘感应’两个字，尤其是人与人之间那种自然、真诚、心灵相通的感觉。最典型的就是谈恋爱、男女互相吸引那种化学反应——你动心我也动心，彼此心有灵犀，不用刻意就能互相影响、互相靠近。这卦特别强调要真诚、要虚心、要守正，别带着算计或勉强去‘感’，那样就容易出问题。总体超级适合问感情、问人际、问能不能互相懂对方的事，基本是吉卦，但前提是你得真心、得自然、别太主动乱动。"
      }
    },
    {
      "id": 32,
      "key": "heng",
      "hexCode": "011100",
      "trigrams": {
        "upper": "zhen",
        "lower": "xun"
      },
      "name": {
        "zh": "恒",
        "en": "Long Lasting"
      },
      "judgement": {
        "zh": "恒。亨，无咎，利贞。利有攸往。\n\n原文卦辞：恒卦亨通顺利，没有灾咎，利于守正道，利于有所前进。核心是强调持久、恒常必须建立在正道基础上，才能长久亨通。",
        "en": "DURATION. Success. No blame. Perseverance furthers. It furthers one to have somewhere to go."
      },
      "image": {
        "zh": "雷风，恒。君子以立不易方。\n\n象曰原文：雷在上、风在下，雷风相与，形成恒久的景象。君子从中领悟，要立身于正道而不轻易改变方向，坚守原则。",
        "en": "Thunder and wind: the image of DURATION. Thus the superior man stands firm And does not change has direction."
      },
      "tuan": {
        "zh": "",
        "en": "Duration is a state whose movement is not worn down by hindrances. It is not a state of rest, for mere standstill is regression. Duration is rather the self-contained and therefore self-renewing movement of an organized, firmly integrated whole, taking place in accordance with immutable laws and beginning anew at every ending. The end is reached by an inward movement, by inhalation, systole, contraction, and this movement turns into a new beginning, in which the movement is directed outward, in exhalation, diastole, expansion. Heavenly bodies exemplify duration. They move in their fixed orbits, and because of this their light-giving power endures. The seasons of the year follow a fixed law of change and transformation, hence can produce effects that endure. So likewise the dedicated man embodies an enduring meaning in his way of life, and thereby the world is formed. In that which gives things their duration, we can come to understand the nature of all beings in heaven and on earth."
      },
      "lines": [
        {
          "zh": "初六：浚恒，贞凶，无攸利。\n挖得太深、求恒太急，一开始就想抓得死死的，反而凶，没啥好处。像谈恋爱或做事别一上来就逼太紧。",
          "en": "Seeking duration too hastily brings misfortune persistently."
        },
        {
          "zh": "九二：悔亡。\n悔恨消失了。本来位置有点偏差，但能守中道、持久调整，最后没啥遗憾。说明适度坚持+灵活调整就没事。",
          "en": "Remorse disappears."
        },
        {
          "zh": "九三：不恒其德，或承之羞，贞吝。\n德行不能持久，时好时坏，免不了会经常丢脸受羞辱，就算占卜也难逃吝惜（小遗憾变大麻烦）。三心二意最要命。",
          "en": "He who does not give duration to his character Meets with disgrace. Persistent humiliation."
        },
        {
          "zh": "九四：田无禽。\n打猎到田里却啥也没逮着。位置不对还硬待在那儿，方法不对再坚持也没收获。提醒你：方向错了的坚持叫执迷不悟。",
          "en": "No game in the field."
        },
        {
          "zh": "六五：恒其德，贞，妇人吉，夫子凶。\n能恒久保持美德，守正。对女人吉祥（传统讲从一而终），对男人反而凶（男人得因时制宜、灵活变通，不能太死板）。",
          "en": "Giving duration to one's character through perseverance."
        },
        {
          "zh": "上六：振恒，凶。\n把动荡摇摆当成恒常，晃来晃去没个准，彻底凶险。恒不是乱动，而是有规律的持久，瞎折腾就完蛋。",
          "en": "Restlessness as an enduring condition brings misfortune."
        }
      ],
      "summary": {
        "zh": "嘿，恒卦简单说就是告诉你：想成事就得有恒心，坚持到底才有戏。不是死脑筋一成不变，而是该守的守住、该正的正着，像雷风那样动静结合、有节奏地持久发力。没恒心啥都白搭，有了恒心再加上走正道，啥事都能慢慢变好，感情、工作、修养都一样。别三天打鱼两天晒网，也别一根筋不拐弯，中道恒久最牛。"
      }
    },
    {
      "id": 33,
      "key": "dun",
      "hexCode": "001111",
      "trigrams": {
        "upper": "qian",
        "lower": "gen"
      },
      "name": {
        "zh": "遁",
        "en": "Retreat"
      },
      "judgement": {
        "zh": "遯：亨，小利贞。\n\n原文卦辞：遯，亨，小利贞。\n简要解释：遯卦象征隐退、退避。在小人势力渐长、环境不利时，君子选择适时退隐反而能亨通顺利。但这种退隐只适合小事守正，不可大有作为，宜保持贞正以待时机。",
        "en": "RETREAT. Success. In what is small, perseverance furthers."
      },
      "image": {
        "zh": "象曰：天下有山，遯。君子以远小人，不恶而严。\n\n原文象辞：天下有山，遯。君子以远小人，不恶而严。\n简要解释：天在上，山在下，天远避于山之上，象征君子远远避开小人。不是激烈对抗、恶语相向，而是保持严肃态度、保持距离，自然远离，以保全自身。",
        "en": "Mountain under heaven: the image of RETREAT. Thus the superior man keeps the inferior man at a distance, Not angrily but with reserve."
      },
      "tuan": {
        "zh": "",
        "en": "Conditions are such that the hostile forces favored by the time are advancing. In this case retreat is the right course, and it is not to be confused with flight. Flight means saving oneself under any circumstances, whereas retreat is a sign of strength. We must be careful not to miss the right moment while we are in full possession of power and position. Then we shall be able to interpret the signs of the time before it is too late and to prepare for provisional retreat instead of being drawn into a desperate life-and-death struggle. Thus we do not simple abandon the field to the opponent; we make it difficult for him to advance by showing perseverance in single acts of resistance. In this way we prepare, while retreating, for the counter-movement. Understanding the laws of a constructive retreat of this sort is not easy. The meaning that lies hidden in such a time is important."
      },
      "lines": [
        {
          "zh": "初六：遯尾，厉。勿用有攸往。\n尾巴被抓住再跑就危险了，赶紧彻底撤，别拖泥带水，别再往前凑，否则有灾。",
          "en": "At the tail in retreat. This is dangerous. One must not wish to undertake anything."
        },
        {
          "zh": "六二：执之用黄牛之革，莫之胜说。\n用黄牛皮带牢牢捆住，谁也解不开。比喻意志坚定，像被牛皮绳绑死一样，坚决要退就退到底，谁劝都没用，固守退隐之心。",
          "en": "he holds him fast with yellow oxhide."
        },
        {
          "zh": "九三：系遯，有疾厉，畜臣妾吉。\n被牵绊着退隐，像得了病一样危险。但如果只是管理好家里的仆人和妾室这种小事，还是吉利的。大事别指望了，先管好自家小圈子吧。",
          "en": "A halted retreat Is nerve-wracking and dangerous."
        },
        {
          "zh": "九四：好遯，君子吉，小人否。\n喜欢退隐、主动选择退隐的君子吉祥，小人就做不到，会很憋屈。真君子懂得欣赏这种‘高级跑路’的美学。",
          "en": "Voluntary retreat brings good fortune to the superior man And downfall to the inferior man."
        },
        {
          "zh": "九五：嘉遯，贞吉。\n美好的、值得赞美的退隐，坚持正道就吉祥。位置最高却能潇洒退隐，这是最漂亮的隐退，堪称教科书级操作。",
          "en": "Friendly retreat. Perseverance brings good fortune."
        },
        {
          "zh": "上九：肥遯，无不利。\n远走高飞、彻底肥遁（非常丰满自足的退隐），没有任何不利。最彻底、最自由的隐退，谁也管不着，彻底解放，啥都不耽误。",
          "en": "Cheerful retreat. Everything serves to further."
        }
      ],
      "summary": {
        "zh": "遯卦说白了就是：现在风头不对，小人当道、形势对你越来越不利，别硬刚，别逞强，该撤就撤！聪明人懂得及时抽身，退一步海阔天空。不是怂，是战略性后退，保存实力，等时机再翻盘。别恋战、别纠缠，离那些耗能的烂人远一点，姿态高冷一点，反而是最安全的生存之道。朋友，这时候硬上就是给自己找不痛快，学会优雅地转身才是真本事。"
      }
    },
    {
      "id": 34,
      "key": "da_zhuang",
      "hexCode": "111100",
      "trigrams": {
        "upper": "zhen",
        "lower": "qian"
      },
      "name": {
        "zh": "大壮",
        "en": "Great Strength"
      },
      "judgement": {
        "zh": "大壮。利贞。\n意思：非常强盛、壮大之时，利于守正道、保持正直才有利。壮大了不能乱来、不能逞强妄动，必须坚持正道才能真正亨通。",
        "en": "THE POWER OF THE GREAT. Perseverance furthers."
      },
      "image": {
        "zh": "象曰：雷在天上，大壮；君子以非礼弗履。\n意思：雷声轰鸣于天之上，象征声势浩大、极为强盛。君子看到这个卦象，就明白再强大也不能做违背礼法的事，任何非礼的行为都坚决不做，要懂得敬畏和克制。",
        "en": "Thunder in heaven above: The image of THE POWER OF THE GREAT. Thus the superior man does not tread upon paths That do not accord with established order."
      },
      "tuan": {
        "zh": "",
        "en": "The hexagram points to a time when inner worth mounts with great force and comes to power. But its strength has already passed beyond the median line, hence there is danger that one may rely entirely on one's own power and forget to ask what is right. There is danger too that, being intent on movement, we may not wait for the right time. Therefore the added statement that perseverance furthers. For that is truly great power which does not degenerate into mere force but remains inwardly united with the fundamental principles of right and of justice. When we understand this point--namely, that greatness and justice must be indissolubly united--we understand the true meaning of all that happens in heaven and on earth."
      },
      "lines": [
        {
          "zh": "初九：壮于趾，征凶，有孚。\n刚开始有点力量就想往前冲，像脚趾头先壮了就要跑步，结果容易崴脚。贸然前进有凶险，虽然有诚意和实力，但时机不对，硬上会自找苦吃。",
          "en": "Power in the toes. Continuing brings misfortune."
        },
        {
          "zh": "九二：贞吉。\n守正道就吉祥。位置好，懂得以柔制刚、不冒进，保持中正的态度，所以结果很好。",
          "en": "Perseverance brings good fortune."
        },
        {
          "zh": "九三：小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。\n小人仗着自己壮就乱来，君子就算有力量也像没事儿一样不用。硬要逞强守正也危险，就像公羊用角去撞篱笆，结果角卡住了，进退不得，很狼狈。",
          "en": "The inferior man works through power."
        },
        {
          "zh": "九四：贞吉，悔亡。藩决不羸，壮于大舆之輹。\n守正就吉祥，后悔的事都没有。篱笆被撞破了，角也没卡住，真正的力量应该表现在像大车轮轴那么结实牢靠的地方，而不是瞎撞。懂得用对方法、走正道就没事。",
          "en": "Perseverance brings good fortune. Remorse disappears."
        },
        {
          "zh": "六五：丧羊于易，无悔。\n在边界上丢了羊（象征丢掉了部分刚猛），但没什么可后悔的。位置柔中带刚，适当示弱、放弃一点过刚，反而无咎，挺聪明的做法。",
          "en": "Loses the goat with ease."
        },
        {
          "zh": "上六：羝羊触藩，不能退，不能遂，无攸利；艰则吉。\n公羊把角死死卡在篱笆里了，退不了也进不了，怎么折腾都没好处。已经壮到极点再硬来肯定倒霉，但如果能在这艰难处咬牙忍住、不乱动，反而能转吉，咎害不会长久。",
          "en": "A goat butts against a hedge. It cannot go backward, it cannot go forward."
        }
      ],
      "summary": {
        "zh": "哥们儿，大壮这卦就是告诉你现在你正处于超级有力量、状态爆棚的时候，像四条龙在下面顶着，上面雷声一响，气势很猛！但越是牛的时候越容易翻车。核心就一句话：壮则容易过头，牛逼的时候最怕的就是管不住自己乱来。一定要稳住，守规矩、别冲动、别欺负人、别越界，这样才能把这份强大用对地方，长久吉利。不然再壮也白搭，羊角卡篱笆里进退两难的就是你。"
      }
    },
    {
      "id": 35,
      "key": "jin",
      "hexCode": "000101",
      "trigrams": {
        "upper": "li",
        "lower": "kun"
      },
      "name": {
        "zh": "晋",
        "en": "Proceeding Forward"
      },
      "judgement": {
        "zh": "晋：康侯用锡马蕃庶，昼日三接。\n简要解释：太阳从地面升起，象征前进、晋升、光明普照。像一位贤明的诸侯（康侯）得到天子赏赐众多良马，一天之内被接见三次，寓意柔顺而明智地前进，得到上级赏识与重用，前途大好。",
        "en": "PROGRESS. The powerful prince Is honored with horses in large numbers. In a single day he is granted audience three times. As an example of progress, this pictures a time when a powerful feudal lord rallies the other lords around the sovereign and pledges fealty and peace. The sovereign rewards him richly and invites him to a closer intimacy."
      },
      "image": {
        "zh": "象曰：明出地上，晋。君子以自昭明德。\n简要解释：太阳从大地升起，就是“晋”的卦象。君子看到这个景象，就要努力彰显自己内在的光明美德，像太阳一样照亮自己也照亮他人。",
        "en": "The sun rises over the earth: The image of PROGRESS. Thus the superior man himself Brightens his bright virtue."
      },
      "tuan": {
        "zh": "",
        "en": "A twofold idea is set forth here. The actual effect of the progress emanates from a man who is in a dependent position and whom the others regard as their equal and are therefore willing to follow. This leader has enough clarity of vision not to abuse his great influence but to use it rather for the benefit of his ruler. His ruler in turn is free of all jealousy, showers presents on the great man, and invites him continually to his court. An enlightened ruler and an obedient servant--this is the condition on which great progress depends."
      },
      "lines": [
        {
          "zh": "初六：晋如摧如，贞吉。罔孚，裕无咎。\n刚起步就碰壁、受挫，像被打击了一下。但只要守正、坚持，从容不迫、不急不躁，虽然暂时没人信任你，也不会有大错。像朝阳刚出来被云挡住，坚持下去就行。",
          "en": "Progressing, but turned back. Perseverance brings good fortune. If one meets with no confidence, one should remain calm."
        },
        {
          "zh": "六二：晋如愁如，贞吉。受兹介福，于其王母。\n前进路上有点忧愁、压力大，但守正就吉。最终会得到很大的福气，这福气来自‘王母’（比喻上位者、长辈或贵人）。像努力工作有点焦虑，但领导或长辈看在眼里，会给你大大的肯定和帮助。",
          "en": "Progressing, but in sorrow. Perseverance brings good fortune."
        },
        {
          "zh": "六三：众允，悔亡。\n得到了大家的认可和支持，之前的遗憾、悔恨全没了。说明你做事已经赢得人心，团队或群众都挺你，往前冲吧，没后顾之忧。",
          "en": "All are in accord. Remorse disappears."
        },
        {
          "zh": "九四：晋如鼫鼠，贞厉。\n晋升了却像鼫鼠（五技鼠：会点技能但都不精通），能力跟不上位置。即便守正也有危险。提醒别贪多、别勉强占着高位，要有自知之明，不然很危险。",
          "en": "Progress like a hamster. Perseverance brings danger."
        },
        {
          "zh": "六五：悔亡，失得勿恤，往吉，无不利。\n悔恨没了，得失都不用放在心上，大胆往前走，吉祥，没有任何不利。处在领导位置，胸怀放开，别斤斤计较，果断行动就行，一切都会顺利。",
          "en": "Remorse disappears."
        },
        {
          "zh": "上九：晋其角，维用伐邑，厉吉无咎，贞吝。\n晋升到顶点，像动物的角一样尖锐突出。只能靠武力征伐属邑来维持（靠强硬手段管人）。虽然危险但最终吉、无咎，但如果一直这么硬来就吝惜（不好）。到顶了要懂得收敛，别太锋芒毕露。",
          "en": "Making progress with the horns is permissible Only for the purpose of punishing one's own city."
        }
      ],
      "summary": {
        "zh": "哎，哥们儿，这晋卦简单说就是‘风生水起、步步高升’的那种感觉！太阳刚从地平线冒头，万物都跟着苏醒生长，一切都在往上走。你现在就像那朝阳，只要保持柔顺的态度、展示自己的聪明才干，别太刚愎自用，老板领导自然会赏识你，拉你上去。机会来了就抓住，但要稳扎稳打，别一下蹿太高把自己晃晕了。总的来说是大吉大利、蒸蒸日上的卦，干吧！"
      }
    },
    {
      "id": 36,
      "key": "ming_yi",
      "hexCode": "101000",
      "trigrams": {
        "upper": "kun",
        "lower": "li"
      },
      "name": {
        "zh": "明夷",
        "en": "Brilliance Injured"
      },
      "judgement": {
        "zh": "明夷。利艰贞。\n原文出自《周易》，意思是光明受伤、被掩盖的时期。卦象是太阳落入地中，天下昏暗，小人得势，君子受困。此时最有利的是在艰难中坚守正道（艰贞），不要轻易显露锋芒，低调保全自己，才能熬过黑暗迎来转机。",
        "en": "DARKENING OF THE LIGHT. In adversity It furthers one to be persevering."
      },
      "image": {
        "zh": "明入地中，明夷。君子以莅众，用晦而明。\n太阳沉入地下，这就是明夷的卦象。君子从中得到启发：治理众人、管理事情的时候，要故意藏起自己的聪明才智（用晦），表面低调愚钝，内心却保持清醒明亮，这样才能在乱世中自保并影响他人。",
        "en": "The light has sunk into the earth: The image of DARKENING OF THE LIGHT. Thus does the superior man live with the great mass: He veils his light, yet still shines."
      },
      "tuan": {
        "zh": "",
        "en": "One must not unresistingly let himself be swept along by unfavorable circumstances, nor permit his steadfastness to be shaken. He can avoid this by maintaining his inner light, while remaining outwardly yielding and tractable. With this attitude he can overcome even the greatest adversities. In some situations indeed a man must hide his light, in order to make his will prevail inspite of difficulties in his immediate environment. Perseverance must dwell in inmost consciousness and should not be discernible from without. Only thus is a man able to maintain his will in the face of difficulties."
      },
      "lines": [
        {
          "zh": "初九：明夷于飞，垂其翼。君子于行，三日不食。有攸往，主人有言。\n光明受伤，像鸟儿飞着却垂下翅膀不敢张扬。君子赶路逃难，三天没吃饭也要走。有所行动的话，主人（当权者）还会找茬说闲话。→ 这爻提醒你乱世逃命要低调快走，别指望别人理解。",
          "en": "Darkening of the light during flight. He lowers his wings."
        },
        {
          "zh": "六二：明夷，夷于左股，用拯马壮，吉。\n光明受伤，伤在左大腿。用强壮的马来救，吉利。\n→ 受伤了但不算致命，有人（贵人/好帮手）拉你一把，能逃过一劫。柔顺守正就能得救。",
          "en": "Darkening of the light injures him in the left thigh. He gives aid with the strength of a horse. Good fortune."
        },
        {
          "zh": "九三：明夷于南狩，得其大首，不可疾贞。\n在南方狩猎，捉到大头目（罪魁祸首）。不可操之过急，要坚持正道。\n→ 有能力的人可以暗中行动，抓住关键坏人，但别急于求成，要稳扎稳打、守正才能成功。",
          "en": "Darkening of the light during the hunt in the south."
        },
        {
          "zh": "六四：入于左腹，获明夷之心，于出门庭。\n进入左腹（深入昏君/黑暗核心），了解到明夷的内情，于是走出门庭（果断离开）。\n→ 深入敌营搞清楚真相后，赶紧抽身走人。识时务者为俊杰，及时止损最聪明。",
          "en": "He penetrates the left side of the belly. One gets at the very heart of the darkening of the light."
        },
        {
          "zh": "六五：箕子之明夷，利贞。\n像箕子那样在明夷中隐藏智慧，利在守正。\n→ 箕子面对暴君纣王，装疯卖傻保命，内心坚守正道。这是最高明的自保方式：表面顺从，内心不改节操，就能熬过去。",
          "en": "Darkening of the light as with Prince Chi. Perseverance furthers."
        },
        {
          "zh": "上六：不明晦，初登于天，后入于地。\n不明而晦暗。起初登上天空，后来落入地下。\n→ 极端昏庸的家伙，开始好像风光无限（登天），最后彻底坠落黑暗（入地）。这是最凶的结局，警告那些作恶到头的人必遭报应。",
          "en": "Not light but darkness. First he climbed up to heaven,"
        }
      ],
      "summary": {
        "zh": "哎，这卦简单说就是‘天黑了，收着点’。现在是黑暗期，小人当道、环境恶劣，你再牛也别硬刚，别到处秀存在感。最好的办法就是装傻、装低调，把本事藏心里，像文王被关羑里还演周易、箕子装疯卖傻保命一样。熬过去、守住底线，等天亮就翻身了。急了容易翻车，忍住就是赢。"
      }
    },
    {
      "id": 37,
      "key": "jia_ren",
      "hexCode": "101011",
      "trigrams": {
        "upper": "xun",
        "lower": "li"
      },
      "name": {
        "zh": "家人",
        "en": "Household"
      },
      "judgement": {
        "zh": "家人。利女贞。\n\n原文卦辞：家人，利女贞。\n简要解释：这一卦强调家庭和睦的关键在于女性守正、持家有道。女主人如果能坚持正道、贞静贤淑，整个家庭就能安定吉祥。",
        "en": "THE FAMILY. The perseverance of the woman furthers."
      },
      "image": {
        "zh": "风自火出，家人。君子以言有物而行有恒。\n\n原文象曰：风自火出，家人。君子以言有物而行有恒。\n简要解释：风从火里吹出来，象征家庭的影响力从内部散发出去。君子从中得到启发，说话要有实质内容，行为要有恒心和原则，这样才能真正把家治理好。",
        "en": "Wind comes forth from fire: The image of THE FAMILY.Thus the superior man has substance in his words And duration in his way of life."
      },
      "tuan": {
        "zh": "",
        "en": "The foundation of the family is the relationship between husband and wife. The tie that hold the family together lies in the loyalty and perseverance of the wife. The tie that holds the family together lies in the loyalty and perseverance of the wife. Her place is within (second line), while that of the husband is without (fifth line). It is in accord with the great laws of nature that husband and wife take their proper places. Within the family a strong authority is needed; this is represented by the parents. If the father is really a father and the son a son, if the elder brother fulfills his position, and the younger fulfills his, if the husband is really a husband and the wife a wife, then the family is in order. When the family is in order, all the social relationships of mankind will be in order. Three of the five social relationships are to be found within the family-that between father and son, which is the relation of love, that between the husband and wife, which is the relation of chaste conduct, and that between elder and younger brother, which is the relation of correctness. The loving reverence of the son is then carried over to the prince in the form of faithfulness to duty; the affection and correctness of behavior existing between the two brothers are extended to a friend in the form of loyalty, and to a person of superior rank in the form of deference. The family is society in the embryo; it is the native soil on which performance of moral duty is made early through natural affection, so that within a small circle a basis of moral practice is created, and this is later widened to include human relationships in general."
      },
      "lines": [
        {
          "zh": "初九：闲有家，悔亡。\n刚开始建家（或刚结婚/刚当家长）就要立好规矩、早做防范，这样以后就不会有后悔的事。",
          "en": "Firm seclusion within the family. Remorse disappears."
        },
        {
          "zh": "六二：无攸遂，在中馈，贞吉。\n女人不要啥事都想出头露面去干大事，老老实实管好家里的伙食、内务，守本分最吉利。",
          "en": "She should not follow her whims."
        },
        {
          "zh": "九三：家人嗃嗃，悔厉吉；妇子嘻嘻，终吝。\n家里管得太严，经常吼来吼去，虽然当时觉得有点后悔、有点过火，但长远是吉的；反过来太松散，女人小孩整天嘻嘻哈哈没正形，最后肯定出问题、倒霉。",
          "en": "When tempers flare up in the family,"
        },
        {
          "zh": "六四：富家，大吉。\n女人把家打理得井井有条、蒸蒸日上，家庭越来越富足兴旺，这是大吉大利的局面。",
          "en": "She is the treasure of the house. Great good fortune."
        },
        {
          "zh": "九五：王假有家，勿恤，吉。\n一家之主（或君王对待自家）用德行感化家人、建立威信，不用担心忧虑，自然大吉。",
          "en": "As a king he approaches his family. Fear not. Good fortune."
        },
        {
          "zh": "上九：有孚威如，终吉。\n到最后靠真诚和威严并用（不是凶巴巴的威，而是让人信服的威信），家庭彻底走上正轨，结局吉祥。",
          "en": "His work commands respect.' In the end good fortune comes."
        }
      ],
      "summary": {
        "zh": "嘿，抽到家人卦，简单说就是：家和万事兴，但这个‘和’不是随便凑合，而是得有规矩、有秩序。核心就是男主外女主内，各司其职，特别是女主人要贤惠、正派，家里才能稳。爸妈得像爸妈的样子，孩子像孩子，夫妻像夫妻，大家都守本分，从小事抓起、防微杜渐，别等乱了套再后悔。治好自己这个小家，天下自然就太平了。说白了：家风正→家庭好→外面办事顺→社会也跟着稳。挺实在的一卦。"
      }
    },
    {
      "id": 38,
      "key": "kui",
      "hexCode": "110101",
      "trigrams": {
        "upper": "li",
        "lower": "dui"
      },
      "name": {
        "zh": "睽",
        "en": "Diversity"
      },
      "judgement": {
        "zh": "睽。小事吉。\n\n原文卦辞：睽，小事吉。\n简要解释：睽卦象征乖离、背离、矛盾对立。大事难成，因为人心不合、方向相反；但小事（私事、个人事务、不需多人协作的事）反而能顺利，因为不需要强求统一。",
        "en": "OPPOSITION. In small matters, good fortune."
      },
      "image": {
        "zh": "象曰：上火下泽，睽；君子以同而异。\n\n原文象辞：上火下泽，睽。君子以同而异。\n简要解释：火往上烧、水往下流，两者背道而驰，这就是“睽”的形象。君子从中领悟：在保持大原则相同的前提下，允许并尊重各自的差异和个性，不要强求完全一致。",
        "en": "Above, fire; below. The lake. The image of OPPOSITION. Thus amid all fellowship The superior man retains his individuality."
      },
      "tuan": {
        "zh": "",
        "en": "When people live in opposition and estrangement they cannot carry out a great undertaking in common; their points of view diverge too widely. In such circumstances one should above all not proceed brusquely, for that would only increase the existing opposition; instead, one should limit oneself to producing gradual effects in small matters. Here success can still be expected, because the situation is such that the opposition does not preclude all agreement. In general, opposition appears as an obstruction, but when it represents polarity within a comprehensive whole, it has also its useful and important functions. The oppositions of heaven and earth, spirit and nature, man and woman, when reconciled, bring about the creation and reproduction of life. In the world of visible things, the principle of opposites makes possible the differentiation by categories through which order is brought into the world."
      },
      "lines": [
        {
          "zh": "初九：悔亡，丧马勿逐，自复；见恶人，无咎。\n解释：本来有点小遗憾（悔），但很快就没了。丢了马别追，它自己会回来；碰到跟你不对付的“坏人/对手”，也别躲，接触一下反而没事。",
          "en": "Remorse disappears. If you lose your horse, do not run after it; It will come back of its own accord. When you see evil people, Guard yourself against mistakes."
        },
        {
          "zh": "九二：遇主于巷，无咎。\n解释：在小巷子里意外碰到了你要找的关键人物（贵人/主子），虽然方式有点不正式，但结果没问题。",
          "en": "One meets his lord in a narrow street."
        },
        {
          "zh": "六三：见舆曳，其牛掣，其人天且劓，无初有终。\n解释：看到车被拉着走得很费劲，牛被拽着，赶车的人脸上被刺字、鼻子被割（受过刑），开头很惨、很倒霉，但最后能有好结果。",
          "en": "One sees the wagon dragged back,"
        },
        {
          "zh": "九四：睽孤，遇元夫，交孚，厉无咎。\n解释：孤立无援、很孤独的时候，遇到一个真正的大丈夫（有德有能力的伙伴），彼此真诚信任，虽然有危险，但最终没事。",
          "en": "Isolated through opposition, One meets a like-minded man With whom one can associate in good faith. Despite the danger, no blame."
        },
        {
          "zh": "六五：悔亡，厥宗噬肤，往何咎？\n解释：遗憾消失了，同族/同伙的人一起吃肉（亲近、融合），往前走有什么过错呢？很顺利。",
          "en": "Remorse disappears."
        },
        {
          "zh": "上九：睽孤，见豕负涂，载鬼一车，先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。\n解释：极度孤立猜疑，看见猪满身泥巴，又看见一车装的像鬼一样的人，先拉弓要射，后来放下弓，原来不是强盗，是来结亲的队伍。继续往前走，遇到下雨就吉祥（误会解除、疑虑消散）。",
          "en": "Isolated through opposition, One sees one's companion as a pig covered with dirt, As a wagon full of devils. First one draws a bow against him,"
        }
      ],
      "summary": {
        "zh": "嘿，这卦睽啊，说白了就是大家现在不对付、互相看不顺眼、想法南辕北辙的时候。火要往上蹿，水偏要往下淌，俩人住一块儿但心往两边跑，典型的“同床异梦”。大事别指望了，团队合作、结婚生子、大项目、拉投资啥的都容易翻车，因为人心散了。但小事儿反而行得通：自己一个人弄弄、吃个饭、买个东西、处理点私事，都还算顺。关键是别硬刚，别非要把所有人拧成一股绳——学会“求同存异”，在原则上保持一致，但允许别人跟你不一样，这样才能慢慢把裂缝补上。忍一忍、委屈点、曲线救国，往往最后还能转圜。"
      }
    },
    {
      "id": 39,
      "key": "jian",
      "hexCode": "001010",
      "trigrams": {
        "upper": "kan",
        "lower": "gen"
      },
      "name": {
        "zh": "蹇",
        "en": "Hardship"
      },
      "judgement": {
        "zh": "蹇。利西南，不利东北。利见大人，贞吉。\n\n意思是：目前处境艰难，前有险阻。利于往西南方向（平顺之地）发展，不利于往东北（更加阻塞）。利于求见有德有位的大人物，坚持正道就能吉祥。",
        "en": "OBSTRUCTION. The southwest furthers. The northeast does not further. It furthers one to see the great man. Perseverance brings good fortune."
      },
      "image": {
        "zh": "象曰：山上有水，蹇。君子以反身修德。\n\n意思是：高山上积着水，行走艰难。君子看到这个卦象，就反省自己、修养德行，在困难时不怨天尤人，而是提升自己、积蓄力量。",
        "en": "Water on the mountain: The image of OBSTRUCTION. Thus the superior man turns his attention to himself And molds his character."
      },
      "tuan": {
        "zh": "",
        "en": "The southwest is the region of retreat, the northeast that of advance. Here an individual is confronted by obstacles that cannot be overcome directly. In such a situation it is wise to pause in view of the danger and to retreat. However, this is merely a preparation for overcoming the obstructions. One must join forces with friends of like mind and put himself under the leadership of a man equal to the situation: then one will succeed in removing the obstacles. This requires the will to persevere just when one apparently must do something that leads away from his goal. This unswerving inner purpose brings good fortune in the end. An obstruction that lasts only for a time is useful for self-development. This is the value of adversity."
      },
      "lines": [
        {
          "zh": "初六：往蹇，来誉。\n前进会遇到困难，退回来反而获得赞誉。→ 刚开始别硬上，见势不妙就先回来养精蓄锐，反而会被人称赞有自知之明。",
          "en": "Going leads to obstructions, Coming meets with praise."
        },
        {
          "zh": "六二：王臣蹇蹇，匪躬之故。\n君王的臣子身处重重艰难，不是为了自己。\n→ 忠心耿耿地帮领导渡难关，就算自己也陷进去了，也不是为了私利。典型的忠臣形象，苦是真苦，但心是坦荡的。",
          "en": "The King's servant is beset by obstruction upon obstruction, But it is not his own fault."
        },
        {
          "zh": "九三：往蹇，来反。\n往前走会遇到困难，回来反而安全。\n→ 现在往前冲就是找罪受，赶紧退回来守住自己位置才是正解。知进知退才是聪明人。",
          "en": "Going leads to obstructions; Hence he comes back."
        },
        {
          "zh": "六四：往蹇，来连。\n往前有困难，回来就联合他人。\n→ 一个人硬干不行，得退回来找伙伴、拉同盟，大家一起想办法才能过难关。",
          "en": "Going leads to obstructions, Coming leads to union."
        },
        {
          "zh": "九五：大蹇，朋来。\n身处极大的艰难，但朋友、同道中人会来相助。\n→ 这是全卦最关键的位置，难到极点，但只要你是真有担当的领导，自然会有志同道合的人来帮你，共渡难关。",
          "en": "In the midst of the greatest obstructions, Friends come."
        },
        {
          "zh": "上六：往蹇，来硕，吉；利见大人。\n往前走还是难，回来却有大收获，吉祥；利于见大人。\n→ 终于熬到头了，坚持退守、修德、找对人帮忙，最后收获超乎预期。难关过去就是大翻身，恭喜！",
          "en": "Going leads to obstructions, Coming leads to great good fortune. It furthers one to see the great man."
        }
      ],
      "summary": {
        "zh": "哎，这卦就是告诉你现在真的挺难的，像山路又结冰又积水，走一步都费劲。硬往前冲多半撞墙，不如先别逞强，往好走的方向挪挪，找靠谱的大佬帮忙，最重要的是别在那儿抱怨，先老老实实把自己修炼好，等时机到了再发力。总之：知难而退才是真聪明，修德待时才是王道。"
      }
    },
    {
      "id": 40,
      "key": "jie",
      "hexCode": "010100",
      "trigrams": {
        "upper": "zhen",
        "lower": "kan"
      },
      "name": {
        "zh": "解",
        "en": "Relief"
      },
      "judgement": {
        "zh": "解：利西南，无所往，其来复吉。有攸往，夙吉。\n简要解释：危难解除后，宜往宽平柔顺的方向（西南）发展。如果无事可做，返回原处安守就吉祥；如果有目标要前进，早做准备、及早行动就吉祥。整体是脱离险境、舒缓恢复的时机。",
        "en": "DELIVERANCE. The southwest furthers. If there is no longer anything where one has to go, Return brings good fortune. If there is still something where one has to go, Hastening brings good fortune."
      },
      "image": {
        "zh": "象曰：雷雨作，解。君子以赦过宥罪。\n简要解释：上雷下雨，雷雨交加，万物舒解松弛。君子观此象，效法天地宽解之意，对别人的过错要宽恕赦免，对罪行要从宽处理。",
        "en": "Thunder and rain set in: The image of DELIVERANCE. Thus the superior man pardons mistakes And forgives misdeeds."
      },
      "tuan": {
        "zh": "",
        "en": "This refers to a time in which tensions and complications begin to be eased. At such times we ought to make our way back to ordinary conditions as soon as possible; this is the meaning of \"the southwest.\" These periods of sudden change have great importance. Just as rain relieves atmospheric tension, making all the buds burst open, so a time of deliverance from burdensome pressure has a liberating and stimulating effect on life. One thing is important, however: in such times we must not overdo our triumph. The point is not to push on farther than is necessary. Returning to the regular order of life as soon as deliverance is achieved brings good fortune. If there are any residual matters that ought to be attended to, it should be done as quickly as possible, so that a clean sweep is made and no retardations occur."
      },
      "lines": [
        {
          "zh": "初六：无咎。\n刚脱离险境，什么都不做也没过错，安心等待就是。",
          "en": "Without blame."
        },
        {
          "zh": "九二：田获三狐，得黄矢，贞吉。\n打猎捉到三只狡猾的狐狸，还得到黄色箭头（正直刚直的象征）。守正就吉祥。比喻除掉小人奸佞，得到正直之道。",
          "en": "One kills three foxes in the field And receives a yellow arrow. Perseverance brings good fortune."
        },
        {
          "zh": "六三：负且乘，致寇至，贞吝。\n背着东西还坐着华丽的车子，招来强盗。即使守正也难免羞吝。讽刺身份与行为不符、招摇过市招祸。",
          "en": "If a man carries a burden on his back And nonetheless rides in a carriage, He thereby encourages robbers to draw near. Perseverance leads to humiliation."
        },
        {
          "zh": "九四：解而拇，朋至斯孚。\n把脚拇趾（小人依附）解开脱离，朋友们才会真心到来、信任你。比喻甩掉小人纠缠，真朋友才会靠近。",
          "en": "Deliver yourself from your great toe."
        },
        {
          "zh": "六五：君子维有解，吉，有孚于小人。\n君子只有彻底解除险难，才吉祥，并且能用诚信感化小人。",
          "en": "If only the superior man can deliver himself, It brings good fortune."
        },
        {
          "zh": "上六：公用射隼于高墉之上，获之，无不利。\n王公用箭射掉高墙上的大隼（恶人/隐患），射中了，没有不利。比喻果断除掉隐藏在上层的大奸大恶，彻底解决问题。",
          "en": "The prince shoots at a hawk on a high wall. He kills it. Everything serves to further."
        }
      ],
      "summary": {
        "zh": "哎，这卦简单说就是‘雨过天晴、松一口气’的时候。之前憋了好久、卡壳了、压力山大，现在终于解套了，危险过去了。接下来别太急着往前冲，也别老想着报复啥的，先放松、修整、该原谅就原谅，该放手就放手。方向上往温和、顺应大众的方向走最舒服。要么回家好好歇着，要么早点准备去干大事，都行。总之——解脱了，喘口气，别再自己给自己上强度啦。"
      }
    },
    {
      "id": 41,
      "key": "sun",
      "hexCode": "110001",
      "trigrams": {
        "upper": "gen",
        "lower": "dui"
      },
      "name": {
        "zh": "损",
        "en": "Decreasing"
      },
      "judgement": {
        "zh": "損：有孚，元吉，無咎，可貞，利有攸往。曷之用？二簋可用享。\n\n意思是：在損的時候只要有誠信，就能大吉大利，沒有過錯，可以守正，利於有所行動。祭祀用什麼呢？兩簋簡單的食物就足以表達誠心了。核心是強調誠信比形式更重要，適度減損反而帶來長遠利益。",
        "en": "DECREASE combined with sincerity Brings about supreme good fortune Without blame. One may be persevering in this. It furthers one to undertake something. How is this to be carried out? One may use two small bowls for the sacrifice."
      },
      "image": {
        "zh": "象曰：山下有澤，損。君子以懲忿窒欲。\n\n山下有澤，澤水滲入山腳使山更高，這是損下益上的象徵。君子看到這個象，就要克制自己的憤怒、堵塞過度的欲望，懂得適時自我減損、節制慾望。",
        "en": "At the foot of the mountain, the lake: The image of DECREASE. Thus the superior man controls his anger And restrains his instincts."
      },
      "tuan": {
        "zh": "",
        "en": "Decrease does not under all circumstances mean something bad. Increase and decrease come in their own time. What matters here is to understand the time and not to try to cover up poverty with empty pretense. If a time of scanty resources brings out an inner truth, one must not feel ashamed of simplicity. For simplicity is then the very thing needed to provide inner strength for further undertakings. Indeed, there need by no concern if the outward beauty of the civilization, even the elaboration of religious forms, should have to suffer because of simplicity. One must draw on the strength of the inner attitude to compensate for what is lacking in externals; then the power of the content makes up for the simplicity of form. There is no need of presenting false appearances to God. Even with slender means, the sentiment of the heart can be expressed."
      },
      "lines": [
        {
          "zh": "初九：已事遄往，無咎，酌損之。\n意思是：把正在做的事停下來，趕緊去幫忙或參與，沒問題；但要適度減損自己，不要過頭。",
          "en": "Going quickly when one's tasks are finished Is without blame. But one must reflect on how much one may decrease others."
        },
        {
          "zh": "九二：利貞，征凶，弗損益之。\n意思是：利於守正固本，出征討伐會有凶險。不用減損自己，反而能讓對方受益。",
          "en": "Perseverance furthers."
        },
        {
          "zh": "六三：三人行，則損一人；一人行，則得其友。\n意思是：三個人一起走，必定會損失一個人；一個人獨自走，反而能找到真正的朋友。強調專一、別勉強湊合。",
          "en": "When three people journey together,"
        },
        {
          "zh": "六四：損其疾，使遄有喜，無咎。\n意思是：減損自己的毛病或障礙，快速行動就會有喜事，沒災禍。趕緊改掉壞習慣吧。",
          "en": "If a man deceases his faults, It makes the other hasten to come and rejoice."
        },
        {
          "zh": "六五：或益之十朋之龜，弗克違，元吉。\n意思是：有人送來價值連城的寶龜，想推都推不掉，大吉大利。因為你謙虛減損自己，反而得到上天和別人的大回饋。",
          "en": "Someone does indeed increase him."
        },
        {
          "zh": "上九：弗損益之，無咎，貞吉，有攸往，得臣無家。\n意思是：不用再減損了，反而能讓別人受益，沒過錯，守正吉祥。有所行動會得到無私輔佐的人才，天下歸心。",
          "en": "If one is increased without depriving other,"
        }
      ],
      "summary": {
        "zh": "哎，損卦說白了就是『吃虧是福』的卦。不是讓你傻乎乎地一直虧，而是該放手、該讓步、該少拿點的時候就別死抓著不放。真誠地付出、適度減損自己，反而能換來更大的回報和長遠的好處。就像山下的澤水滋潤了山，澤自己少了水，山卻更高了。生活中多想想『我少一點會不會大家更好』，別老算小賬，格局打開了，運氣自然就來了。"
      }
    },
    {
      "id": 42,
      "key": "yi_2",
      "hexCode": "100011",
      "trigrams": {
        "upper": "xun",
        "lower": "zhen"
      },
      "name": {
        "zh": "益",
        "en": "Increasing"
      },
      "judgement": {
        "zh": "益。利有攸往，利涉大川。\n\n原文卦辞：益卦象征增益、助益，利于有所前进、有所行动，也利于克服重大困难、涉过大险阻（大川）。整体是大吉大利、积极向上的卦，代表损上益下、互助共赢的时机。",
        "en": "INCREASE. It furthers one To undertake something. It furthers one to cross the great water."
      },
      "image": {
        "zh": "风雷，益。君子以见善则迁，有过则改。\n\n象曰原文：风雷相激荡，益。君子看到好的就立刻去学习效仿，有了错误就马上改正。意思是风雷互相助长越发强劲，提醒人要主动向善、及时纠错，不断自我提升才能真正得益。",
        "en": "Wind and thunder: the image of INCREASE. Thus the superior man: If he sees good, he imitates it; If he has faults, he rids himself of them."
      },
      "tuan": {
        "zh": "",
        "en": "Sacrifice on the part of those above for the increase of those below fills the people with a sense of joy and gratitude that is extremely valuable for the flowering of the commonwealth. When people are thus devoted to their leaders, undertakings are possible, and even difficult and dangerous enterprises will succeed. Therefore in such times of progress and successful development it is necessary to work and make the best use of time. This time resembles that of the marriage of heaven and earth, when the earth partakes of the creative power of heaven, forming and bringing forth living beings. The time of INCREASE does not endure, therefore it must be utilized while it lasts."
      },
      "lines": [
        {
          "zh": "初九：利用为大作，元吉，无咎。\n最底层刚开始动，就适合干大事，一开始就超级吉利，没毛病。意思是基础打好、时机正好，赶紧大干一场吧！",
          "en": "It furthers one to accomplish great deeds."
        },
        {
          "zh": "六二：或益之十朋之龟，弗克违，永贞吉。王用享于帝，吉。\n有人突然送你超级贵重的宝贝（十朋之龟），推都推不掉，长久守正就吉利。君王拿来祭祀天帝，也吉。意思是天上掉馅饼级的帮助来了，别矫情，接受它并心怀感恩，好好用，长远看是大吉。",
          "en": "Someone does indeed increase him;"
        },
        {
          "zh": "六三：益之用凶事，无咎。有孚中行，告公用圭。\n把得到的益处用在危难、紧急的事情上，没灾祸。真诚走中道，用圭玉去报告王公。意思是遇到麻烦时敢于把资源投进去救急，只要真心、走正道、按规矩办事，就没事，反而能转危为安。",
          "en": "One is enriched through unfortunate events."
        },
        {
          "zh": "六四：中行，告公从。利用为依迁国。\n走中道去报告，王公听从。利于依靠这个来迁移国都。意思是态度中正、沟通得当，上头会采纳你的建议，甚至可以推动大变革（迁国都这种大事），抓住机会就能有大作为。",
          "en": "If you walk in the middle And report the prince, He will follow. It furthers one to be used In the removal of the capital."
        },
        {
          "zh": "九五：有孚惠心，勿问元吉。有孚惠我德。\n真诚地施恩惠到别人心里，不用问就大吉。别人也会真心回报我的德行。意思是最高位置的人真心对下好、不求回报，反而大家都真心拥护你，这是最牛的领导方式，大吉大利。",
          "en": "If in truth you have a kind heart, ask not."
        },
        {
          "zh": "上九：莫益之，或击之，立心勿恒，凶。\n没人来增益你，反而有人打击你。因为你立心不恒定，凶。意思是到顶了还贪得无厌、不肯让利、只想自己多拿，最后没人帮你，还会被反噬，心态不稳就完蛋了，超级凶险。",
          "en": "He brings increase to no one. Indeed, someone even strikes him. He does not keep his heart constantly steady. Misfortune."
        }
      ],
      "summary": {
        "zh": "哎，这益卦简单说就是“大家互相帮一把，都能变得更好”的意思。上头的人或有资源的人肯让利、肯分享，下头的人就能多受益，整个局面就越来越好。你现在遇到这种卦，基本是告诉你：别老想着自己独吞，多帮帮别人、愿意被别人帮，这时候做事特别顺，机会特别大，往前冲就对了！但记住，得益不是白来的，要动起来、要真诚、要改掉毛病才行，不然风雷再猛也白搭。"
      }
    },
    {
      "id": 43,
      "key": "guai",
      "hexCode": "111110",
      "trigrams": {
        "upper": "dui",
        "lower": "qian"
      },
      "name": {
        "zh": "夬",
        "en": "Eliminating"
      },
      "judgement": {
        "zh": "夬。扬于王庭，孚号，有厉。告自邑，不利即戎，利有攸往。\n\n原文大意：在王庭公开宣扬（小人的罪状），真诚呼号警示大家，虽然有危险。从自己领地内发布命令，不利于立刻动用武力，利于有所前进、果断行动。",
        "en": "BREAK-THROUGH. One must resolutely make the matter known At the court of the king. It must be announced truthfully. Danger. It is necessary to notify one's own city. It does not further to resort to arms. It furthers one to undertake something."
      },
      "image": {
        "zh": "象曰：泽上于天，夬。君子以施禄及下，居德则忌。\n\n原文大意：泽水在天上（将要决裂下注），这就是夬卦的卦象。君子看到这个现象，就把恩禄施惠给下面的人，如果自己把德行积藏起来不施舍就会被人忌恨。",
        "en": "The lake has risen up to heaven: The image of BREAK-THROUGH. Thus the superior man Dispenses riches downward And refrains from resting on his virtue."
      },
      "tuan": {
        "zh": "",
        "en": "Even if only one inferior man is occupying a ruling position in a city, he is able to oppress superior men. Even a single passion still lurking in the heart has power to obscure reason. Passion and reason cannot exist side by side-therefore fight without quarter is necessary if the good is to prevail. In a resolute struggle of the good against evil, there are, however, definite rules that must not be disregarded, if it is to succeed. First, resolution must be based on a union of strength and friendliness. Second, a compromise with evil is not possible; evil must under all circumstances be openly discredited. Nor must our own passions and shortcomings be glossed over. Third, the struggle must not be carried on directly by force. If evil is branded, it thinks of weapons, and if we do it the favor of fighting against it blow for blow, we lose in the end because thus we ourselves get entangled in hatred and passion. Therefore it is important to begin at home, to be on guard in our own persons against the faults we have branded. In this way, finding no opponent, the sharp edges of the weapons of evil becomes dulled. For the same reasons we should not combat our own faults directly. As long as we wrestle with them, they continue victorious. Finally, the best way to fight evil is to make energetic progress in the good."
      },
      "lines": [
        {
          "zh": "初九：壮于前趾，往不胜，为咎。\n刚开始脚趾就特别壮（太冲动），贸然往前冲肯定打不过，反而招祸。提醒：起步别太莽，先看看形势。",
          "en": "Mighty in the forward-striding toes. When one goes and is not equal to the task, One makes a mistake."
        },
        {
          "zh": "九二：惕号，莫夜有戎，勿恤。\n警惕地呼号警戒，即使半夜有敌人来犯，也不用太担心。意思是中正有备，就算有突发状况也能稳住，不必惊慌。",
          "en": "A cry of alarm. Arms at evening and at night. Fear nothing."
        },
        {
          "zh": "九三：壮于頄，有凶。君子夬夬，独行遇雨，若濡有愠，无咎。\n脸颊（颧骨）特别硬气（太刚愎），有凶险。但真君子果决独行，就算路上淋雨湿身发脾气，也最终没事。提醒：态度要果断，但别太傲气孤立自己。",
          "en": "To be powerful in the cheekbones Brings misfortune."
        },
        {
          "zh": "九四：臀无肤，其行次且。引羊，悔亡，闻言不信。\n屁股上没皮，走路踉踉跄跄。拉着羊一起走，悔恨就没了，但听到好话却不信。意思是处境尴尬、犹豫不决时，要借助外力（像牵羊一样被带着走），别太自负拒绝建议。",
          "en": "There is no skin on his thighs, And walking comes hard. If a man were to let himself be led like a sheep, Remorse would disappear. But if these words are heard"
        },
        {
          "zh": "九五：苋陆夬夬，中行无咎。\n像铲除苋陆草一样果决铲除，中正而行就没有灾祸。最关键的位置，决断要坚决，但走中道、不偏激、不赶尽杀绝，才真正安全。",
          "en": "In dealing with weeds, Firm resolution is necessary. Walking in the middle Remains free of blame."
        },
        {
          "zh": "上六：无号，终有凶。\n没有呼号（没人声援、孤立无援），最终有凶险。小人到了穷途末路没人帮腔，彻底完蛋。提醒：如果到最后还死不悔改、没人理你，那就真危险了。",
          "en": "No cry. In the end misfortune comes."
        }
      ],
      "summary": {
        "zh": "哎呀老兄，这夬卦简单说就是：该断就断！现在阳气超级旺（五个阳爻），就剩一个小阴爻（小人/隐患）还赖在上头装大爷。你得果断把它弄下去，但别莽撞用暴力，得光明正大公开说、号召大家一起警惕、从内部先稳住，不能直接开打。时机到了就往前冲，犹豫反而坏事。核心就一句话：面对该除的坏东西，别拖泥带水，但也别冲动过头，要刚中带和、决而能悦。"
      }
    },
    {
      "id": 44,
      "key": "gou",
      "hexCode": "011111",
      "trigrams": {
        "upper": "qian",
        "lower": "xun"
      },
      "name": {
        "zh": "姤",
        "en": "Encountering"
      },
      "judgement": {
        "zh": "姤。女壮，勿用取女。\n\n原文出自《周易》。意思是：姤卦象征不期而遇，但一阴遇五阳，阴气开始生长，阳气渐消，就像女子过于强壮（女壮），不宜娶这样的女子为妻。引申为遇到了不合适或有风险的事物/人，不要贸然深入结合、长期交往，否则会带来麻烦。",
        "en": "COMING TO MEET. The maiden is powerful. One should not marry such a maiden."
      },
      "image": {
        "zh": "象曰：天下有风，姤；后以施命诰四方。\n\n原文出自《周易·象传》。意思是：风吹遍天下，这就是姤卦的卦象。君王看到这个景象，就效法风的普施无私，向四方发布命令、教化天下。强调遇合虽短暂，却能广泛传播影响，要善用时机宣扬正道。",
        "en": "Under heaven, wind: The image of COMING TO MEET. Thus does the prince act when disseminating his commands And proclaiming them to the four quarters of heaven."
      },
      "tuan": {
        "zh": "",
        "en": "The rise of the inferior element is pictured here in the image of a bold girl who lightly surrenders herself and thus seizes power. This would not be possible if the strong and light-giving element had not in turn come halfway. The inferior thing seems so harmless and inviting that a man delights in it; it looks so small and weak that he imagines he may dally with it and come to no harm. The inferior man rises only because the superior man does not regard him as dangerous and so lends him power. If he were resisted from the fist, he could never gain influence. The time of COMING TO MEET is important in still another way. Although as a general rule the weak should not come to meet the strong, there are times when this has great significance. When heaven and earth come to meet each other, all creatures prosper; when a prince and his official come to meet each other, the world is put in order. It is necessary for elements predestined to be joined and mutually dependent to come to meet one another halfway. But the coming together must be free of dishonest ulterior motives, otherwise harm will result."
      },
      "lines": [
        {
          "zh": "初六：系于金柅，贞吉。有攸往，见凶。羸豕孚踟躅。\n阴爻在最底下，像车被金制的刹车块卡住了。守正就吉利，硬要往前走就会倒霉。瘦弱的猪看似老实，其实心里不安分地来回转。→ 刚开始遇到诱惑时要像被刹车卡住一样，先稳住自己别乱动，忍一忍反而好，冲动就出事。",
          "en": "It must be checked with a brake of bronze. Perseverance brings good fortune. If one lets it take its course, one experiences misfortune. Even a lean pig has it in him to rage around."
        },
        {
          "zh": "九二：包有鱼，无咎，不利宾。\n厨房里包着鱼，没啥问题，但不适宜拿来招待客人。\n→ 你手里握着点小好处或小暧昧，自己享受没事，但千万别到处宣扬、拉别人一起掺和，公开化了反而坏事。",
          "en": "There is a fish in the tank. No blame. Does not further guests."
        },
        {
          "zh": "九三：臀无肤，其行次且，厉，无大咎。\n屁股上蹭破了皮，走路一瘸一拐，很危险，但还不至于有大祸。\n→ 被诱惑搞得坐立不安，心痒难耐又不敢真上，进退两难，挺煎熬的。但只要别真陷进去，大问题还不至于有。",
          "en": "And walking comes hard. If one is mindful of the danger,"
        },
        {
          "zh": "九四：包无鱼，起凶。\n厨房里没有鱼了，起了这个念头就很凶险。\n→ 原本有的好处/机会突然没了，或者你错过了、放手了，这时候再去强求、起贪念，反而会招来祸事。没鱼就别硬找鱼了。",
          "en": "No fish in the tank."
        },
        {
          "zh": "九五：以杞包瓜，含章，有陨自天。\n用杞树叶子包着瓜，里面藏着美好的文采（含章），忽然有东西从天上掉下来。\n→ 位置最高、最中正的阳爻，像用柔美的外表包裹内在美德。突然有意外的好处/际遇从天而降。守住本心、不乱动，反而能得天降之喜。",
          "en": "A melon covered with willow leaves. Hidden lines."
        },
        {
          "zh": "上九：姤其角，吝，无咎。\n在角落/硬角上相遇，有小遗憾/小尴尬，但最终没啥大过错。\n→ 已经到了最顶端，再相遇也只能擦肩而过，或者硬碰硬地别扭一下。虽有点不舒服、有点尴尬，但也没真出大问题。代表这种不合适的相遇最终会自然结束。",
          "en": "He comes to meet with his horns. Humiliation. No blame."
        }
      ],
      "summary": {
        "zh": "嘿，姤卦简单说就是‘意外邂逅’的意思。一根阴爻突然跑进来，跟五个阳爻碰上了，像个强势的女生突然出现在一群男生中间——乍一看挺热闹，但其实阳气已经被削弱了，阴气开始抬头。这卦提醒你：碰到突然冒出来的机会、诱惑、人际关系或者暧昧啥的，先别急着扑上去！尤其是那种看着很带劲、但本质不稳定、可能会反噬你的东西，千万别认真投入、别想长久。最好保持距离、浅尝辄止，或者干脆礼貌拒绝。男人抽到这卦尤其要小心桃花劫，女人抽到则提醒别太主动强势。总之：遇到了就遇到了，别太当真，也别太投入，风吹过就散了。"
      }
    },
    {
      "id": 45,
      "key": "cui",
      "hexCode": "000110",
      "trigrams": {
        "upper": "dui",
        "lower": "kun"
      },
      "name": {
        "zh": "萃",
        "en": "Bringing Together"
      },
      "judgement": {
        "zh": "萃：亨。王假有庙，利见大人，亨，利贞。用大牲吉，利有攸往。\n简要解释：萃卦象征聚集、荟萃，整体亨通顺利。君王到宗庙祭祖，能凝聚人心；利于见到有德有位的大人；要守正道，用隆重大牺牲祭祀吉祥，利于前进发展。核心是靠诚信、顺悦与中正来聚拢众人。",
        "en": "GATHERING TOGETHER. Success. The king approaches his temple. It furthers one to see the great man. This brings success. Perseverance furthers. To bring great offerings creates good fortune. It furthers one to undertake something."
      },
      "image": {
        "zh": "象曰：泽上于地，萃。君子以除戎器，戒不虞。\n简要解释：泽水聚集在地上，形成众多汇聚的景象。君子看到这个卦象，就要修整兵器、加强防备，预防意外祸乱。聚集虽好，但人多易生变，所以要居安思危。",
        "en": "Over the earth, the lake: The image of GATHERING TOGETHER. Thus the superior man renews his weapons In order to meet the unforeseen."
      },
      "tuan": {
        "zh": "",
        "en": "The gathering together of people in large communities is either a natural occurrence, as in the case of the family, or an artificial one, as in the case of the state. The family gathers about the father as its head. The perpetuation of this gathering in groups is achieved through the sacrifice to the ancestors, at which the whole clan is gathered together. Through the collective piety of the living members of the family, the ancestors become so integrated in the spiritual life of the family that it cannot be dispersed or dissolved. Where men are to be gathered together, religious forces are needed. But there must also be a human leader to serve as the center of the group. In order to be able to bring others together, this leader must first of all be collected within himself. Only collective moral force can unite the world. Such great times of unification will leave great achievements behind them. This is the significance of the great offerings that are made. In the secular sphere likewise there is no need of great deeds in the time of GATHERING TOGETHER."
      },
      "lines": [
        {
          "zh": "初六：有孚不终，乃乱乃萃。若号，一握为笑，勿恤，往无咎。\n简要解释：开始有诚信但坚持不下去，导致混乱又聚散无常。如果大声呼号求助，握手言和就能转忧为喜。不用担心，往前走没问题。→ 心态容易乱，找对人求助就能翻盘。",
          "en": "If you are sincere, but not to the end,"
        },
        {
          "zh": "六二：引吉，无咎，孚乃利用禴。\n简要解释：被有地位的人引荐或拉一把，大吉，没灾祸。只要有真诚，即使薄祭（简单祭祀）也管用。→ 中正柔顺，最容易得到贵人提携，诚心最重要。",
          "en": "Letting oneself be drawn Brings good fortune and remains blameless. If one is sincere, It furthers one to bring even a small offering."
        },
        {
          "zh": "六三：萃如，嗟如，无攸利。往无咎，小吝。\n简要解释：聚在一起却叹气抱怨，没啥好处。但如果行动起来也没大祸，就是小有遗憾、不太顺心。→ 位置尴尬，融入感差，想蹭热度但总觉得别扭，硬着头皮干还是能过关的。",
          "en": "Gathering together amid sighs."
        },
        {
          "zh": "九四：大吉，无咎。\n简要解释：非常吉利，没有灾祸。→ 阳刚接近君位，得到众人拥护，只要不僭越基本大吉大利。",
          "en": "Great good fortune. No blame."
        },
        {
          "zh": "九五：萃有位，无咎。匪孚，元永贞，悔亡。\n简要解释：处在尊位聚拢众人，没灾祸。但如果大家不真心信服，就要从开始就永久守正，大悔才能消除。→ 当老大位置好，但人心不稳最要命，得用元始永恒的正道来凝聚。",
          "en": "If in gathering together one has position,"
        },
        {
          "zh": "上六：赍咨涕洟，无咎。\n简要解释：悲伤叹息、哭得鼻涕眼泪一起流，没灾祸。→ 位置太高太孤立，眼看别人聚得欢自己却上不去，难受归难受，但哭完认清现实也没啥大问题。",
          "en": "Lamenting and sighing, floods of tears."
        }
      ],
      "summary": {
        "zh": "哥们儿，萃卦简单说就是‘大家聚一起的力量最大’这回事儿。像一群人抱团取暖、组队干大事的时候，气氛融洽、互相悦纳、下面顺从上面、上面有威信，就能办成大事。但前提是要有核心人物（大人）、真诚守正、别搞小动作，不然聚着聚着就散了或者出乱子。总的来说是人缘旺、资源多、机会来的卦，但得用对方式、守住底线才行。"
      }
    },
    {
      "id": 46,
      "key": "sheng",
      "hexCode": "011000",
      "trigrams": {
        "upper": "kun",
        "lower": "xun"
      },
      "name": {
        "zh": "升",
        "en": "Growing Upward"
      },
      "judgement": {
        "zh": "升。元亨。用见大人，勿恤，南征吉。\n\n意思是：大吉大利，非常亨通。适宜去拜见有地位、有智慧的大人物，不用担心害怕，向南方前进（或朝着光明方向发展）会吉祥。",
        "en": "PUSHING UPWARD has supreme success. One must see the great man. Fear not. Departure toward the south Brings good fortune."
      },
      "image": {
        "zh": "地中生木，升。君子以顺德，积小以高大。\n\n意思是：大地里面长出树木，这就是“升”的卦象。君子看到这个，就要顺应道德规律，从小处一点点积累善行和能力，最终成就高大伟岸的品格和事业。",
        "en": "Within the earth, wood grows: The image of PUSHING UPWARD. Thus the superior man of devoted character Heaps up small things In order to achieve something high and great."
      },
      "tuan": {
        "zh": "",
        "en": "The pushing upward of the good elements encounters no obstruction and is therefore accompanied by great success. The pushing upward is made possible not by violence but by modesty and adaptability. Since the individual is borne along by the propitiousness of the time, he advances. He must go to see authoritative people. He need not be afraid to do this, because success is assured. But he must set to work, for activity (this is the meaning of \"the south\") brings good fortune."
      },
      "lines": [
        {
          "zh": "初六：允升，大吉。\n解释：起步阶段就很顺利，被大家认可和接纳，上升得特别顺，大吉大利。",
          "en": "Pushing upward that meets with confidence Brings great good fortune."
        },
        {
          "zh": "九二：孚乃利用禴，无咎。\n解释：凭着真诚守信，就算用最简单的祭祀（禴是薄祭）也能被接受，没毛病、有喜事。",
          "en": "If one is sincere, It furthers one to bring even a small offering."
        },
        {
          "zh": "九三：升虚邑。\n解释：上升到一座空城邑（没人把守的地方），像如入无人之境，非常顺利，没什么阻碍。",
          "en": "One pushes upward into an empty city."
        },
        {
          "zh": "六四：王用亨于岐山，吉，无咎。\n解释：君王在岐山举行大规模祭祀，顺应天意、顺应民心，吉祥，没灾祸。",
          "en": "The king offers him Mount Ch'i. Good fortune. No blame."
        },
        {
          "zh": "六五：贞吉，升阶。\n解释：守正就会吉祥，像沿着台阶一级一级往上走，稳稳地升上去。",
          "en": "Perseverance brings good fortune. One pushes upward by steps."
        },
        {
          "zh": "上六：冥升，利于不息之贞。\n解释：在昏暗不明、看不清前路的情况下还在上升，这时候最重要的是永不停止地坚守正道，才有利。",
          "en": "Pushing upward in darkness. It furthers one"
        }
      ],
      "summary": {
        "zh": "嘿，升卦就是告诉你现在是上升期啊！像树苗从地里慢慢往上长一样，事情在稳步往好的方向走，别急躁，也别瞎担心。关键是态度要柔顺谦虚、脚踏实地、一步一个脚印，别想着一步登天。遇到贵人（大人）要主动去靠拢，有诚信、有耐心，方向对了（比如往有前景的地方努力）基本不会差。总的来说：低调努力、顺势而为、积少成多，前途一片光明，但要稳住，别飘。"
      }
    },
    {
      "id": 47,
      "key": "kun_2",
      "hexCode": "010110",
      "trigrams": {
        "upper": "dui",
        "lower": "kan"
      },
      "name": {
        "zh": "困",
        "en": "Exhausting"
      },
      "judgement": {
        "zh": "困。亨，贞，大人吉，无咎。有言不信。\n原文意思是：虽然陷入困境，但仍然能亨通。坚持正道，有德的大人就能吉祥，没有灾咎。只是说出来的话没人相信。",
        "en": "OPPRESSION. Success. Perseverance. The great man brings about good fortune. No blame. When one has something to say, It is not believed."
      },
      "image": {
        "zh": "泽无水，困。君子以致命遂志。\n泽里没有水，这就是困的象征。君子面对这种处境，要舍得付出生命代价，也要实现自己的志向。",
        "en": "There is not water in the lake: The image of EXHAUSTION. Thus the superior man stakes his life On following his will."
      },
      "tuan": {
        "zh": "",
        "en": "Times of adversity are the reverse of times of success, but they can lead to success if they; befall the right man. When a strong man meets with adversity, he remains cheerful despite all danger, and this cheerfulness is the source of later successes; it is that stability which is stronger than fate. He who lets his spirit be broken by exhaustion certainly has no success. But if adversity only bends a man, it creates in him a power to react that is bound in time to manifest itself. No inferior man is capable of this. Only the great man brings about goof fortune and remains blameless. It is true that for the time being outward influence is denied him, because his words have no effect. Therefore in times of adversity it is important to be strong within and sparing of words."
      },
      "lines": [
        {
          "zh": "初六：臀困于株木，入于幽谷，三岁不觌。\n屁股被枯树桩卡住了，躲进深山老林，三年见不到人。→ 起步就卡死，柔弱无力又位置不对，只能先躲起来自保，忍耐是唯一出路，别指望短期有人拉你。",
          "en": "One sits oppressed under a bare tree And strays into a gloomy valley. For three years one sees nothing."
        },
        {
          "zh": "九二：困于酒食，朱绂方来，利用享祀。征凶，无咎。\n被酒肉美食困住了（其实是富贵安逸的困扰），红色官服就要来了，适合去祭祀祈福。主动出击有凶险，但待着也没大错。→ 虽然现在过得还行，但其实是被安逸捆住了，好机会（上位支持）快来了，别急着乱动，守住本分、修身养性才是正道。",
          "en": "One is oppressed while at meat and drink."
        },
        {
          "zh": "六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。\n被大石头困住，屁股底下全是刺，回到家却见不到老婆，大凶。→ 最惨的一爻，不该待的地方硬待、不该争的硬争，结果里外不是人，家破人亡的预兆。千万别逞强、别钻牛角尖。",
          "en": "A man permits himself to be oppressed by stone, And leans on thorns and thistles. He enters the house and does not see his wife. Misfortune."
        },
        {
          "zh": "九四：来徐徐，困于金车，吝，有终。\n慢慢地来，被金车（贵重的大车）困住了，有小遗憾，但最终有好结果。→ 想帮忙解困但自己也动弹不得，进度超级慢，虽然有点憋屈，但只要不乱来，坚持下去会有转机。",
          "en": "He comes very quietly, oppressed in a golden carriage. Humiliation, but the end is reached."
        },
        {
          "zh": "九五：劓刖，困于赤绂，乃徐有说，利用祭祀。\n被割鼻子砍脚（受刑罚），被红色官服困住，慢慢才能解脱，适合去祭祀。\n→ 位子最高却最憋屈，被责任、名位、规矩捆得死死的。别急躁，慢慢调整，通过虔诚、内省的方式（祭祀）才能真正解脱。",
          "en": "His nose and feet are cut off. Oppression at the hands of the man with the purple knee bands. Joy comes softly. It furthers one to make offerings and libations."
        },
        {
          "zh": "上六：困于葛藟，于臲卼，曰动悔有悔，征吉。\n被藤蔓缠住，困在危木桩上，说要动又怕后悔，但真正动了反而吉祥。→ 已经困到极限了，再不动就彻底废了。虽然动有风险，但认识到错误、勇敢改变反而能翻盘。最后一搏的机会。",
          "en": "He is oppressed by creeping vines. He moves uncertainly and says, \"Movement brings remorse.\" If one feels remorse over this and makes a start, Good fortune comes."
        }
      ],
      "summary": {
        "zh": "哎，兄弟，这‘困’卦就是人生低谷、处处受阻、资源枯竭那种感觉，像沼泽干了、水全漏光了，啥都卡壳。但它没说彻底完蛋，反而开头就告诉你‘亨’，意思是困归困，心态和底线守住了，还是有出路。关键就两条：1. 别乱动、别瞎嚷嚷（有言不信），嘴巴越使劲越没人信，越把自己说崩；2. 真正的大人（有格局、有底线的人）反而能在这种绝境里稳住，甚至越困越有劲。就像被关小黑屋还能练内功的那种人。总之：现在是憋大招的时候，熬过去、守住原则、别指望靠嘴翻盘，时机一到自然解困。"
      }
    },
    {
      "id": 48,
      "key": "jing",
      "hexCode": "011010",
      "trigrams": {
        "upper": "kan",
        "lower": "xun"
      },
      "name": {
        "zh": "井",
        "en": "Replenishing"
      },
      "judgement": {
        "zh": "井。改邑不改井，无丧无得，往来井井。汔至，亦未繘井，羸其瓶，凶。\n\n意思是：村子可以迁移改换，但水井的位置不能改动，它永远在那里提供水源，没有损失也没有增加，人们来来往往打水，井水源源不断。但如果水快打上来了，绳子还没完全放下去就断了，瓶子摔破了，那就凶险。强调恒定、养人、但要善始善终、维护好资源。",
        "en": "THE WELL. The town may be changed, But the well cannot be changed. It neither decreases nor increases. They come and go and draw from the well. If one gets down almost to the water And the rope does not go all the way, Or the jug breaks, it brings misfortune."
      },
      "image": {
        "zh": "木上有水，井。君子以劳民劝相。\n\n意思是：木头（汲水工具）伸入水中把水提上来，这就是井的形象。君子看到这个，就要勤劳地教导帮助民众互相协助、互相扶持，像井水一样滋养大家。",
        "en": "Water over wood: the image of THE WELL. Thus the superior man encourages the people at their work, And exhorts them to help one another."
      },
      "tuan": {
        "zh": "",
        "en": "In ancient China the capital cities were sometimes moved, partly for the sake of more favorable location, partly because of a change in dynasties. The style of architecture changed in the course of centuries, but the shape of the well has remained the same from ancient times to this day. Thus the well is the symbol of that social structure which, evolved by mankind in meeting its most primitive needs, is independent of all political forms. Political structures change, as do nations, but the life of man with its needs remains eternally the same-this cannot be changed. Life is also inexhaustible. It grows neither less not more; it exists for one and for all. The generations come and go, and all enjoy life in its inexhaustible abundance. However, there are two prerequisites for a satisfactory political or social organization of mankind. We must go down to the very foundations of life. For any merely superficial ordering of life that leaves its deepest needs unsatisfied is as ineffectual as if no attempt at order had ever been made. Carelessness-by which the jug is broken-is also disastrous. If for instance the military defense of a state is carried to such excess that it provokes wars by which the power of the state is annihilated, this is a breaking of the jug. This hexagram applies also to the individual. However men may differ in disposition and in education, the foundations of human nature are the same in everyone. And every human being can draw in the course of his education from the inexhaustible wellspring of the divine in man's nature. But here likewise two dangers threaten: a man may fail in his education to penetrate to the real roots of humanity and remain fixed in convention-a partial education of this sort is as bad as none- or he may suddenly collapse and neglect his self-development."
      },
      "lines": [
        {
          "zh": "初六：井泥不食，旧井无禽。\n井底全是泥巴，水脏得没法喝，老旧的井连鸟都不来。比喻刚开始时状态很差、没人认可、被废弃。",
          "en": "One does not drink the mud of the well."
        },
        {
          "zh": "九二：井谷射鲋，瓮敝漏。\n井底只能射小鱼玩，汲水的瓮又破又漏。意思是才能没地方发挥，只能干点小事，工具也坏了，没人帮衬。",
          "en": "At the well hole one shoots fishes."
        },
        {
          "zh": "九三：井渫不食，为我心恻，可用汲，王明并受其福。\n井已经掏干净了，水很清，但还是没人来喝，我心里难受。其实这水完全可以用了，如果遇到明君，大家都能沾光。比喻有才华却怀才不遇，盼望被赏识。",
          "en": "The well is cleaned, but no one drinks from it."
        },
        {
          "zh": "六四：井甃，无咎。\n井壁用砖石砌好了，没毛病。代表开始认真修整自己、完善基础，虽然还没出成绩，但方向对了，不会出错。",
          "en": "The well is being lined. No blame."
        },
        {
          "zh": "九五：井洌，寒泉食。\n井水清冽，像冰凉的泉水一样好喝。代表修养到家了，德行纯正、能力突出，自然有人来汲取、被广泛认可。",
          "en": "In the well there is a clear, cold spring From which one can drink."
        },
        {
          "zh": "上六：井收，勿幕，有孚，元吉。\n井修好了，别盖上盖子，真诚开放给大家用，大吉大利。代表大功告成，成果要分享出去，真心待人，就能大吉。",
          "en": "One draws from the well Without hindrance. It is dependable."
        }
      ],
      "summary": {
        "zh": "嘿，这井卦说白了就是：你得像一口好井一样，位置稳稳的，别老想着换地方、瞎折腾。你的本事、品德、资源就摆在那儿，能养活很多人，来来往往的人都能受益。但关键是得保持干净、修好它，别让它淤了、坏了。快成功的时候千万别掉链子，不然前功尽弃。核心就是：守正、恒定、修身养德、惠及他人，别半途而废。"
      }
    },
    {
      "id": 49,
      "key": "ge",
      "hexCode": "101110",
      "trigrams": {
        "upper": "dui",
        "lower": "li"
      },
      "name": {
        "zh": "革",
        "en": "Abolishing The Old"
      },
      "judgement": {
        "zh": "革。己日乃孚。元亨利贞。悔亡。\n\n原文出自《周易》，意思是：在适当的时机（己日）进行变革，才能获得人们的信任和信服，大为亨通，有利于守正，没有悔恨。简单说就是变革要抓准时机、赢得人心、正道而行，自然大吉。",
        "en": "REVOLUTION. On your own day You are believed. Supreme success, Furthering through perseverance. Remorse disappears."
      },
      "image": {
        "zh": "象曰：泽中有火，革。君子以治历明时。\n\n泽上有火燃烧，象征旧的被革除、新的诞生。君子看到这个现象，就制定历法、明确时令，顺应自然的变化规律来治理天下。",
        "en": "Fire in the lake: the image of REVOLUTION. Thus the superior man Sets the calendar in order And makes the seasons clear."
      },
      "tuan": {
        "zh": "",
        "en": "Political revolutions are extremely grave matters. They should be undertaken only under stress of direst necessity, when there is no other way out. Not everyone is called to this task, but only the man who has the confidence of the people, and even he only when the time is ripe. He must then proceed in the right way, so that he gladdens the people and, by enlightening them, prevents excesses. Furthermore, he must be quite free of selfish aims and must really relieve the need of the people. Only then does he have nothing to regret. Times change, and with them their demands. Thus the seasons change in the course of the year. In the world cycle also there are spring and autumn in the life of peoples and nations, and these call for social transformations."
      },
      "lines": [
        {
          "zh": "初九：巩用黄牛之革。\n刚开始别急着动，用黄牛皮把车捆牢实了，意思是时机还没到，先稳住自己，别轻举妄动。",
          "en": "Wrapped in the hide of a yellow cow."
        },
        {
          "zh": "六二：己日乃革之，征吉，无咎。\n到了该变的日子（己日）就动手改革，出征大吉，没毛病。这是最理想的变革时机，柔顺中正，时机成熟就干，成功率最高。",
          "en": "When one's own day comes, one may create revolution."
        },
        {
          "zh": "九三：征凶，贞厉，革言三就，有孚。\n急着出征会凶，硬守旧也危险。改革的话要反复说上好几遍（三就），让人彻底信服了再动。说明变革得有耐心，多沟通才能真正得到认可。",
          "en": "Starting brings misfortune. Perseverance brings danger. When talk of revolution has gone the rounds three times, One may commit himself, And men will believe him."
        },
        {
          "zh": "九四：悔亡，有孚改命，吉。\n悔恨没了，有诚信就能改变天命，大吉。到了这个位置，变革已经得到广泛信任，可以顺势改朝换代、彻底革新。",
          "en": "Remorse disappears. Men believe him. Changing the form of government brings good fortune."
        },
        {
          "zh": "九五：大人虎变，未占有孚。\n大人像老虎换毛一样威猛变革，还没占卜就已经得到大家的信服。最强、最正当的变革位置，像汤武革命那样顺天应人。",
          "en": "The great man changes like a tiger. Even before he questions the oracle He is believed."
        },
        {
          "zh": "上六：君子豹变，小人革面，征凶，居贞吉。\n君子像豹子一样文采焕然地变革，小人只是表面改改样子。继续征伐凶险，安守正道吉祥。变革到最后阶段，风气已经变了，再硬来就不对了，安心守成果就好。",
          "en": "The superior man changes like a panther."
        }
      ],
      "summary": {
        "zh": "哎，这革卦啊，说白了就是该变就得变，别拖！旧的东西已经烂到不行了，水火不容的那种矛盾憋着，早晚炸。就像开水烧到99度没用，得再加一把火到100度才沸腾翻身。时机到了就果断改，改得对、改得及时、让人信服，就能大吉大利，不然拖着只会更乱。朋友聊天就一句话：别怕变，怕的是不变或者乱变。"
      }
    },
    {
      "id": 50,
      "key": "ding",
      "hexCode": "011101",
      "trigrams": {
        "upper": "li",
        "lower": "xun"
      },
      "name": {
        "zh": "鼎",
        "en": "Establishing The New"
      },
      "judgement": {
        "zh": "鼎：元吉，亨。\n原文意思是大吉大利，非常亨通。鼎卦象征革故鼎新、稳固建立新秩序，像鼎器稳重烹饪，代表除旧布新、养贤用能的美好局面，一切顺利通达。",
        "en": "THE CALDRON. Supreme good fortune. Success."
      },
      "image": {
        "zh": "象曰：木上有火，鼎。君子以正位凝命。\n木上燃火，就是鼎的形象。君子看到这个卦象，要端正自己的位置，坚定完成天命赋予的责任，像鼎一样稳重庄严，守正而成就大业。",
        "en": "Fire over wood: The image of THE CALDRON. Thus the superior man consolidates his fate By making his position correct."
      },
      "tuan": {
        "zh": "",
        "en": "While THE WELL relates to the social foundation of our life, and this foundation is likened to the water that serves to nourish growing wood, the present hexagram refers to the cultural superstructure of society. Here it is the wood that serves as nourishment for the flame, the spirit. All that is visible must grow beyond itself, extend into the realm of the invisible. Thereby it receives its true consecration and clarity and takes firm root in the cosmic order. Here we see civilization as it reaches its culmination in religion. The ting serves in offering sacrifice to God. The highest earthly values must be sacrificed to the divine. But the truly divine does not manifest itself apart from man. The supreme revelation of God appears in prophets and holy men. To venerate them is true veneration of God. The will of God, as revealed through them, should be accepted in humility; this brings inner enlightenment and true understanding of the world, and this leads to great good fortune and success."
      },
      "lines": [
        {
          "zh": "初六：鼎颠趾，利出否，得妾以其子，无咎。\n鼎足颠倒了，反而利于倒出里面的坏东西（否=坏的、陈腐的）；就像娶个妾却生了好儿子，地位上升，没毛病。刚开始要先清垃圾、除旧，才能装新东西。",
          "en": "A ting with legs upturned. Furthers removal of stagnating stuff. One takes a concubine for the sake of her son."
        },
        {
          "zh": "九二：鼎有实，我仇有疾，不我能即，吉。\n鼎里已经装满好东西了，有嫉妒我的人（仇）生病了，靠近不了我，吉利。东西有了，就要小心保护，别让人坏事，自己低调点就没事。",
          "en": "There is food in the ting. My comrades are envious, But they cannot harm me. Good fortune."
        },
        {
          "zh": "九三：鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉。\n鼎耳（提手）坏了变形，路堵住了，好吃的雉膏（山鸡肉羹）吃不到；等到下雨（阴阳调和）悔气消了，最终还是吉。中间会卡壳、郁闷一下，坚持等时机，后面会翻盘。",
          "en": "The handle of the ting is altered. One is impeded in his way of life."
        },
        {
          "zh": "九四：鼎折足，覆公餗，其形渥，凶。\n鼎足断了，把王公的粥都打翻了，弄得一身狼藉，凶。位置不对、能力不够还硬扛重任，就会翻车、闯大祸，特别惨。",
          "en": "The legs of the ting are broken."
        },
        {
          "zh": "六五：鼎黄耳金铉，利贞。\n鼎耳是黄的（中正），提手是金的（刚健），利于守正。君位虚中用贤、耳聪目明、用对人，格局稳了，只要坚持正道就大好。",
          "en": "The ting has yellow handles, golden carrying rings. Perseverance furthers."
        },
        {
          "zh": "上九：鼎玉铉，大吉，无不利。\n鼎的提手用玉做的，超级高贵，大吉，没任何不利。到了最高位，刚柔并济、文明高雅，一切都圆满，完美收官。",
          "en": "The ting has rings of jade. Great good fortune."
        }
      ],
      "summary": {
        "zh": "哎，兄弟，这鼎卦超级稳！革卦刚把旧的东西革掉，鼎卦就是来建新局面的——像一口大鼎，三足站得稳稳的，下面烧火，上面煮东西，旧的坏的倒掉，新的好东西装进来。从此吃饱喝足、养贤人、定规矩、立秩序，大方向就是‘稳中求进、去旧立新’，只要你别瞎折腾，坚持正道、用对人、守好本分，基本啥事都能成，吉利到飞起！"
      }
    },
    {
      "id": 51,
      "key": "zhen",
      "hexCode": "100100",
      "trigrams": {
        "upper": "zhen",
        "lower": "zhen"
      },
      "name": {
        "zh": "震",
        "en": "Taking Action"
      },
      "judgement": {
        "zh": "震。亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。\n\n原文意思：震卦亨通。雷声突然响起时人人惊恐得发抖（虩虩），过后却能谈笑风生（哑哑）。雷声能震惊方圆百里，但祭祀时手中酒器和勺子却不会掉落。",
        "en": "SHOCK brings success. Shock comes-oh, oh! Laughing words -ha, ha! The shock terrifies for a hundred miles, And he does not let fall the sacrificial spoon and chalice."
      },
      "image": {
        "zh": "象曰：洊雷，震。君子以恐惧修省。\n\n原文意思：连绵不断的雷声，这就是震卦的卦象。君子看到这个现象，会心生恐惧，从而反省自身、修养德行。",
        "en": "Thunder repeated: the image of SHOCK. Thus in fear and trembling The superior man sets his life in order And examines himself."
      },
      "tuan": {
        "zh": "",
        "en": "The shock that comes from the manifestation of God within the depths of the earth makes man afraid, but this fear of God is good, for joy and merriment can follow upon it. When a man has learned within his heart what fear and trembling mean, he is safeguarded against any terror produced by outside influences. Let the thunder roll and spread terror a hundred miles around: he remains so composed and reverent in spirit that the sacrificial rite is not interrupted. This is the spirit that must animate leaders and rulers of men-a profound inner seriousness from which all terrors glance off harmlessly."
      },
      "lines": [
        {
          "zh": "初九：震来虩虩，后笑言哑哑，吉。\n听到雷声先吓一跳，谨慎恐惧反而带来好结果，后来就能轻松谈笑，吉祥。",
          "en": "Shock comes-oh, oh!"
        },
        {
          "zh": "六二：震来厉，亿丧贝，跻于九陵，勿逐，七日得。\n雷声来得凶险，估计会丢钱财，赶紧爬到高山上躲躲，别急着去找，七天左右东西自己会回来。",
          "en": "Shock comes bringing danger. A hundred thousand times You lose your treasures And must climb the nine hills. Do not go in pursuit of them. After seven days you will get them back again."
        },
        {
          "zh": "六三：震苏苏，震行无眚。\n被雷震得一直发抖（苏苏），但只要因为害怕而小心行动，就不会有灾祸。",
          "en": "Shock comes and makes one distraught. If shock spurs to action One remains free of misfortune."
        },
        {
          "zh": "九四：震遂泥。\n雷声震得陷入泥泞之中（遂泥），行动受阻，处境不佳。",
          "en": "Shock is mired."
        },
        {
          "zh": "六五：震往来厉，亿无丧，有事。\n雷声来来去去都很危险，但最终不会有大的损失，只是会有点事情要处理。",
          "en": "Shock goes hither and thither. Danger. However, nothing at all is lost. Yet there are things to be done."
        },
        {
          "zh": "上六：震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。\n吓得浑身发抖，看东西都眼神慌乱（索索、矍矍），这种状态出去做事肯定凶。雷如果不打到自己而打到邻居，就没灾祸。但婚姻亲戚关系上会有些闲言碎语。",
          "en": "Shock brings ruin and terrified gazing around. Going ahead brings misfortune. If it has not yet touched one's own body But has reached one's neighbor first,"
        }
      ],
      "summary": {
        "zh": "哎，震卦就是生活里突然来个大雷劈下来的感觉——吓你一跳，心脏怦怦跳，但其实这雷劈得及时！它告诉你：遇到突发状况、变动、危机、意外，先别慌，怕是正常的，但越怕越要稳住，越要警醒自己。真正牛的人是被雷劈了还能淡定地把酒杯端稳不洒（不丧匕鬯）。这卦的核心就俩字：惊而不乱。平时多点敬畏心、多反省，关键时刻才能笑出来。动荡是常态，镇定才是本事，挺过去就亨通。"
      }
    },
    {
      "id": 52,
      "key": "gen",
      "hexCode": "001001",
      "trigrams": {
        "upper": "gen",
        "lower": "gen"
      },
      "name": {
        "zh": "艮",
        "en": "Keeping Still"
      },
      "judgement": {
        "zh": "艮：艮其背，不获其身；行其庭，不见其人，无咎。\n原文意思是：止于背部（像背对诱惑），不让身体（私欲）得逞；走在庭院里，却像没看见别人一样（互不干扰）。这样恰到好处的止，就能没灾祸。简单说就是该停就停，别硬来，时机不对就别勉强，自然平安。",
        "en": "KEEPING STILL. Keeping his back still So that he no longer feels his body. He goes into his courtyard And does not see his people. No blame."
      },
      "image": {
        "zh": "象曰：兼山，艮；君子以思不出其位。\n两座山重叠，就是艮的卦象。君子看到这个，就明白：想问题、做事情要守本分，别越界、别瞎掺和。思虑要停在自己该待的位置上。",
        "en": "Mountains standing close together: The image of KEEPING STILL. Thus the superior man Does not permit his thoughts To go beyond his situation."
      },
      "tuan": {
        "zh": "",
        "en": "True quiet means keeping still when the time has come to keep still, and going forward when the time has come to go forward. In this way rest and movement are in agreement with the demands of the time, and thus there is light in life. The hexagram signifies the end and the beginning of all movement. The back is named because in the back are located all the nerve fibers that mediate movement. If the movement of these spinal nerves is brought to a standstill, the ego, with its restlessness, disappears as it were. When a man has thus become calm, he may turn to the outside world. He no longer sees in it the struggle and tumult of individual beings, and therefore he has that true peace of mind which is needed for understanding the great laws of the universe and for acting in harmony with them. Whoever acts from these deep levels makes no mistakes."
      },
      "lines": [
        {
          "zh": "初六：艮其趾，无咎，利永贞。\n刚想抬脚就赶紧停住，别迈出错误第一步，就没祸事了，而且长期守正道有好处。——从源头就把冲动掐掉，最安全。",
          "en": "Keeping his toes still."
        },
        {
          "zh": "六二：艮其腓，不拯其随，其心不快。\n小腿想动却被迫跟着别人停，心里憋屈不爽。——有时候环境不允许你动，只能跟着停，心里再难受也得忍。",
          "en": "Keeping his calves still. He cannot rescue him whom he follows. His heart is not glad."
        },
        {
          "zh": "九三：艮其限，列其夤，厉薰心。\n腰部（界限）被卡住，脊椎像撕裂一样，危险像烟熏心一样难受。——强行止住不动，憋得慌，容易出大问题，心火上升。",
          "en": "Keeping his hips still. Making his sacrum stiff. Dangerous. The heart suffocates."
        },
        {
          "zh": "六四：艮其身，无咎。\n全身都稳稳地停住，就没灾祸。——到这个位置，真正做到身心都安静下来，反而平安。",
          "en": "Keeping his trunk still."
        },
        {
          "zh": "六五：艮其辅，言有序，悔亡。\n管住嘴巴，说话有条理、有分寸，后悔就没了。——最高级的止是管住嘴，说话前三思，祸从口出这关过了就稳。",
          "en": "Keeping his jaws still."
        },
        {
          "zh": "上九：敦艮，吉。\n敦厚笃实地止住欲望、守住底线，大吉。——到顶点了还能保持厚道、老实停住，不贪不躁，才是真圆满。",
          "en": "Noblehearted keeping still. Good fortune."
        }
      ],
      "summary": {
        "zh": "嘿，艮卦就是告诉你：该刹车就刹车！现在不是往前冲的时候，别硬着头皮上，容易翻车。像两座大山摞一起，动不了也别乱动，老老实实停下来，管好自己那一亩三分地，别眼红别人、别乱伸手。止得恰到好处，反而没事；乱动反而惹祸。生活中遇到瓶颈、冲动想干点啥的时候，先问问自己：现在是时候吗？多半答案是——先歇歇，稳住别浪。"
      }
    },
    {
      "id": 53,
      "key": "jian_2",
      "hexCode": "001011",
      "trigrams": {
        "upper": "xun",
        "lower": "gen"
      },
      "name": {
        "zh": "渐",
        "en": "Developing Gradually"
      },
      "judgement": {
        "zh": "漸。女歸吉，利貞。\n\n原文卦辞：渐，女归吉，利贞。\n简要解释：像女子出嫁一样，按部就班、循序渐进才能吉祥，利于守正道。强调凡事不能急躁冒进，必须一步一个脚印才行得通。",
        "en": "DEVELOPMENT. The maiden Is given in marriage. Good fortune. Perseverance furthers."
      },
      "image": {
        "zh": "象曰：山上有木，漸。君子以居賢德善俗。\n\n原文象辞：山上有木，渐。君子以居贤德善俗。\n简要解释：高山上长着树木，树木慢慢长高，山也随之增高，这就是“渐”的形象。君子看到这个现象，就懂得要慢慢培养自己的贤德，同时去改善社会风俗，一切都要循序渐进、潜移默化。",
        "en": "On the mountain, a tree: The image of DEVELOPMENT. Thus the superior man abides in dignity and virtue, In order to improve the mores."
      },
      "tuan": {
        "zh": "",
        "en": "The development of events that leads to a girl's following a man to his home proceeds slowly. The various formalities must be disposed of before the marriage takes place. This principle of gradual development can be applied to other situations as well; it is always applicable where it is a matter of correct relationships of co-operation, as for instance in the appointment of an official. The development must be allowed to take its proper course. Hasty action would not be wise. This is also true, finally, of any effort to exert influence on others, for here too the essential factor is a correct way of development through cultivation of one's own personality. No influence such as that exerted by agitators has a lasting effect. Within the personality too, development must follow the same course if lasting results are to be achieved. Gentleness that is adaptable, but at the same time penetrating, is the outer form that should proceed from inner calm. The very gradualness of the development makes it necessary to have perseverance, for perseverance alone prevents slow progress from dwindling to nothing."
      },
      "lines": [
        {
          "zh": "初六：鴻漸於乾。小子厲，有言，無咎。\n初爻在最底下，像大雁刚到河岸边，地位低、容易被小人说闲话、有点危险，但只要慢慢来、不乱动，就不会出大问题。",
          "en": "The wild goose gradually draws near the shore."
        },
        {
          "zh": "六二：鴻漸於磐，飲食衎衎，吉。\n二爻像大雁落到平整的大石头上，大家吃吃喝喝很开心。位置稳当了，生活也安稳和谐，坚持下去是大吉。",
          "en": "The wild goose gradually draws near the cliff. Eating and drinking in peace and concord. Good fortune."
        },
        {
          "zh": "九三：鴻漸於陸。夫征不復，婦孕不育，凶。利禦寇。\n三爻像大雁跑到平地上，本该继续往前却停了。比喻丈夫出征回不来、妻子怀孕却流产，很凶险。只能用来防御强盗，不能主动出击。",
          "en": "The wild goose gradually draws near the plateau."
        },
        {
          "zh": "六四：鴻漸於木，或得其桷，無咎。\n四爻像大雁落到树上，找到一根平直的树枝落脚。虽然不太稳当，但只要找到合适的位置站稳，就没啥灾祸。",
          "en": "The wild goose goes gradually draws near the tree. Perhaps it will find a flat branch. No blame."
        },
        {
          "zh": "九五：鴻漸於陵。婦三歲不孕，終莫之勝，吉。\n五爻像大雁飞到高高的山陵上。比喻妻子三年没怀孕，但最终丈夫也没能征服她（或三年等待后终于好转），结果是大吉。代表耐心等待，时机成熟自然好。",
          "en": "The wild goose gradually draws near the summit. For three years the woman has no child. In the end nothing can hinder her. Good fortune."
        },
        {
          "zh": "上九：鴻漸於阿，其羽可用為儀，吉。\n上爻像大雁飞到高高的山坡，羽毛漂亮可以做仪仗装饰。代表到了最高点，功成名就、德行彰显，退隐也好、留名也好，都是吉祥的结局。",
          "en": "The wild goose gradually draws near the clouds heights. Its feathers can be used for the sacred dance. Good fortune."
        }
      ],
      "summary": {
        "zh": "哎，渐卦讲的就是一句话：别急，慢慢来。啥事都不是一蹴而就的，得像大雁飞一样，一步一步、按顺序往前走。就像古代闺女出嫁，得按礼节一步步来，不能直接冲进洞房——急了就乱套。想成功、想上位、想变好，都得有耐心、有步骤，守规矩、走正道，最后才能稳稳当当到终点。急功近利基本没好下场，稳扎稳打才是王道。"
      }
    },
    {
      "id": 54,
      "key": "gui_mei",
      "hexCode": "110100",
      "trigrams": {
        "upper": "zhen",
        "lower": "dui"
      },
      "name": {
        "zh": "归妹",
        "en": "Marrying Maiden"
      },
      "judgement": {
        "zh": "归妹。征凶，无攸利。\n\n原文卦辞：少女出嫁（或妹妹出嫁），急于求成、违背常理地往前冲是凶险的，没有什么利益可图。核心是位置不当、柔乘刚，阴阳失序，勉强行事必败。",
        "en": "THE MARRYING MAIDEN. Undertakings bring misfortune. Nothing that would further."
      },
      "image": {
        "zh": "象曰：泽上有雷，归妹。君子以永终知敝。\n\n泽上打雷，雷动泽悦，象征少女喜悦而动、急于出嫁的景象。君子看到这个卦象，要懂得婚姻（或任何大事）要考虑长久，知道其中隐藏的弊端和缺陷，提前防范，不要被一时冲动蒙蔽。",
        "en": "Thunder over the lake: The image of THE MARRYING MAIDEN. Thus the superior man Understands the transitory In the light of the eternity of the end."
      },
      "tuan": {
        "zh": "",
        "en": "A girl who is taken into the family, but not as the chief wife, must behave with special caution and reserve. She must not take it upon herself to supplant the mistress of the house, for that would mean disorder and lead to untenable relationships. The same is true of all voluntary relationships between human beings. While legally regulated relationships based on personal inclination depend in the long run entirely on tactful reserve. Affection as the essential principle of relatedness is of the greatest importance in all relationships in the world. For the union of heaven and earth is the origin of the whole of nature. Among human beings likewise, spontaneous affection is the all-inclusive principle of union."
      },
      "lines": [
        {
          "zh": "初九：归妹以娣，跛能履，征吉。\n把妹妹当陪嫁小妾嫁出去，虽然地位低（像跛子走路不正），但还能往前走，勉强守礼而行，结果还是吉的。",
          "en": "The marrying maiden as a concubine. A lame man who is able to tread. Undertakings bring good fortune."
        },
        {
          "zh": "九二：眇能视，利幽人之贞。\n瞎了一只眼还能看东西，利于像隐士/盲人那样守正、安分守己。意思是处境不完美，但别强求，安于现状、守本分反而好。",
          "en": "A one-eyed man who is able to see."
        },
        {
          "zh": "六三：归妹以须，反归以娣。\n想当正室出嫁却等不到（以须=等待），最后只能回头当小妾。急着往上爬、位置不对，反而降级，讽刺好高骛远。",
          "en": "The marrying maiden as a slave."
        },
        {
          "zh": "九四：归妹愆期，迟归有时。\n出嫁推迟了日期，晚点嫁反而有好时机。劝人别急，耐心等待合适时机反而更好。",
          "en": "The marrying maiden draws out the allotted time. A late marriage comes in due course."
        },
        {
          "zh": "六五：帝乙归妹，其君之袂不如其娣之袂良，月几望，吉。\n帝乙把妹妹嫁出去，正妻的衣袖（华丽）反不如陪嫁小妾的好；月亮快圆了，吉祥。意思是高位者能谦虚、不争华丽外表，以德服人，反而吉。",
          "en": "The sovereign I gave his daughter in marriage."
        },
        {
          "zh": "上六：女承筐无实，士刲羊无血，无攸利。\n女子捧着筐子却没东西，男子杀羊却没血，空洞无物、形式主义。彻底没利益，讽刺徒有其表、没有实质的结合，结局很惨。",
          "en": "The woman holds the basket, but there are no fruits in it."
        }
      ],
      "summary": {
        "zh": "哎，这卦说白了就是：别着急，别乱来！尤其是感情、婚姻、合作这种大事，位置不对、顺序乱了、女的压男的、小的压大的、下面硬上头，急吼吼往前冲，基本没好结果。像把妹妹急着嫁出去当小老婆，或者感情里一方太主动太急，另一方被动应付，最后多半是空欢喜一场。核心提醒：凡事要守正、守时、守位，别逆天行事，否则费力不讨好，还容易翻车。慢慢来，按规矩来，才有长久。"
      }
    },
    {
      "id": 55,
      "key": "feng",
      "hexCode": "101100",
      "trigrams": {
        "upper": "zhen",
        "lower": "li"
      },
      "name": {
        "zh": "丰",
        "en": "Abundance"
      },
      "judgement": {
        "zh": "豐。亨，王假之，勿憂，宜日中。\n\n原文意思是：丰卦，大通顺，君王亲临祭祀宗庙，不用忧虑，最适宜在日正当中（最光明、最盛大的时候）行事。简要解释：这是极度盛大、光明的状态，像太阳高挂正午，亨通无比，但也暗含盛极必衰的提醒，要抓住巅峰时机。",
        "en": "ABUNDANCE has success. The king attains abundance. Be not sad. Be like the sun at midday."
      },
      "image": {
        "zh": "象曰：雷电皆至，丰。君子以折狱致刑。\n\n原文意思是：雷电同时到来，这就是丰的卦象。君子看到这个象，就用雷霆般的威严和闪电般的明断来审理案件、执行刑罚。简要解释：丰是光明与震动的结合，象征盛大时要保持公正严明，像雷电照亮黑暗、震慑邪恶，用来执法断案最合适。",
        "en": "Both thunder and lightning come: The image of ABUNDANCE. Thus the superior man decides lawsuits And carries out punishments. This hexagram has a certain connection with Shih Ho, BITING THROUGH"
      },
      "tuan": {
        "zh": "",
        "en": "It is not given to every mortal to bring about a time of outstanding greatness and abundance. Only a born ruler of men is able to do it, because his will is directed to what is great. Such a time of abundance is usually brief. Therefore a sage might well feel sad in view of the decline that must follow. But such sadness foes not befit him. Only a man who is inwardly free of sorrow and care can lead in a time of abundance. He must be like the sun at midday, illuminating and gladdening everything under heaven."
      },
      "lines": [
        {
          "zh": "初九：遇其配主，虽旬无咎，往有尚。\n刚上来就遇到匹配的贵人或伙伴，虽然已经等了十天也没事，继续往前走会有回报。意思是开局就遇到对的人，时机稍晚点也没关系，积极行动有回报。",
          "en": "When a man meets his destined ruler,"
        },
        {
          "zh": "六二：丰其蔀，日中见斗。往得疑疾，有孚发若，吉。\n遮蔽的东西太大了，正午居然能看见北斗星。往前走会招来怀疑和毛病，但只要真诚发动、坦诚相待，就能吉祥。意思是盛大中反而黑暗、被蒙蔽，看不清前路，坚持诚信才能破局。",
          "en": "The curtain is of such fullness"
        },
        {
          "zh": "九三：丰其沛，日中见沫，折其右肱，无咎。\n遮蔽更严重，正午看见小星星（或模糊不明），右臂折断了，没有大的过错。意思是黑暗更重、助力受损，但只要不逞强、不乱来，也能平安无咎。",
          "en": "The underbrush is of such abundance"
        },
        {
          "zh": "九四：丰其蔀，日中见斗，遇其夷主，吉。\n遮蔽又严重，正午见北斗，遇到平级的伙伴或相当的主人，吉祥。意思是虽然环境昏暗，但找到对等、能合作的人，一起就能突破。",
          "en": "The curtain is of such fullness"
        },
        {
          "zh": "六五：来章，有庆誉，吉。\n招来有文采、有光明德行的人辅佐，有喜庆和好名声，吉祥。意思是领导位置上主动吸引贤才、光明正大的人来帮忙，大吉大利。",
          "en": "Lines are coming, Blessing and fame draw near. Good fortune."
        },
        {
          "zh": "上六：丰其屋，蔀其家，窥其户，阒其无人，三岁不觌，凶。\n房子建得又大又豪华，家里却遮得严严实实，从门缝看去空无一人，三年见不到人，凶。意思是盛极而衰，自我封闭、刚愎自用，最后孤独、荒凉，结局很惨。",
          "en": "His house is in a state of abundance. He screens off his family. He peers through the gate And no longer perceives anyone. For three years he sees nothing. Misfortune."
        }
      ],
      "summary": {
        "zh": "哥们儿，这卦现在就是你人生最巅峰、最风光的时候！事业、财富、名声、机会全都爆棚，像正午的太阳，亮瞎所有人眼。特别爽，特别亨通，感觉天下都是你的。但老哥提醒一句：太阳到正午就该开始下山了，月圆必缺，东西太满就容易翻车。所以现在别飘，别贪过头，要趁着最亮的时候把该干的事干完，该收的收好，保持清醒、低调点、公正点，别等盛极而衰砸手里了。巅峰就是用来好好利用的，不是拿来作的。"
      }
    },
    {
      "id": 56,
      "key": "lu_2",
      "hexCode": "001101",
      "trigrams": {
        "upper": "li",
        "lower": "gen"
      },
      "name": {
        "zh": "旅",
        "en": "Travelling"
      },
      "judgement": {
        "zh": "旅：小亨，旅贞吉。\n\n意思是：在旅途中能有小通达（小有顺利），旅行在外保持正道就会吉祥。旅卦整体讲在外漂泊的状态，不可能大富大贵，但守正、安分、谨慎、低调就能获得相对好的结果。",
        "en": "The Wanderer. Success through smallness. Perseverance brings good fortune to the wanderer. WHEN A man is a wanderer and stranger, he should not be gruff nor overbearing. He has no large circle of acquaintances, therefore he should not give himself airs. He must be cautious and reserved; in this way he protects himself from evil. If he is obliging toward others, he wins success."
      },
      "image": {
        "zh": "象曰：山上有火，旅；君子以明慎用刑，而不留狱。\n\n山上烧着火，火势不能持久，很快烧过就没了，这就是旅的景象。君子看到这个意象，就应该在用刑罚时特别明察、慎重，而且判了就尽快执行，不拖延积压案子（引申为处事不要拖泥带水）。",
        "en": "Fire on the mountain: The image of THE WANDERER. Thus the superior man Is clear-minded and cautious In imposing penalties, And protracts no lawsuits."
      },
      "tuan": {
        "zh": "",
        "en": "A wanderer has no fixed abode; his home is the road. Therefore he must take care to remain upright and steadfast, so that he sojourns only in the proper places, associating only with good people. Then he has good fortune and can go his way unmolested."
      },
      "lines": [
        {
          "zh": "初六：旅琐琐，斯其所取灾。\n出门在外特别小气、斤斤计较、畏首畏尾的样子，反而容易招来灾祸。",
          "en": "If the wanderer busies himself with trivial things, He draws down misfortune upon himself."
        },
        {
          "zh": "六二：旅即次，怀其资，得童仆贞。\n在旅途中找到落脚的旅店，带着自己的钱财，得到忠心的童仆帮忙。处于比较安稳的一爻。",
          "en": "The wanderer comes to an inn. He has his property with him. He wins the steadfastness of a young servant."
        },
        {
          "zh": "九三：旅焚其次，丧其童仆，贞厉。\n旅店被烧了，连童仆也跑了或死了，坚持正道也危险。处境急转直下，很惨。",
          "en": "The wanderer's inn burns down. He loses the steadfastness of his young servant. Danger."
        },
        {
          "zh": "九四：旅于处，得其资斧，我心不快。\n在外面找到个暂时安身的地方，也赚了点钱（或有了防身工具），但心里还是不痛快。身安而心不安。",
          "en": "The wanderer rests in a shelter. He obtains his property and an ax. My heart is not glad."
        },
        {
          "zh": "六五：射雉，一矢亡，终以誉命。\n去射野鸡，一箭没射中鸡却丢了箭，但最后却得到荣誉和好命。意外失小得大，典型破财消灾转吉的爻。",
          "en": "He shoots a pheasant. It drops with the first arrow. In the end this brings both praise and office."
        },
        {
          "zh": "上九：鸟焚其巢，旅人先笑后号咷，丧牛于易，凶。\n鸟窝被火烧了，旅行的人开始还得意，后来大哭，牛在边界丢了，大凶。得意忘形、过于自满、失去根本保障的下场，非常凶险。",
          "en": "The bird's nest burns up."
        }
      ],
      "summary": {
        "zh": "这一卦简单说就是『人在旅途，客居在外』的状态。无论你是出差、搬家、创业、异地打拼、流浪、移民还是暂时寄人篱下，都属于旅卦的场景。核心感觉就是：不踏实、没根、随时要走、不能太嚣张也不能太指望别人、必须低调灵活、自保第一。不是超级倒霉，但也发达不了，熬得住、守得正、会做人就能过得下去，硬刚或过于膨胀基本要吃亏。"
      }
    },
    {
      "id": 57,
      "key": "xun",
      "hexCode": "011011",
      "trigrams": {
        "upper": "xun",
        "lower": "xun"
      },
      "name": {
        "zh": "巽",
        "en": "Proceeding Humbly"
      },
      "judgement": {
        "zh": "巽。小亨。利有攸往。利见大人。\n\n简要解释：巽卦象征风，代表谦逊、顺从、进入。整体只有小通（小亨），不是大吉大利，但只要保持谦顺的态度做事，往前走是有利的，尤其是能遇到或拜见有德有位的大人物（大人），就会更有助力。像风一样柔顺渗透，反而能成事。",
        "en": "THE GENTLE. Success through what is small. It furthers one to have somewhere to go. It furthers one to see the great man."
      },
      "image": {
        "zh": "随风，巽。君子以申命行事。\n\n简要解释：卦象是两风相随，长风不断。君子看到这个景象，就懂得要反复申明命令、政令，认真推行事务。强调政令要像风一样深入人心、贯彻到底，但必须用柔顺的方式，而不是强硬命令。",
        "en": "Winds following one upon the other: The image of THE GENTLY PENETRATING. Thus the superior man Spreads his commands abroad And carries out his undertakings."
      },
      "tuan": {
        "zh": "",
        "en": "Penetration produces gradual and inconspicuous effects. It should be effected not by an act of violation but by influence that never lapses. Results of this kind are less striking to the eye than those won by surprise attack, but they are more enduring and more complete. If one would produce such effects, one must have a clearly defined goal, for only when the penetrating influence works always in the same direction can the object be attained. Small strength can achieve its purpose only by subordinating itself to an eminent man who is capable of creating order."
      },
      "lines": [
        {
          "zh": "初六：进退，利武人之贞。\n解释：起步阶段犹豫不决，进也不是退也不是。这时最适合像武人一样保持坚定的正直和原则，别优柔寡断，勇敢一点反而有利。",
          "en": "In advancing and in retreating,"
        },
        {
          "zh": "九二：巽在床下，用史巫纷若，吉，无咎。\n解释：态度特别谦卑，甚至卑躬屈膝到床底下去了，还请了很多巫师史官忙着祈祷祭祀。结果反而吉祥，没毛病。因为真心柔顺、中正得体，能化解很多麻烦。",
          "en": "Penetration under the bed. Priests and magicians are used in great number. Good fortune. No blame."
        },
        {
          "zh": "九三：频巽，吝。\n解释：三心二意、反复无常地去讨好顺从，装得太假或太勉强，心里其实不情愿。这样搞下去会让自己难受、招人看不起，有小遗憾。",
          "en": "Repeated penetration. Humiliation."
        },
        {
          "zh": "六四：悔亡，田获三品。\n解释：悔恨没了。打猎能捕获上中下三等猎物（田获三品），象征收获丰厚、功劳很大。因为位置合适、真诚顺从，所以自然得到回报，没了之前的遗憾。",
          "en": "Remorse vanishes. During the hunt"
        },
        {
          "zh": "九五：贞吉，悔亡，无不利，无初有终。先庚三日，后庚三日，吉。\n解释：守正就吉，悔恨消失，什么都顺利。开头可能不太好，但结局圆满。像‘先庚三日、后庚三日’那样提前三天下达命令、事后三天检查执行，反复确认，就大吉。强调中正位上要谨慎、反复叮嘱才能长久吉利。",
          "en": "Perseverance brings good fortune. Remorse vanishes."
        },
        {
          "zh": "上九：巽在床下，丧其资斧，贞凶。\n解释：谦卑过头，卑躬屈膝到床底下，结果连自己吃饭的家伙（资斧，比喻谋生工具或尊严）都丢了。即使守正也凶。提醒再顺从也不能丢掉底线和骨气，否则彻底完蛋。",
          "en": "Penetration under the bed. He loses his property and his ax. Perseverance brings misfortune."
        }
      ],
      "summary": {
        "zh": "嘿，巽卦简单说就是教你怎么做人做事最聪明：低调、顺势、别硬刚。风吹得再猛也悄无声息，却啥都能钻进去。想办事别太刚猛，学会先顺着、谦虚着、慢慢渗进去，往往比硬碰硬更管用。这卦不算超级旺，但只要你够会‘顺’，小事能成大事，关键时刻还能抱上大腿（利见大人）。就是别顺过头变成没原则的舔狗，那上九就直接翻车了。"
      }
    },
    {
      "id": 58,
      "key": "dui",
      "hexCode": "110110",
      "trigrams": {
        "upper": "dui",
        "lower": "dui"
      },
      "name": {
        "zh": "兑",
        "en": "Joyful"
      },
      "judgement": {
        "zh": "兑。亨，利贞。\n兑卦整体是亨通的，喜悦之道利于守正。意思是只要保持真诚的愉悦、不搞虚情假意、不谄媚逢迎，就能通达顺利。",
        "en": "THE JOYOUS. Success. Perseverance is favorable."
      },
      "image": {
        "zh": "象曰：丽泽，兑；君子以朋友讲习。\n两个大泽相连，水面互相映照滋润，象征喜悦相通。君子看到这个卦象，就应该多和朋友一起讨论学问、交流心得，在愉快的氛围中共同进步。",
        "en": "Lakes resting one on the other: The image of THE JOYOUS. Thus the superior man joins with his friends For discussion and practice."
      },
      "tuan": {
        "zh": "",
        "en": "The joyous mood is infectious and therefore brings success. But joy must be based on steadfastness if it is not to degenerate into uncontrolled mirth. Truth and strength must dwell in the heart, while gentleness reveals itself in social intercourse. In this way one assumes the right attitude toward God and man and achieves something. Under certain conditions, intimidation without gentleness may achieve something momentarily, but not for all time. When, on the other hand, the hearts of men are won by friendliness, they are led to take all hardships upon themselves willingly, and if need be will not shun death itself, so great is the power of joy over men."
      },
      "lines": [
        {
          "zh": "初九：和兑，吉。\n态度平和、与人同乐，这种喜悦最吉祥。像刚认识的朋友，大家不端着、不装，自然就开心。",
          "en": "Contented joyousness. Good fortune."
        },
        {
          "zh": "九二：孚兑，吉，悔亡。\n带着真诚去和大家一起高兴，吉祥，之前的遗憾和麻烦都会消失。核心就俩字：真心。",
          "en": "Sincere joyousness. Good fortune. Remorse disappears."
        },
        {
          "zh": "六三：来兑，凶。\n主动跑去讨好、献媚求欢，凶。越刻意表演越让人起疑，最后适得其反。",
          "en": "Coming joyousness. Misfortune."
        },
        {
          "zh": "九四：商兑未宁，介疾有喜。\n还在犹豫、商量怎么才能皆大欢喜，虽然有点小纠结、小毛病，但只要坚持原则，最后还是会有喜事。",
          "en": "Joyousness that is weighed is not at peace. After ridding himself of mistakes a man has joy."
        },
        {
          "zh": "九五：孚于剥，有厉。\n最危险的位置——被小人包围、被谄媚包围了，还相信那些甜言蜜语，会有大危险。提醒领导者：别被拍马屁拍晕了。",
          "en": "Sincerity toward disintegrating influences is dangerous."
        },
        {
          "zh": "上六：引兑。\n引导大家一起快乐。位置最高，反而要主动去带动氛围、做表率，但因为在最上层，也容易流于表面，所以要特别小心别变成强行安利快乐。",
          "en": "Seductive joyousness."
        }
      ],
      "summary": {
        "zh": "哎，兑卦简单说就是『开心但要真诚』这四个字。人生啊，最舒服的状态就是大家互相看着顺眼、聊得来、心往一处想、劲往一处使，但前提是必须发自内心，不能装开心、不能为了目的去讨好别人、不能油嘴滑舌。真诚的快乐最持久，也最能把大家都带动起来；要是假笑、硬哄、来者不拒地讨好，最后反而把自己玩崩了。这卦提醒咱们：想让日子过得舒坦、人缘好，就得内外一致地悦人悦己，别整那些虚头巴脑的。"
      }
    },
    {
      "id": 59,
      "key": "huan",
      "hexCode": "010011",
      "trigrams": {
        "upper": "xun",
        "lower": "kan"
      },
      "name": {
        "zh": "涣",
        "en": "Dispersing"
      },
      "judgement": {
        "zh": "渙。亨。王假有廟。利涉大川，利貞。\n\n這是渙卦的卦辭：整體亨通順利。君王親自到宗廟祭祀（凝聚人心、祈福安定），有利於渡過大江大河般的險阻難關，利於守正道。",
        "en": "DISPERSION. Success. The king approaches his temple. It furthers one to cross the great water. Perseverance furthers. The text of this hexagram resembles that of Ts'ui, GATHERING TOGETHER"
      },
      "image": {
        "zh": "風行水上，渙。先王以享于帝，立廟。\n\n象曰講風吹過水面，水波四散流動，這就是渙散的形象。先王看到這個現象，就用隆重祭祀上天、建立宗廟的方式來凝聚民心、安定天下。",
        "en": "The wind drives over the water: The image of DISPERSION. Thus the kings of old sacrificed to the Lord And built temples."
      },
      "tuan": {
        "zh": "",
        "en": "45. In the latter, the subject is the bringing together of elements that have been separated, as water collects in lakes upon the earth. Here the subject is the dispersing and dissolving of divisive egotism. DISPERSION shows the way, so to speak, that leads to gathering together. This explains the similarity of the two texts. Religious forces are needed to overcome the egotism that divides men. The common celebration of the great sacrificial feasts and sacred rites, which gave expression simultaneously to the interrelation and social articulation of the family and state, was the means of employed by the great ruler to unite men. The sacred music and the splendor of the ceremonies aroused a strong tide of emotion that was shared by all hearts in unison, and that awakened a consciousness of the common origin of all creatures. In this way disunity was overcome and rigidity dissolved. A further means to the same end is co-operation in great general undertakings that set a high goal for the will of the people; in the common concentration on this goal, all barriers dissolve, just as, when a boat is crossing a great stream, all hands must unite in a joint task. But only a man who is himself free of all selfish ulterior considerations, and who perseveres in justice and steadfastness, is capable of so dissolving the hardness of egotism."
      },
      "lines": [
        {
          "zh": "初六：用拯馬壯，吉。\n剛開始散的時候力量弱，趕緊借助強大的助力（像借好馬拉車一樣），順勢而為，就能吉祥。",
          "en": "He brings help with the strength of a horse. Good fortune."
        },
        {
          "zh": "九二：渙奔其機，悔亡。\n局面散亂時別猶豫，趕緊跑到安全的地方、抓住時機脫離危險，後悔就沒了。",
          "en": "At the dissolution He hurries to that which supports him. Remorse disappears."
        },
        {
          "zh": "六三：渙其躬，無悔。\n把自己的私心、小我散掉，無私奉獻、全力以赴，就不會有悔恨。",
          "en": "He dissolves his self. No remorse."
        },
        {
          "zh": "六四：渙其群，元吉。渙有丘，匪夷所思。\n把小團體、私黨散掉，大吉大利。把分散的力量重新聚成像山丘一樣的大團體，這種轉化不是一般人能想到的，神來之筆。",
          "en": "He dissolves his bond with his group."
        },
        {
          "zh": "九五：渙汗其大號，渙王居，無咎。\n像出大汗一樣發佈莊嚴的大命令，安定王的位置和天下秩序，沒有災禍。",
          "en": "His loud cries are as dissolving as sweat. Dissolution! A king abides without blame."
        },
        {
          "zh": "上九：渙其血，去逖出，無咎。\n把危險（血）和遠離傷害（逖）都散掉、徹底解除，沒有災咎。",
          "en": "He dissolves his blood. Departing, keeping at a distance, going out, Is without blame."
        }
      ],
      "summary": {
        "zh": "哎呀，渙卦這一卦說白了就是「散了又聚」的過程。現在局面有點亂，人心散了、團隊散了、資源也散了，但這不是世界末日，反而是個轉機。只要你別慌，抓住關鍵時機，用誠意和正確的方法（比如祭祀宗廟這種凝聚人心的方式）把大家的心再拉回來，就能渡過大難關，事情反而會變得更順。核心就是：散不是壞事，關鍵看你怎麼收拾殘局、重新凝聚力量。守正、及時行動、大公無私，就能化險為夷，甚至更上一層樓。"
      }
    },
    {
      "id": 60,
      "key": "jie_2",
      "hexCode": "110010",
      "trigrams": {
        "upper": "kan",
        "lower": "dui"
      },
      "name": {
        "zh": "节",
        "en": "Restricting"
      },
      "judgement": {
        "zh": "節。亨。苦節，不可貞。\n卦辞原文：節卦亨通顺利，但如果过度苦苦节制自己（太苛刻、太痛苦的节制），就不能持久守正，会走到穷途末路。适度节制才能长久吉祥，过度就反成灾。",
        "en": "LIMITATION. Success. Galling limitation must not be persevered in."
      },
      "image": {
        "zh": "象曰：澤上有水，節。君子以制數度，議德行。\n象辞原文：泽上蓄水，这就是节卦的卦象。君子看到这个卦象，就要制定礼法制度、数量标准，来规范人们的道德行为和日常行事。节制不是乱来，而是要有规矩、有分寸。",
        "en": "Water over lake: the image of LIMITATION. Thus the superior man Creates number and measure, And examines the nature of virtue and correct conduct."
      },
      "tuan": {
        "zh": "",
        "en": "Limitations are troublesome, but they are effective. If we live economically in normal times, we are prepared for times of want. To be sparing saves us from humiliation. Limitations are also indispensable in the regulation of world conditions. In nature there are fixed limits for summer and winter, day and night, and these limits give the year its meaning. In the same way, economy, by setting fixed limits upon expenditures, acts to preserve property and prevent injury to the people. But in limitation we must observe due measure. If a man should seek to impose galling limitations upon his own nature, it would be injurious. And if he should go too far in imposing limitations on others, they would rebel. Therefore it is necessary to set limits even upon limitation."
      },
      "lines": [
        {
          "zh": "初九：不出戶庭，無咎。\n刚开始要节制的时候，别乱跑乱动，老实在家里（或小范围内）待着最安全，没毛病。",
          "en": "Not going out of the door and the courtyard Is without blame."
        },
        {
          "zh": "九二：不出門庭，凶。\n该出门办事的时候还宅在家里过度谨慎，反而错失时机，大凶。节制不是怂，是该出手时就出手。",
          "en": "Not going out of the gate and the courtyard Brings misfortune."
        },
        {
          "zh": "六三：不節若，則嗟若，無咎。\n该节制的时候没管住自己，胡吃海塞、乱花钱、乱说话，事后后悔得直叹气。幸好知道后悔了，还来得及改，没大祸。",
          "en": "He who knows limitation Will have cause to lament."
        },
        {
          "zh": "六四：安節，亨。\n能够心安理得地过节制的生活，不觉得苦，反而觉得自然舒服，这样就亨通顺利了。",
          "en": "Contented limitation. Success."
        },
        {
          "zh": "九五：甘節，吉，往有尚。\n把节制当成一种甜美的享受、甘之如饴，主动去节制，这样大吉大利。往前走还会得到别人的尊重和赞赏。",
          "en": "Sweet limitation brings good fortune. Going brings esteem."
        },
        {
          "zh": "上六：苦節，貞凶，悔亡。\n到最上面了，还死守着极端苦行的节制方式，守正也凶。苦到最后悔都悔不下了，彻底走偏了。",
          "en": "Galling limitation. Perseverance brings misfortune. Remorse disappears."
        }
      ],
      "summary": {
        "zh": "哎，这节卦简单说就是告诉你：啥事都得有个度，节制是好事，能让你走得更远、更稳。花钱、说话、做事、甚至情绪，都得会收着点，别太放纵，也别太苦行僧式地虐自己。适度节制才叫聪明，过头了要么变败家子，要么把自己逼疯。生活中多点自制力，少点冲动和极端，日子才能过得顺顺当当，长长久久。"
      }
    },
    {
      "id": 61,
      "key": "zhong_fu",
      "hexCode": "110011",
      "trigrams": {
        "upper": "xun",
        "lower": "dui"
      },
      "name": {
        "zh": "中孚",
        "en": "Innermost Sincerity"
      },
      "judgement": {
        "zh": "中孚。豚鱼吉，利涉大川，利贞。\n\n简要解释：心中真诚守信，即使只用最简薄的豚（小猪）和鱼来祭祀，也能得到吉祥。因为诚信能感通万物，甚至愚钝微小的豚鱼都能感受到。利于冒大风险、渡过大难关（涉大川），最重要的是要坚守正道、保持诚信。",
        "en": "INNER TRUTH. Pigs and fishes. Good fortune. It furthers one to cross the great water. Perseverance furthers."
      },
      "image": {
        "zh": "象曰：泽上有风，中孚。君子以议狱缓死。\n\n简要解释：风吹在泽面上，风能吹动泽水无处不到，象征诚信之德无所不至、无所不通。君子看到这个卦象，就应该用诚信来处理刑狱之事，慎重审议案件，尽量宽缓死刑，给人改过自新的机会。",
        "en": "Wind over lake: the image of INNER TRUTH. Thus the superior man discusses criminal cases In order to delay executions."
      },
      "tuan": {
        "zh": "",
        "en": "Pigs and fishes are the least intelligent of all animals and therefore the most difficult to influence. The force of inner truth must grow great indeed before its influence can extend to such creatures. In dealing with persons as intractable and as difficult to influence as a pig or a fish, the whole secret of success depends on finding the right way of approach. One must first rid oneself of all prejudice and, so to speak, let the psyche of the other person act on one without restraint. Then one will establish contact with him, understand and gain power over him. When a door has thus been opened, the force of one's personality will influence him. If in this way one finds no obstacles insurmountable, one can undertake even the most dangerous things, such as crossing the great water, and succeed. But it is important to understand upon what the force inner truth depends. This force is not identical with simple intimacy or a secret bond. Close ties may exist also among thieves; it is true that such a bond acts as a force but, since it is not invincible, it does not bring good fortune. All association on the basis of common interests holds only up to a certain point. Where the community of interest ceases, the holding together ceases also, and the closest friendship often changes into hate. Only when the bond is based on what is right, on steadfastness, will it remain so firm that it triumphs over everything."
      },
      "lines": [
        {
          "zh": "初九：虞吉，有它不燕。\n简要解释：专心守信、心中有数就吉祥；要是三心二意、旁骛其他，就会不安稳。",
          "en": "Being prepared brings good fortune. If there are secret designs, it is disquieting."
        },
        {
          "zh": "九二：鸣鹤在阴，其子和之。我有好爵，吾与尔靡之。\n简要解释：鹤在幽暗处鸣叫，小鹤自然应和；我有美酒好爵，就愿意跟你一起分享。真诚的呼唤自然会得到真诚的回应，志同道合的人会心心相印。",
          "en": "A crane calling in the shade. Its young answers it. I have a good goblet. I will share it with you."
        },
        {
          "zh": "六三：得敌，或鼓或罢，或泣或歌。\n简要解释：遇到了对手（或内心冲突），一会儿斗志昂扬敲鼓前进，一会儿又泄气停下来，一会儿哭一会儿笑。内心没底、诚信不足，所以情绪反复、进退失据。",
          "en": "He finds a comrade."
        },
        {
          "zh": "六四：月几望，马匹亡，无咎。\n简要解释：月亮快要圆了（接近圆满），好马丢掉了匹配的同伴（断绝其他牵绊）。专心一意侍奉上级或目标，放弃其他杂念，就没有灾咎。",
          "en": "The moon nearly at the full."
        },
        {
          "zh": "九五：有孚挛如，无咎。\n简要解释：心中有诚信，像孪生兄弟一样紧紧相连、互相牵系。居中得正、诚信充实，自然上下同心，无灾无咎。",
          "en": "He possesses truth, which links together."
        },
        {
          "zh": "上九：翰音登于天，贞凶。\n简要解释：声音高飞上天（鸡叫声传得很远），但鸡毕竟飞不上去。靠空话、虚名、言过其实来博取诚信，固守这种做法必然凶险。",
          "en": "Cockcrow penetrating to heaven. Perseverance brings misfortune."
        }
      ],
      "summary": {
        "zh": "嘿，中孚这卦讲的就是一个字：真诚。不是表面客套的那种，而是打心眼儿里信得过人、让人也信得过你。心里空空荡荡没啥私心杂念，反而最能让人信任。做到这份儿上，小事大事都能过得去，哪怕面对超级难关也敢冲，因为大家都互相相信，团队就稳了。最关键是别变味儿，坚持正直、真诚到底才行。说白了：用真心换真心，天下就没过不去的坎儿。"
      }
    },
    {
      "id": 62,
      "key": "xiao_guo",
      "hexCode": "001100",
      "trigrams": {
        "upper": "zhen",
        "lower": "gen"
      },
      "name": {
        "zh": "小过",
        "en": "Little Exceeding"
      },
      "judgement": {
        "zh": "小過。亨，利貞。可小事，不可大事。飛鳥遺之音。不宜上，宜下，大吉。\n小过卦整体亨通，但必须守正道。只适合办小事情，不适合办大事情。就像飞鸟飞过，只留下声音（可闻而不可及），不宜向上飞（逆势、冒险），宜向下飞（顺势、低调），这样才能大吉。",
        "en": "PREPONDERANCE OF THE SMALL. Success. Perseverance furthers. Small things may be done; great things should not be done. The flying bird brings the message: It is not well to strive upward, It is well to remain below. Great good fortune. Exceptional modesty and conscientiousness are sure to be rewarded with success; however, if a man is not to throw himself away, it is important that they should not become empty form and subservience but be combined always with a correct dignity in personal behavior. We must understand the demands of the time in order to find the necessary offset for its deficiencies and damages. In any event we must not count on great success, since the requisite strength is lacking. In this lies the importance of the message that one should not strive after lofty things but hold to lowly things. The structure of the hexagram gives rise to the idea that this message is brought by a bird. In Ta Kuo, PREPONDERANCE OF THE GREAT"
      },
      "image": {
        "zh": "象曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。\n山上有雷，声音比平时大一点点，这就是“小过”的卦象。君子看到这个现象，就在行为上稍微过分恭敬一点，办丧事时悲哀稍微过一点，用度稍微节俭过一点——在这些小地方宁可稍微“过头”一点，也不要不足，以此来矫正自己，避免真正的过失。",
        "en": "Thunder on the mountain: The image of PREPONDERANCE OF THE SMALL. Thus in his conduct the superior man gives preponderance to reverence. In bereavement he gives preponderance to grief. In his expenditures he gives preponderance to thrift."
      },
      "tuan": {
        "zh": "",
        "en": "28, the four strong, heavy lines within, supported only by two weak lines without, give the image of a sagging ridgepole. Here the supporting weak lines are both outside and preponderant; this gives the image of a soaring bird. But a bird should not try to surpass itself and fly into the sun; it should descend to the earth, where its nest is. In this way it gives the message conveyed by the hexagram."
      },
      "lines": [
        {
          "zh": "初六：飛鳥以凶。\n刚开始就想飞得太高，像小鸟羽翼还没长好就逞强往上冲，结果很凶险。劝你先别动，安分点。",
          "en": "The bird meets with misfortune through flying."
        },
        {
          "zh": "六二：過其祖，遇其妣。不及其君，遇其臣。無咎。\n超过爷爷了，却遇到了奶奶；没赶上君王，却遇到了臣子。没有灾难。意思是小有超过但没越界，达到了次一等的目标，也算可以，没出大问题。",
          "en": "She passes by her ancestor And meets her ancestress. He does not reach his prince And meets the official."
        },
        {
          "zh": "九三：弗過遇之，往厲，必戒，勿用永貞。\n不要过度指责他，往前走有危险，必须警惕戒备，不用永远保持这种状态。提醒你遇到问题别太刚硬，适当收着点，但也别一直软弱下去。",
          "en": "If one is not extremely careful,"
        },
        {
          "zh": "九四：無咎，弗過遇之。往厲，必戒。勿用永貞。\n没有灾难，不要过度。往前有危险，必须警惕。不用永远守旧。位置尴尬，往前冲危险，不如守住，但也不能一辈子就这样，时机到了还是要动。",
          "en": "No blame. He meets him without passing by. Going brings danger. One must be on guard. Do not act. Be constantly persevering."
        },
        {
          "zh": "六五：密雲不雨，自我西郊。公弋取彼在穴。\n密云从西边过来却不下雨。用带绳的箭射中洞里的鸟（或兽）。象征有积累、有准备，但还没真正成功。像领导位置，事情酝酿了很久，还差临门一脚，耐心等、用巧办法就能得手。",
          "en": "Dense clouds,"
        },
        {
          "zh": "上六：弗遇過之，飛鳥離之，凶。\n没有遇上却超过了，像飞鸟飞离而去，很凶险。最上面那爻，过头了、飞太远了、脱离实际了，结果很惨。提醒到顶点时千万别再往上冲，收手吧。",
          "en": "He passes him by, not meeting him."
        }
      ],
      "summary": {
        "zh": "哎，这卦说白了就是：现在是大环境不允许你干大事的时候，别逞强、别冒进、别想一步登天。只能干点小事儿、小调整、小心翼翼地过日子。就像鸟儿在天上飞，飞太高会摔死，往下飞、找个地方落脚才安全。总的原则就是低调、收敛、别太张扬，在小地方稍微多付出一点（比如更谦虚、更节俭、更谨慎），反而能避开大麻烦，慢慢混得不错。想发大财、升大官、干大事？先等等，别硬来。"
      }
    },
    {
      "id": 63,
      "key": "ji_ji",
      "hexCode": "101010",
      "trigrams": {
        "upper": "kan",
        "lower": "li"
      },
      "name": {
        "zh": "既济",
        "en": "Already Fulfilled"
      },
      "judgement": {
        "zh": "既济。亨，小利贞，初吉终乱。\n原文卦辞：事情已经成功（既济），整体是亨通的，但这种亨通偏向于小事方面有利，利于坚守正道。开始阶段吉祥顺利，但如果止步不前或骄傲自满，最终会走向混乱。核心提醒：成功之后最容易出问题，要居安思危。",
        "en": "AFTER COMPLETION. Success in small matters. Perseverance furthers. At the beginning good fortune. At the end disorder."
      },
      "image": {
        "zh": "象曰：水在火上，既济。君子以思患而预防之。\n原文象辞：水在火上面，就是既济的卦象。君子看到这个现象，就要想到未来的隐患，从而提前预防、做好准备。成功时别放松警惕，正是最该警惕的时候。",
        "en": "Water over fire: the image of the condition In AFTER COMPLETION. Thus the superior man Takes thought of misfortune And arms himself against it in advance."
      },
      "tuan": {
        "zh": "",
        "en": "The transition from the old to the new time is already accomplished. In principle, everything stands systematized, and it si only in regard to details that success is still to be achieved. In respect to this, however, we must be careful to maintain the right attitude. Everything proceeds as if of its own accord, and this can all too easily tempt us to relax and let thing take their course without troubling over details. Such indifference is the root of all evil. Symptoms of decay are bound to be the result. Here we have the rule indicating the usual course of history. But this rule is not an inescapable law. He who understands it is in position to avoid its effects by dint of unremitting perseverance and caution."
      },
      "lines": [
        {
          "zh": "初九：曳其轮，濡其尾，无咎。\n拉住车轮，狐狸尾巴沾了水。没有灾祸。刚成功时别急着往前冲，适当踩刹车、慢一点反而安全。",
          "en": "He breaks his wheels. He gets his tail in the water."
        },
        {
          "zh": "六二：妇丧其茀，勿逐，七日得。\n妇人丢了车的遮帘，别追，七天自然会找回来。东西丢了别慌张追，时机到了自然回来。提醒成功后有些小损失不用太在意，顺其自然就好。",
          "en": "The woman loses the curtain of her carriage. Do not run after it; On the seventh day you will get it."
        },
        {
          "zh": "九三：高宗伐鬼方，三年克之，小人勿用。\n殷高宗讨伐鬼方，用了三年才攻克，不要任用小人。成功来之不易，需要长期坚持和艰苦努力，千万别用小人坏事。",
          "en": "The Illustrious Ancestor Disciplines the Devil's Country. After three years he conquers it. Inferior people must not be employed."
        },
        {
          "zh": "六四：繻有衣袽，终日戒。\n船漏水了，用破布棉絮堵住，一整天都要保持警惕。成功后隐患还在，像船漏水一样，要天天提防、时时检查。",
          "en": "The finest clothes turn to rags. Be careful all day long."
        },
        {
          "zh": "九五：东邻杀牛，不如西邻之禴祭，实受其福。\n东边邻居杀牛大肆祭祀，不如西边邻居简单薄祭，反而真正得到福报。成功后别搞形式主义、别铺张浪费，真诚简朴反而更得福。",
          "en": "The neighbor in the east who slaughters an ox Does not attain as much real happiness As the neighbor in the west With his small offering."
        },
        {
          "zh": "上六：濡其首，厉。\n狐狸过河把头都淹湿了，危险。走到最后一步反而翻车，大意失荆州，成功在望时最容易出大问题，极度危险。",
          "en": "He gets his head in the water. Danger."
        }
      ],
      "summary": {
        "zh": "嘿，哥们儿，既济卦就是告诉你：事情已经成了！看起来一切完美，水火相济、阴阳都到位、六爻全当位，简直是易经里最“圆满”的一卦。但老祖宗偏偏在这时候给你泼冷水：成了又怎样？越是圆满越容易翻车。开头爽，后面容易乱套。意思就是——成功不是终点，而是另一个更难的开始。千万别躺平、别膨胀、别以为万事大吉了，现在正是最该小心、最该保持低调、继续警惕的时候。物极必反，盛极必衰，懂？守成比创业难多了，稳住才能赢。"
      }
    },
    {
      "id": 64,
      "key": "wei_ji",
      "hexCode": "010101",
      "trigrams": {
        "upper": "li",
        "lower": "kan"
      },
      "name": {
        "zh": "未济",
        "en": "Not Yet Fulfilled"
      },
      "judgement": {
        "zh": "未济。亨，小狐汔济，濡其尾，无攸利。\n原文意思是：未济卦，通达。小狐狸快要渡过河了，却沾湿了尾巴，没有什么好处。简要解释：事情还没完成，虽然有通达的可能，但如果冒进或不谨慎，最后关头容易出问题，就像小狐狸眼看要成功却失败了，提醒要小心坚持到最后。",
        "en": "BEFORE COMPLETION. Success. But if the little fox, after nearly completing the crossing, Gets his tail in the water, There is nothing that would further."
      },
      "image": {
        "zh": "火在水上，未济。君子以慎辨物居方。\n原文意思是：火在水上面，这就是未济卦。君子因此谨慎分辨事物的性质，审慎安排事物的位置。简要解释：火水不相交、位置颠倒，象征事情未完成。君子要从中学习，做事要仔细分辨、摆正位置，不能乱来，要有条理和谨慎。",
        "en": "Fire over water: The image of the condition before transition. Thus the superior man is careful In the differentiation of things, So that each finds its place."
      },
      "tuan": {
        "zh": "",
        "en": "The conditions are difficult. The task is great and full of responsibility. It is nothing less than that of leading the world out of confusion back to order. But it is a task that promises success, because there is a goal that can unite the forces now tending in different directions. At first, however, one must move warily, like an old fox walking over ice. The caution of a fox walking over ice is proverbial in China. His ears are constantly alert to the cracking of the ice, as he carefully and circumspectly searches out the safest spots. A young fox who as yet has not acquired this caution goes ahead boldly, and it may happen that he falls in and gets his tail wet when he is almost across the water. Then of course his effort has been all in vain. Accordingly, in times \"before completion,\" deliberation and caution are the prerequisites of success."
      },
      "lines": [
        {
          "zh": "初六：濡其尾，吝。\n小狐狸刚开始渡河就湿了尾巴，有小遗憾/小麻烦。解释：起步就冒进或准备不足，容易出小问题，别急于求成。",
          "en": "He gets his tail in the water. Humiliating."
        },
        {
          "zh": "九二：曳其轮，贞吉。\n拖住车轮（控制速度），守正道吉祥。解释：懂得控制节奏、不瞎冲，稳稳地走正道，反而能有好结果。",
          "en": "He brakes his wheels. Perseverance brings good fortune."
        },
        {
          "zh": "六三：未济，征凶，利涉大川。\n事情未完成，出征有凶险，但利于涉过大河。解释：时机不对硬要前进会倒霉，但如果是大挑战反而有机会，提醒要看清形势，别小打小闹，要干就干大的。",
          "en": "Before completion, attack brings misfortune. It furthers one to cross the great water."
        },
        {
          "zh": "九四：贞吉，悔亡，震用伐鬼方，三年有赏于大国。\n守正吉祥，悔恨消失，用雷霆手段讨伐鬼方，三年后在大国得到奖赏。解释：坚持正道、用强硬手段解决顽固问题，虽然时间长（三年），但最终能成功并得到认可。",
          "en": "Perseverance brings good fortune. Remorse disappears."
        },
        {
          "zh": "六五：贞吉，无悔，君子之光，有孚，吉。\n守正吉祥，没有悔恨，这是君子的光辉，有诚信，吉祥。解释：处在高位却柔中守正，靠诚信和美德发光，结局非常好，是全卦最理想的一爻。",
          "en": "Perseverance brings good fortune."
        },
        {
          "zh": "上九：有孚于饮酒，无咎；濡其首，有孚失是。\n诚信地喝酒，没毛病；但喝到酒淋湿了头，虽然有诚信却失去了分寸。解释：事情快成了可以适当放松庆祝，但不能得意忘形、过度放纵，否则又毁了前面努力，前功尽弃。",
          "en": "There is drinking of wine In genuine confidence. No blame. But if one wets his head, He loses it, in truth."
        }
      ],
      "summary": {
        "zh": "哥们儿，这‘未济’卦就是告诉你：啥事儿都还没完呢！眼看着好像快成了，结果一不小心就翻车，就像小狐狸眼看要过河了，尾巴一湿全玩完。整体是‘还没到终点，别得意太早’的意思。表面乱七八糟、位置都不对，但其实有希望、有通达的可能，关键就看你能不能稳住、别急、别浪，坚持谨慎走完最后一步。既济是已经煮熟了，未济是火还在水上烧，还没成功，但也正因为没成功，所以未来充满可能性。总之：别松懈，慢慢来，稳扎稳打，最后才能真成事儿。"
      }
    }
  ]
}